----------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\asilv\Documents\GitHub\Paper-Precios-CLS\Final_Codes\do\../Results/output/output.log
  log type:  text
 opened on:  24 Sep 2020, 12:24:05

. 
. * Log Prices and CPI
. 
. g log_p = ln(p)

. g log_ipc = ln(ipc)

. 
. * CREATING INFLATION MEASURES
. 
. sort code date

. 
. by code: gen infp = log_p - L1.log_p
(23 missing values generated)

. by code: gen inf_m = log_ipc - L1.log_ipc
(23 missing values generated)

. 
. * CONSTRUCTING PRODUCT VERSION OF RPV.
. 
. tssmooth ma infpsmooth=infp, window(11 1 0)
The smoother applied was
     by code : (1/12)*[x(t-11) + x(t-10) + x(t-9) + x(t-8) + x(t-7) + x(t-6) + x(t-5) + x(t-4) + x(t-3) + x(t-2) + x(t-1) + ...; x(t)= infp

. replace infpsmooth=. if tin(1968m1, 1968m12)
(0 real changes made)

. by code: gen cv_s = (infp - inf_m)^2
(23 missing values generated)

. tssmooth ma cv=cv_s, window(11 1 0)
The smoother applied was
     by code : (1/12)*[x(t-11) + x(t-10) + x(t-9) + x(t-8) + x(t-7) + x(t-6) + x(t-5) + x(t-4) + x(t-3) + x(t-2) + x(t-1) + ...; x(t)= cv_s

. replace cv=. if tin(1968m1, 1968m12)
(0 real changes made)

. replace cv=sqrt(cv/(1+inf_m)^2)
(3,680 real changes made)

. gen synth_cv = cv*synthetic_weight
(23 missing values generated)

. 
. * AGGREGATE LEVEL INFLATION
. 
. g inf_a = log_ipc - L12.log_ipc
(276 missing values generated)

. by code: gen infp12 = log_p - L12.log_p
(276 missing values generated)

. 
. g synth_inf_a = infp12*synthetic_weight
(276 missing values generated)

. 
. * ADDING INFLATION LOADS
. 
. bys date: egen sinf_a = sum(synth_inf_a)

. 
. sort code date

. 
. foreach a in pcu imacec {
  2. g log_`a' = ln(`a')
  3. by code: g g`a'_a = log_`a' - L.log_`a'
  4. 
. }
(23 missing values generated)
(23 missing values generated)

. 
. 
. /*********************************************************************************************************************
> *********************************** ESTIMATION RESULTS ***************************************************************
> *********************************************************************************************************************/
. 
. local time_span "if tin(1970m1,1982m5)"

. 
. /* A. AGGREGATE LEVEL RESULTS */
. 
. * CLASSIC RPV (Parks (1979), Fischer (1981), and many others in the literature)
. 
. g classic_rpv_m = synthetic_weight*(infp - inf_m)^2  
(23 missing values generated)

. 
. preserve

. 
. collapse (sum) classic_rpv_m synth_inf_a (mean) inf_a inf_m gimacec_a gpcu_a year month, by(date)

. 
. corr synth_inf_a inf_a if tin(1970m1,1982m5)
(obs=149)

             | synth_~a    inf_a
-------------+------------------
 synth_inf_a |   1.0000
       inf_a |   0.9733   1.0000


. 
. * Caraballo and Dabus Definition (To account for increasing mean over time)
. 
. g cd_rpv_m = classic_rpv_m/(1+inf_m)^2 
(1 missing value generated)

. 
. g linf_a = ln(1+inf_a)
(12 missing values generated)

. 
. 
. g free_73 = 0

. replace free_73 = 1 if tin(1973m10, 1976m12)
(39 real changes made)

. 
. g free_77 = 0

. replace free_77 = 1 if tin(1977m1, 2005m12)
(65 real changes made)

. 
. g free73_inf_a = free_73*inf_a
(12 missing values generated)

. g free77_inf_a = free_77*inf_a
(12 missing values generated)

. 
. g free73_linf_a = linf_a*free_73
(12 missing values generated)

. g free77_linf_a = linf_a*free_77
(12 missing values generated)

. 
. 
. g t = _n

. tsset date, m
        time variable:  date, 1969m1 to 1982m5
                delta:  1 month

. 
. g lclassicrpvm = L.classic_rpv_m
(1 missing value generated)

. g lcdrpv = L.cd_rpv_m
(2 missing values generated)

. 
. label var inf_a "Annual Inflation ($\vspace{0pt}\pi^a_t$)"

. label var free_73 "Liberalization in 1973 ($\vspace{0pt}D^{73}_t$)"

. label var free_77 "Liberalization in 1977 ($\vspace{0pt}D^{77}_t$)"

. label var free73_inf_a "$\vspace{0pt}D\vspace{0pt}_t^{73}\vspace{0pt}\times \vspace{0pt}\pi^a_t$"

. label var free77_inf_a "$\vspace{0pt}D\vspace{0pt}_t^{77}\vspace{0pt}\times \vspace{0pt}\pi^a_t$"

. lab var linf_a "log(1+$\vspace{0pt}\pi^a_t$)"

. lab var free73_linf_a "$\vspace{0pt}D\vspace{0pt}_t^{73}\vspace{0pt}\times \log(1+\vspace{0pt}\pi^a_t)$"

. lab var free77_linf_a "$\vspace{0pt}D\vspace{0pt}_t^{77}\vspace{0pt}\times \log(1+\vspace{0pt}\pi^a_t)$"

. lab var lclassicrpvm "Lagged RPV"       

. lab var lcdrpv "Lagged RPV"     

. 
. 
. *********************************************** Aggregate Results *********************************************
.         
. * Period 1967m1 - 1979m5
. local time_span2 "if tin(1970m1,1982m5)"

. 
. ** TABLE 1. CLASSIC MEASURE 1970 - 1982
. 
. tempvar d73 d77

. 
. 
. reg classic_rpv_m inf_a lclassicrpvm `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(2, 146)         =       6.14
                                                Prob > F          =     0.0027
                                                R-squared         =     0.2781
                                                Root MSE          =     .04609

------------------------------------------------------------------------------
             |               Robust
classic_rp~m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       inf_a |   .0200978    .006325     3.18   0.002     .0075975    .0325981
lclassicrpvm |   .3854375   .2067247     1.86   0.064     -.023122     .793997
       _cons |   .0012318   .0051056     0.24   0.810    -.0088586    .0113221
------------------------------------------------------------------------------

. outreg2 using `table_results'/Table1.tex, replace bdec(3) sdec(2) tex(fragment) label ///
>                 keep(inf_a lclassicrpvm) ///
>                 ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table1.tex
dir : seeout

. 
. 
. reg classic_rpv_m inf_a free73_inf_a free77_inf_a lclassicrpvm `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(4, 144)         =       5.65
                                                Prob > F          =     0.0003
                                                R-squared         =     0.2861
                                                Root MSE          =     .04615

------------------------------------------------------------------------------
             |               Robust
classic_rp~m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       inf_a |   .0240766   .0117984     2.04   0.043     .0007562     .047397
free73_inf_a |  -.0062476   .0122892    -0.51   0.612    -.0305381    .0180429
free77_inf_a |  -.0214166   .0106542    -2.01   0.046    -.0424754   -.0003577
lclassicrpvm |   .3806176   .2041454     1.86   0.064    -.0228911    .7841262
       _cons |   .0044316   .0056016     0.79   0.430    -.0066403    .0155035
------------------------------------------------------------------------------

. outreg2 using `table_results'/Table1.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 keep(inf_a free73_inf_a free77_inf_a lclassicrpvm) ///
>                 ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table1.tex
dir : seeout

. 
. reg classic_rpv_m inf_a free73_inf_a free77_inf_a gimacec_a gpcu_a lclassicrpvm `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(6, 142)         =       4.15
                                                Prob > F          =     0.0007
                                                R-squared         =     0.2957
                                                Root MSE          =     .04616

------------------------------------------------------------------------------
             |               Robust
classic_rp~m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       inf_a |   .0256802   .0122399     2.10   0.038     .0014843    .0498761
free73_inf_a |  -.0080806   .0130839    -0.62   0.538    -.0339449    .0177837
free77_inf_a |  -.0212486   .0104448    -2.03   0.044     -.041896   -.0006012
   gimacec_a |   .0122843   .0097346     1.26   0.209    -.0069591    .0315278
      gpcu_a |  -.0381507   .0415658    -0.92   0.360    -.1203185     .044017
lclassicrpvm |   .3941647   .2043482     1.93   0.056     -.009793    .7981225
       _cons |   .0035518    .005574     0.64   0.525    -.0074669    .0145705
------------------------------------------------------------------------------

. outreg2 using `table_results'/Table1.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Macroeconomic Control Variables, \checkmark) keep(inf_a free73_inf_a free77_inf_a lclassicrpvm) ///
>                 ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table1.tex
dir : seeout

. 
.                 
. 
. ** TABLE 2. CARABALLO - DABUS MEASURE 1970 - 1982       
.                 
.                         
. reg cd_rpv_m inf_a lcdrpv `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(2, 146)         =      12.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3283
                                                Root MSE          =     .02594

------------------------------------------------------------------------------
             |               Robust
    cd_rpv_m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       inf_a |   .0111334    .003956     2.81   0.006     .0033149    .0189519
      lcdrpv |   .4399955   .1761297     2.50   0.014     .0919023    .7880887
       _cons |   .0033186   .0028297     1.17   0.243    -.0022739     .008911
------------------------------------------------------------------------------

. outreg2 using `table_results'/Table2.tex, replace bdec(3) sdec(2) tex(fragment) label ///
>                 keep(inf_a lcdrpv) ///
>                 ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table2.tex
dir : seeout

. 
. reg cd_rpv_m inf_a free73_inf_a free77_inf_a lcdrpv `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(4, 144)         =       8.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3430
                                                Root MSE          =     .02583

------------------------------------------------------------------------------
             |               Robust
    cd_rpv_m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       inf_a |   .0153793   .0087453     1.76   0.081    -.0019066    .0326651
free73_inf_a |  -.0059769   .0080843    -0.74   0.461    -.0219561    .0100022
free77_inf_a |  -.0163604   .0076721    -2.13   0.035     -.031525   -.0011958
      lcdrpv |   .4320006   .1796648     2.40   0.017     .0768797    .7871216
       _cons |   .0054112   .0039314     1.38   0.171    -.0023596    .0131819
------------------------------------------------------------------------------

. outreg2 using `table_results'/Table2.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 keep(inf_a free73_inf_a free77_inf_a lcdrpv) ///
>                 ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table2.tex
dir : seeout

. 
. reg cd_rpv_m inf_a free73_inf_a free77_inf_a gimacec_a gpcu_a lcdrpv `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(6, 142)         =       5.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3551
                                                Root MSE          =     .02577

------------------------------------------------------------------------------
             |               Robust
    cd_rpv_m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       inf_a |    .016903    .008827     1.91   0.058    -.0005464    .0343524
free73_inf_a |  -.0077372   .0083697    -0.92   0.357    -.0242824    .0088081
free77_inf_a |  -.0161291   .0074024    -2.18   0.031    -.0307623   -.0014958
   gimacec_a |   .0062216   .0039657     1.57   0.119    -.0016178    .0140609
      gpcu_a |  -.0399295   .0269484    -1.48   0.141    -.0932014    .0133424
      lcdrpv |   .4529081   .1822711     2.48   0.014     .0925925    .8132236
       _cons |   .0044696   .0040058     1.12   0.266    -.0034491    .0123883
------------------------------------------------------------------------------

. outreg2 using `table_results'/Table2.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Macroeconomic Control Variables, \checkmark) keep(inf_a free73_inf_a free77_inf_a lcdrpv) ///
>                 ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table2.tex
dir : seeout

.                 
. 
. * TABLE 3. USING LOG INFLATION  
. 
. reg classic_rpv_m linf_a free73_linf_a free77_linf_a lclassicrpvm `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(4, 144)         =       5.94
                                                Prob > F          =     0.0002
                                                R-squared         =     0.2841
                                                Root MSE          =     .04622

-------------------------------------------------------------------------------
              |               Robust
classic_rpv_m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       linf_a |   .0399638   .0191151     2.09   0.038     .0021814    .0777461
free73_linf_a |  -.0077362   .0189597    -0.41   0.684    -.0452113     .029739
free77_linf_a |  -.0309252   .0149243    -2.07   0.040    -.0604242   -.0014262
 lclassicrpvm |   .3847776   .2076469     1.85   0.066    -.0256521    .7952072
        _cons |   .0022872   .0058596     0.39   0.697    -.0092948    .0138692
-------------------------------------------------------------------------------

. outreg2 using `table_results'/Table3.tex, replace bdec(3) sdec(2) tex(fragment) label ///
>                 addtext( ) keep(linf_a free73_linf_a free77_linf_a lclassicrpvm) ///
>                 ctitle("Classic") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table3.tex
dir : seeout

. 
. 
. reg classic_rpv_m linf_a free73_linf_a free77_linf_a gimacec_a gpcu_a lclassicrpvm `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(6, 142)         =       4.36
                                                Prob > F          =     0.0005
                                                R-squared         =     0.2935
                                                Root MSE          =     .04624

-------------------------------------------------------------------------------
              |               Robust
classic_rpv_m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       linf_a |   .0424872    .019892     2.14   0.034     .0031645    .0818098
free73_linf_a |  -.0104579   .0202004    -0.52   0.605    -.0503903    .0294744
free77_linf_a |  -.0307608    .014684    -2.09   0.038    -.0597883   -.0017333
    gimacec_a |   .0122364   .0096331     1.27   0.206    -.0068063    .0312792
       gpcu_a |  -.0364558   .0404119    -0.90   0.369    -.1163426    .0434309
 lclassicrpvm |   .3978965   .2079957     1.91   0.058    -.0132717    .8090647
        _cons |   .0012726   .0058961     0.22   0.829    -.0103828     .012928
-------------------------------------------------------------------------------

. outreg2 using `table_results'/Table3.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Macroeconomic Control Variables, \checkmark) keep(linf_a free73_linf_a free77_linf_a lclassicrpvm) ///
>                 ctitle("Classic") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table3.tex
dir : seeout

.                 
. reg cd_rpv_m linf_a free73_linf_a free77_linf_a lcdrpv `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(4, 144)         =       8.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3427
                                                Root MSE          =     .02584

-------------------------------------------------------------------------------
              |               Robust
     cd_rpv_m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       linf_a |   .0256633   .0141224     1.82   0.071    -.0022508    .0535773
free73_linf_a |   -.007919   .0125449    -0.63   0.529    -.0327149    .0168769
free77_linf_a |  -.0230981   .0108637    -2.13   0.035    -.0445709   -.0016253
       lcdrpv |   .4317655   .1802259     2.40   0.018     .0755355    .7879955
        _cons |   .0039604   .0043755     0.91   0.367    -.0046881    .0126088
-------------------------------------------------------------------------------

. outreg2 using `table_results'/Table3.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext() keep(linf_a free73_linf_a free77_linf_a lcdrpv) ///
>                 ctitle("CD") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table3.tex
dir : seeout

. 
. reg cd_rpv_m linf_a free73_linf_a free77_linf_a gimacec_a gpcu_a lcdrpv `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(6, 142)         =       5.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3542
                                                Root MSE          =     .02579

-------------------------------------------------------------------------------
              |               Robust
     cd_rpv_m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       linf_a |   .0280477    .014301     1.96   0.052    -.0002228    .0563181
free73_linf_a |  -.0105313   .0130604    -0.81   0.421    -.0363492    .0152865
free77_linf_a |  -.0228199   .0105325    -2.17   0.032    -.0436407   -.0019991
    gimacec_a |   .0061729   .0038916     1.59   0.115    -.0015201    .0138659
       gpcu_a |  -.0382657   .0265745    -1.44   0.152    -.0907986    .0142671
       lcdrpv |   .4521453    .182909     2.47   0.015     .0905688    .8137219
        _cons |    .002892   .0044711     0.65   0.519    -.0059466    .0117306
-------------------------------------------------------------------------------

. outreg2 using `table_results'/Table3.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Macroeconomic Control Variables, \checkmark) keep(linf_a free73_linf_a free77_linf_a lcdrpv) ///
>                 ctitle("CD") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table3.tex
dir : seeout

.                 
. restore

. 
. ************************** AGGREGATE RESULTS USING PRODUCT LEVEL DATA
. 
. preserve

. 
. collapse (sum) synth_cv (mean) inf_a gimacec_a gpcu_a year month, by(date)

. 
. g linf_a = ln(1+inf_a)
(12 missing values generated)

. 
. g free_73 = 0

. replace free_73 = 1 if tin(1973m10, 1976m12)
(39 real changes made)

. 
. g free_77 = 0

. replace free_77 = 1 if tin(1977m1, 2005m12)
(65 real changes made)

. 
. 
. g free73_inf_a = free_73*inf_a
(12 missing values generated)

. g free77_inf_a = free_77*inf_a
(12 missing values generated)

. 
. g free73_linf_a = linf_a*free_73
(12 missing values generated)

. g free77_linf_a = linf_a*free_77
(12 missing values generated)

. 
. label var inf_a "Annual Inflation ($\vspace{0pt}\pi^a_t$)"

. label var free_73 "Liberalization in 1973 ($\vspace{0pt}D^{73}_t$)"

. label var free_77 "Liberalization in 1977 ($\vspace{0pt}D^{73}_t$)"

. 
. label var free73_inf_a "$\vspace{0pt}D\vspace{0pt}_t^{73}\vspace{0pt}\times \vspace{0pt}\pi^a_t$"

. label var free77_inf_a "$\vspace{0pt}D\vspace{0pt}_t^{77}\vspace{0pt}\times \vspace{0pt}\pi^a_t$"

. lab var linf_a "log(1+$\vspace{0pt}\pi^a_t$)"

. lab var free73_linf_a "$\vspace{0pt}D\vspace{0pt}_t^{73}\vspace{0pt}\times \log(1+\vspace{0pt}\pi^a_t)$"

. lab var free77_linf_a "$\vspace{0pt}D\vspace{0pt}_t^{77}\vspace{0pt}\times \log(1+\vspace{0pt}\pi^a_t)$"        

. 
. tsset date, m
        time variable:  date, 1969m1 to 1982m5
                delta:  1 month

. 
. g lsynth_cv = L.synth_cv
(1 missing value generated)

. 
. label var lsynth_cv "Lagged RPV"

. 
. 
. local time_span2 "if tin(1970m1,1982m5)"

. 
. ** TABLE 4. AGGREGATE RESULTS USING SYNTHETIC INFLATION
. 
. tempvar d73 d77

. 
. reg synth_cv inf_a lsynth_cv `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(2, 146)         =     577.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9479
                                                Root MSE          =     .01274

------------------------------------------------------------------------------
             |               Robust
    synth_cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       inf_a |   .0130525   .0056103     2.33   0.021     .0019645    .0241404
   lsynth_cv |   .8434748   .0596018    14.15   0.000     .7256811    .9612686
       _cons |   .0081298   .0034083     2.39   0.018     .0013938    .0148657
------------------------------------------------------------------------------

. outreg2 using `table_results'/Table4.tex, replace ///
> bdec(3) sdec(2) tex(fragment) label ///
>                 keep(lsynth_cv inf_a) ///
>                 ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table4.tex
dir : seeout

. 
. reg synth_cv inf_a free73_inf_a free77_inf_a lsynth_cv `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(4, 144)         =     398.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9489
                                                Root MSE          =      .0127

------------------------------------------------------------------------------
             |               Robust
    synth_cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       inf_a |   .0143222   .0044651     3.21   0.002     .0054965    .0231479
free73_inf_a |   -.002546   .0037093    -0.69   0.494    -.0098779    .0047858
free77_inf_a |  -.0077617   .0027977    -2.77   0.006    -.0132915   -.0022319
   lsynth_cv |   .8485632   .0699985    12.12   0.000     .7102059    .9869205
       _cons |   .0088991   .0043956     2.02   0.045     .0002108    .0175874
------------------------------------------------------------------------------

. outreg2 using `table_results'/Table4.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 keep( lsynth_cv inf_a free73_inf_a free77_inf_a) ///
>                 ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table4.tex
dir : seeout

. 
. 
. 
. reg synth_cv inf_a free73_inf_a free77_inf_a gimacec_a gpcu_a lsynth_cv `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(6, 142)         =     288.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9493
                                                Root MSE          =     .01274

------------------------------------------------------------------------------
             |               Robust
    synth_cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       inf_a |   .0137991   .0042709     3.23   0.002     .0053563     .022242
free73_inf_a |  -.0024144   .0039794    -0.61   0.545    -.0102809    .0054522
free77_inf_a |  -.0077468   .0028234    -2.74   0.007    -.0133281   -.0021656
   gimacec_a |  -.0026726    .002896    -0.92   0.358    -.0083974    .0030521
      gpcu_a |   .0050691   .0186004     0.27   0.786    -.0317003    .0418386
   lsynth_cv |   .8532211   .0662436    12.88   0.000     .7222701    .9841722
       _cons |   .0087022   .0042492     2.05   0.042     .0003024     .017102
------------------------------------------------------------------------------

. outreg2 using `table_results'/Table4.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Macroeconomic Control Variables, \checkmark) keep(lsynth_cv inf_a free73_inf_a free77_inf_a ) ///
>                 ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table4.tex
dir : seeout

.                 
.                 
. reg synth_cv linf_a free73_linf_a free77_linf_a lsynth_cv `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(4, 144)         =     391.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9475
                                                Root MSE          =     .01288

-------------------------------------------------------------------------------
              |               Robust
     synth_cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       linf_a |   .0211353   .0063406     3.33   0.001     .0086025    .0336681
free73_linf_a |  -.0046573   .0055294    -0.84   0.401    -.0155865    .0062719
free77_linf_a |  -.0124393   .0037277    -3.34   0.001    -.0198075   -.0050711
    lsynth_cv |   .8799837   .0555034    15.85   0.000      .770277    .9896904
        _cons |    .005903   .0034257     1.72   0.087    -.0008681    .0126741
-------------------------------------------------------------------------------

. outreg2 using `table_results'/Table4.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 keep(lsynth_cv linf_a free73_linf_a free77_linf_a) ///
>                 ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table4.tex
dir : seeout

. 
. reg synth_cv linf_a free73_linf_a free77_linf_a gimacec_a gpcu_a lsynth_cv `time_span2', vce(r)

Linear regression                               Number of obs     =        149
                                                F(6, 142)         =     283.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9480
                                                Root MSE          =     .01291

-------------------------------------------------------------------------------
              |               Robust
     synth_cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       linf_a |   .0197894   .0061954     3.19   0.002     .0075422    .0320366
free73_linf_a |   -.004312    .006018    -0.72   0.475    -.0162084    .0075843
free77_linf_a |  -.0123035   .0038217    -3.22   0.002    -.0198583   -.0047486
    gimacec_a |  -.0028161   .0029945    -0.94   0.349    -.0087356    .0031035
       gpcu_a |   .0094687   .0200659     0.47   0.638    -.0301979    .0491353
    lsynth_cv |   .8864327   .0524052    16.91   0.000     .7828375    .9900279
        _cons |    .005741    .003343     1.72   0.088    -.0008674    .0123494
-------------------------------------------------------------------------------

. outreg2 using `table_results'/Table4.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Macroeconomic Control Variables, \checkmark) keep(lsynth_cv linf_a free73_linf_a free77_linf_a ) ///
>                 ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table4.tex
dir : seeout

.                 
. 
. restore

. 
. 
. ************************* END AGGREGATE RESULTS ***********************************
. 
. * treated_code: prices that were fixed up to 1976m12
. local treated_code 2 3 4 5 6 7 9 10 21 23 

. * free_code: prices that were fixed up to 1973m9
. local free_code 1 8 11 12 13 14 15 16 17 18 19 20 22

. 
. * Free Prices
. 
. g dtreated_free=0

. 
. foreach i in `free_code'{
  2. replace dtreated_free=1 if code==`i'
  3. }
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)

. 
. *******************************************************************************
. 
. * free_code_73: prices that were fixed up to 1973m10
. local free_code_73 1 8 11 12 13 14 15 16 17 18 19 20 22

. * free_code_73: prices that were fixed up to 1976m12
. local free_code_77 2 3 4 5 6 7 9 10 21 23

. 
. 
. g dtreated_1973=0

. 
. foreach i in `free_code_73'{
  2. replace dtreated_1973=1 if code==`i'
  3. }
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)

. 
. g dtreated_1977=0

. 
. foreach i in `free_code_77'{
  2. replace dtreated_1977=1 if code==`i'
  3. }
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)
(161 real changes made)

. 
. g dperiod_1973=0

. replace dperiod_1973=1 if tin(1973m11, 1982m05)
(2,369 real changes made)

. g dperiod_1977=0

. replace dperiod_1977=1 if tin(1977m01, 1982m05)
(1,495 real changes made)

. 
. g dint_1=dperiod_1973*dtreated_1973

. g dint_2=dperiod_1977*dtreated_1977

. 
. foreach v of varlist infp inf_a {
  2. g dtreated_1973_`v'=dtreated_1973*`v'
  3. g dtreated_1977_`v'=dtreated_1977*`v'
  4. 
. g dperiod_1973_`v'=dperiod_1973*`v'
  5. g dperiod_1977_`v'=dperiod_1977*`v'
  6. 
. g dint1_`v'=dint_1*`v'
  7. g dint2_`v'=dint_2*`v'
  8. }
(23 missing values generated)
(23 missing values generated)
(23 missing values generated)
(23 missing values generated)
(23 missing values generated)
(23 missing values generated)
(276 missing values generated)
(276 missing values generated)
(276 missing values generated)
(276 missing values generated)
(276 missing values generated)
(276 missing values generated)

. *******************************************************************************
. sort code date

. 
. g pinicial=p

. *replace p=p/ipc
. g p2=p/L12.p-1
(276 missing values generated)

. drop p

. g p=p2
(276 missing values generated)

. drop p2

. 
. *** Creating ID
. 
. sort code date

. encode code_name, gen(id)

. label var id "Product"

. 
. 
. ***** Labelling variables
. 
. label var gimacec_a "Production (Annual Growth rate)"

. label var gpcu_a "Copper Price (Annual Growth rate)"

. 
. label var infp "Product-Specific Inflation (Annual)"

. label var inf_a "Annual Inflation $\left[\phi_1\right]$"

. label var dtreated_1973_inf_a  "$\vspace{0pt}D_i \vspace{0pt}\times \pi_t^a \left[\phi_2\right]$"

. label var dtreated_1977_inf_a  "$\vspace{0pt}D_i \vspace{0pt}\times \pi_t^a \left[\phi_2\right]$"

. label var dperiod_1973_inf_a "$\vspace{0pt}D\vspace{0pt}_t^{73}\vspace{0pt}\times \pi_t^a \left[\phi_3\right]$"

. label var dperiod_1977_inf_a "$\vspace{0pt}D\vspace{0pt}_t^{77}\vspace{0pt}\times \pi_t^a \left[\phi_3\right]$"

. 
. 
. label var dperiod_1973 "Liberalization Period ($\vspace{0pt}D\vspace{0pt}_t^{73}\vspace{0pt}$)"

. label var dperiod_1977 "Liberalization Period ($\vspace{0pt}D\vspace{0pt}_t^{77}\vspace{0pt})$"

. label var dtreated_1973 "Liberalized Prices $\vspace{0pt}(D_i)$"

. label var dtreated_1977 "Liberalized Prices $\vspace{0pt}(D_i)$"

. label var dint_1 "$\vspace{0pt} D_{i}\times \vspace{0pt}D\vspace{0pt}_t^{73}\vspace{0pt}$"

. label var dint_2 "$\vspace{0pt} D_{i}\times \vspace{0pt}D\vspace{0pt}_t^{77}\vspace{0pt}$"

. label var dint1_inf_a "$\vspace{0pt}D\vspace{0pt}_{it}^{73}\times \pi_t^a \left[\phi_4\right]$"

. label var dint2_inf_a "$\vspace{0pt}D\vspace{0pt}_{it}^{77}\times \pi_t^a \left[\phi_4\right]$"

. 
. 
. 
. 
. label var code "Products"

. 
. local time_span "if tin(1970m1,2005m12)"

. 
. keep if tin(1970m1,1982m5)
(276 observations deleted)

. 
. tab year, gen(y_)

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1970 |        276        8.05        8.05
       1971 |        276        8.05       16.11
       1972 |        276        8.05       24.16
       1973 |        276        8.05       32.21
       1974 |        276        8.05       40.27
       1975 |        276        8.05       48.32
       1976 |        276        8.05       56.38
       1977 |        276        8.05       64.43
       1978 |        276        8.05       72.48
       1979 |        276        8.05       80.54
       1980 |        276        8.05       88.59
       1981 |        276        8.05       96.64
       1982 |        115        3.36      100.00
------------+-----------------------------------
      Total |      3,427      100.00

. tab month, gen(m_)

      month |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        299        8.72        8.72
          2 |        299        8.72       17.45
          3 |        299        8.72       26.17
          4 |        299        8.72       34.90
          5 |        299        8.72       43.62
          6 |        276        8.05       51.68
          7 |        276        8.05       59.73
          8 |        276        8.05       67.79
          9 |        276        8.05       75.84
         10 |        276        8.05       83.89
         11 |        276        8.05       91.95
         12 |        276        8.05      100.00
------------+-----------------------------------
      Total |      3,427      100.00

. egen yearmonth = group(year month)

. tab yearmonth, gen(ym_)

 group(year |
     month) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         23        0.67        0.67
          2 |         23        0.67        1.34
          3 |         23        0.67        2.01
          4 |         23        0.67        2.68
          5 |         23        0.67        3.36
          6 |         23        0.67        4.03
          7 |         23        0.67        4.70
          8 |         23        0.67        5.37
          9 |         23        0.67        6.04
         10 |         23        0.67        6.71
         11 |         23        0.67        7.38
         12 |         23        0.67        8.05
         13 |         23        0.67        8.72
         14 |         23        0.67        9.40
         15 |         23        0.67       10.07
         16 |         23        0.67       10.74
         17 |         23        0.67       11.41
         18 |         23        0.67       12.08
         19 |         23        0.67       12.75
         20 |         23        0.67       13.42
         21 |         23        0.67       14.09
         22 |         23        0.67       14.77
         23 |         23        0.67       15.44
         24 |         23        0.67       16.11
         25 |         23        0.67       16.78
         26 |         23        0.67       17.45
         27 |         23        0.67       18.12
         28 |         23        0.67       18.79
         29 |         23        0.67       19.46
         30 |         23        0.67       20.13
         31 |         23        0.67       20.81
         32 |         23        0.67       21.48
         33 |         23        0.67       22.15
         34 |         23        0.67       22.82
         35 |         23        0.67       23.49
         36 |         23        0.67       24.16
         37 |         23        0.67       24.83
         38 |         23        0.67       25.50
         39 |         23        0.67       26.17
         40 |         23        0.67       26.85
         41 |         23        0.67       27.52
         42 |         23        0.67       28.19
         43 |         23        0.67       28.86
         44 |         23        0.67       29.53
         45 |         23        0.67       30.20
         46 |         23        0.67       30.87
         47 |         23        0.67       31.54
         48 |         23        0.67       32.21
         49 |         23        0.67       32.89
         50 |         23        0.67       33.56
         51 |         23        0.67       34.23
         52 |         23        0.67       34.90
         53 |         23        0.67       35.57
         54 |         23        0.67       36.24
         55 |         23        0.67       36.91
         56 |         23        0.67       37.58
         57 |         23        0.67       38.26
         58 |         23        0.67       38.93
         59 |         23        0.67       39.60
         60 |         23        0.67       40.27
         61 |         23        0.67       40.94
         62 |         23        0.67       41.61
         63 |         23        0.67       42.28
         64 |         23        0.67       42.95
         65 |         23        0.67       43.62
         66 |         23        0.67       44.30
         67 |         23        0.67       44.97
         68 |         23        0.67       45.64
         69 |         23        0.67       46.31
         70 |         23        0.67       46.98
         71 |         23        0.67       47.65
         72 |         23        0.67       48.32
         73 |         23        0.67       48.99
         74 |         23        0.67       49.66
         75 |         23        0.67       50.34
         76 |         23        0.67       51.01
         77 |         23        0.67       51.68
         78 |         23        0.67       52.35
         79 |         23        0.67       53.02
         80 |         23        0.67       53.69
         81 |         23        0.67       54.36
         82 |         23        0.67       55.03
         83 |         23        0.67       55.70
         84 |         23        0.67       56.38
         85 |         23        0.67       57.05
         86 |         23        0.67       57.72
         87 |         23        0.67       58.39
         88 |         23        0.67       59.06
         89 |         23        0.67       59.73
         90 |         23        0.67       60.40
         91 |         23        0.67       61.07
         92 |         23        0.67       61.74
         93 |         23        0.67       62.42
         94 |         23        0.67       63.09
         95 |         23        0.67       63.76
         96 |         23        0.67       64.43
         97 |         23        0.67       65.10
         98 |         23        0.67       65.77
         99 |         23        0.67       66.44
        100 |         23        0.67       67.11
        101 |         23        0.67       67.79
        102 |         23        0.67       68.46
        103 |         23        0.67       69.13
        104 |         23        0.67       69.80
        105 |         23        0.67       70.47
        106 |         23        0.67       71.14
        107 |         23        0.67       71.81
        108 |         23        0.67       72.48
        109 |         23        0.67       73.15
        110 |         23        0.67       73.83
        111 |         23        0.67       74.50
        112 |         23        0.67       75.17
        113 |         23        0.67       75.84
        114 |         23        0.67       76.51
        115 |         23        0.67       77.18
        116 |         23        0.67       77.85
        117 |         23        0.67       78.52
        118 |         23        0.67       79.19
        119 |         23        0.67       79.87
        120 |         23        0.67       80.54
        121 |         23        0.67       81.21
        122 |         23        0.67       81.88
        123 |         23        0.67       82.55
        124 |         23        0.67       83.22
        125 |         23        0.67       83.89
        126 |         23        0.67       84.56
        127 |         23        0.67       85.23
        128 |         23        0.67       85.91
        129 |         23        0.67       86.58
        130 |         23        0.67       87.25
        131 |         23        0.67       87.92
        132 |         23        0.67       88.59
        133 |         23        0.67       89.26
        134 |         23        0.67       89.93
        135 |         23        0.67       90.60
        136 |         23        0.67       91.28
        137 |         23        0.67       91.95
        138 |         23        0.67       92.62
        139 |         23        0.67       93.29
        140 |         23        0.67       93.96
        141 |         23        0.67       94.63
        142 |         23        0.67       95.30
        143 |         23        0.67       95.97
        144 |         23        0.67       96.64
        145 |         23        0.67       97.32
        146 |         23        0.67       97.99
        147 |         23        0.67       98.66
        148 |         23        0.67       99.33
        149 |         23        0.67      100.00
------------+-----------------------------------
      Total |      3,427      100.00

. 
. ********************* TABLE 5. RESULTS USING WITHIN RPV (1970 - 1976)
. 
. xtreg cv inf_a if tin(1970m1, 1976m12), fe vce(r)

Fixed-effects (within) regression               Number of obs     =      1,932
Group variable: code                            Number of groups  =         23

R-sq:                                           Obs per group:
     within  = 0.2545                                         min =         84
     between =      .                                         avg =       84.0
     overall = 0.2089                                         max =         84

                                                F(1,22)           =      48.92
corr(u_i, Xb)  = -0.0000                        Prob > F          =     0.0000

                                  (Std. Err. adjusted for 23 clusters in code)
------------------------------------------------------------------------------
             |               Robust
          cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       inf_a |   .0741916   .0106075     6.99   0.000      .052193    .0961902
       _cons |   .0680066   .0114377     5.95   0.000     .0442862     .091727
-------------+----------------------------------------------------------------
     sigma_u |  .04689012
     sigma_e |  .08532827
         rho |   .2319385   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using `table_results'/Table5.tex, replace bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark) keep(inf_a) ///
>                 ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table5.tex
dir : seeout

.                 
. xtreg cv inf_a dtreated_1973 dperiod_1973 dint_1 dtreated_1973_inf_a dperiod_1973_inf_a dint1_inf_a  if tin(1970m1, 1976m12), fe vce(r)
note: dtreated_1973 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      1,932
Group variable: code                            Number of groups  =         23

R-sq:                                           Obs per group:
     within  = 0.3933                                         min =         84
     between = 0.3506                                         avg =       84.0
     overall = 0.2596                                         max =         84

                                                F(6,22)           =      12.19
corr(u_i, Xb)  = -0.1398                        Prob > F          =     0.0000

                                         (Std. Err. adjusted for 23 clusters in code)
-------------------------------------------------------------------------------------
                    |               Robust
                 cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              inf_a |   .0523004   .0114649     4.56   0.000     .0285237    .0760771
      dtreated_1973 |          0  (omitted)
       dperiod_1973 |  -.3561968   .0671961    -5.30   0.000     -.495553   -.2168405
             dint_1 |   .3463684   .1268234     2.73   0.012     .0833528     .609384
dtreated_1973_inf_a |  -.0255983   .0165715    -1.54   0.137    -.0599654    .0087688
 dperiod_1973_inf_a |   .2467987   .0477788     5.17   0.000     .1477116    .3458857
        dint1_inf_a |  -.2117917   .0813689    -2.60   0.016    -.3805404   -.0430429
              _cons |   .0877291   .0093736     9.36   0.000     .0682895    .1071688
--------------------+----------------------------------------------------------------
            sigma_u |   .0550921
            sigma_e |  .07707891
                rho |  .33812816   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------

. outreg2 using `table_results'/Table5.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark) keep(inf_a dperiod_1973 dint_1 dtreated_1973_inf_a dperiod_1973_inf_a dint1_inf_a) ///
>                 ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table5.tex
dir : seeout

.                 
. xtreg cv inf_a dtreated_1973 dperiod_1973 dint_1 dtreated_1973_inf_a dperiod_1973_inf_a dint1_inf_a i.month i.year i.month#i.year  if tin(1970m1, 
> 1976m12), fe vce(r)
note: dtreated_1973 omitted because of collinearity
note: 12.month#1973.year omitted because of collinearity
note: 12.month#1975.year omitted because of collinearity
note: 12.month#1976.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      1,932
Group variable: code                            Number of groups  =         23

R-sq:                                           Obs per group:
     within  = 0.4642                                         min =         84
     between = 0.3506                                         avg =       84.0
     overall = 0.3171                                         max =         84

                                                F(26,22)          =          .
corr(u_i, Xb)  = -0.1290                        Prob > F          =          .

                                         (Std. Err. adjusted for 23 clusters in code)
-------------------------------------------------------------------------------------
                    |               Robust
                 cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              inf_a |   1.877675   .7839969     2.40   0.026     .2517646    3.503585
      dtreated_1973 |          0  (omitted)
       dperiod_1973 |   2.812501   1.125221     2.50   0.020     .4789354    5.146067
             dint_1 |   .3463684   .1295438     2.67   0.014      .077711    .6150257
dtreated_1973_inf_a |  -.0255983   .0169269    -1.51   0.145    -.0607026     .009506
 dperiod_1973_inf_a |  -1.911197   .8218217    -2.33   0.030    -3.615551   -.2068432
        dint1_inf_a |  -.2117917   .0831143    -2.55   0.018    -.3841601   -.0394232
                    |
              month |
                 2  |   .0092429   .0024952     3.70   0.001     .0040682    .0144176
                 3  |   .0020827   .0017011     1.22   0.234    -.0014451    .0056106
                 4  |   .0127072   .0062807     2.02   0.055    -.0003182    .0257325
                 5  |   .0245773   .0102604     2.40   0.026     .0032985    .0458561
                 6  |   .0295286   .0144113     2.05   0.053    -.0003586    .0594159
                 7  |   .0162381   .0094369     1.72   0.099    -.0033328    .0358089
                 8  |   .0016958   .0077897     0.22   0.830     -.014459    .0178506
                 9  |  -.0371476   .0176323    -2.11   0.047    -.0737148   -.0005804
                10  |   -.046019   .0213838    -2.15   0.043    -.0903662   -.0016718
                11  |  -.0450354   .0193013    -2.33   0.029    -.0850639   -.0050069
                12  |  -.0397011    .014792    -2.68   0.014    -.0703778   -.0090244
                    |
               year |
              1971  |   .0383942   .0358938     1.07   0.296     -.036045    .1128333
              1972  |  -.0629474   .0217224    -2.90   0.008    -.1079968   -.0178979
              1973  |  -1.946596   .8221377    -2.37   0.027    -3.651605   -.2415867
              1974  |  -2.002546   .8322764    -2.41   0.025    -3.728582   -.2765107
              1975  |  -2.182444   .8399988    -2.60   0.016    -3.924495   -.4403931
              1976  |  -2.237979   .8535449    -2.62   0.016    -4.008122   -.4678349
                    |
         month#year |
            2 1971  |   .0636749   .0306425     2.08   0.050     .0001262    .1272236
            2 1972  |  -.1431276   .0586642    -2.44   0.023    -.2647897   -.0214655
            2 1973  |   .0555302   .0217886     2.55   0.018     .0103435     .100717
            2 1974  |   .0046181   .0165049     0.28   0.782    -.0296109    .0388472
            2 1975  |  -.0248477   .0088985    -2.79   0.011    -.0433021   -.0063933
            2 1976  |  -.0221818   .0055683    -3.98   0.001    -.0337298   -.0106337
            3 1971  |    .106266   .0496746     2.14   0.044     .0032471    .2092848
            3 1972  |  -.1799793   .0758462    -2.37   0.027    -.3372746    -.022684
            3 1973  |   .0119027   .0050676     2.35   0.028     .0013931    .0224123
            3 1974  |   .0437719   .0233409     1.88   0.074    -.0046341    .0921779
            3 1975  |  -.0177478   .0063491    -2.80   0.011     -.030915   -.0045806
            3 1976  |  -.0213043   .0059468    -3.58   0.002    -.0336372   -.0089713
            4 1971  |   .0829038   .0425354     1.95   0.064    -.0053093    .1711169
            4 1972  |  -.2840972   .1198196    -2.37   0.027    -.5325878   -.0356066
            4 1973  |  -.1267768    .054811    -2.31   0.030    -.2404479   -.0131058
            4 1974  |   .0376119   .0182319     2.06   0.051    -.0001988    .0754226
            4 1975  |  -.0231321    .011374    -2.03   0.054    -.0467202    .0004561
            4 1976  |  -.0421754   .0184033    -2.29   0.032    -.0803415   -.0040093
            5 1971  |   .0501532   .0285338     1.76   0.093    -.0090223    .1093288
            5 1972  |  -.3436796   .1452249    -2.37   0.027    -.6448577   -.0425015
            5 1973  |  -.3956715   .1718036    -2.30   0.031    -.7519704   -.0393727
            5 1974  |   .0018174   .0112418     0.16   0.873    -.0214967    .0251315
            5 1975  |  -.0185006   .0181921    -1.02   0.320    -.0562286    .0192274
            5 1976  |  -.0482073   .0163697    -2.94   0.007    -.0821561   -.0142586
            6 1971  |    .037418   .0211021     1.77   0.090    -.0063451    .0811811
            6 1972  |  -.3706683    .154535    -2.40   0.025    -.6911542   -.0501824
            6 1973  |  -.6984699    .303832    -2.30   0.031    -1.328579   -.0683609
            6 1974  |  -.0253013   .0141233    -1.79   0.087    -.0545912    .0039885
            6 1975  |  -.0396819    .019657    -2.02   0.056     -.080448    .0010842
            6 1976  |  -.0546422   .0216189    -2.53   0.019    -.0994771   -.0098074
            7 1971  |   .0777542   .0355689     2.19   0.040     .0039889    .1515196
            7 1972  |  -.4626707   .1930188    -2.40   0.025    -.8629672   -.0623742
            7 1973  |  -.8534283   .3718137    -2.30   0.032    -1.624523   -.0823338
            7 1974  |   .0026319   .0105257     0.25   0.805     -.019197    .0244608
            7 1975  |  -.0182232    .015706    -1.16   0.258    -.0507955     .014349
            7 1976  |  -.0341362   .0160932    -2.12   0.045    -.0675114    -.000761
            8 1971  |   .1041437   .0498311     2.09   0.048     .0008003    .2074871
            8 1972  |  -.8857504   .3703682    -2.39   0.026    -1.653847   -.1176538
            8 1973  |  -.6367963   .2845826    -2.24   0.036    -1.226984   -.0466081
            8 1974  |   .0071396   .0123598     0.58   0.569    -.0184931    .0327723
            8 1975  |  -.0100712    .012302    -0.82   0.422     -.035584    .0154416
            8 1976  |  -.0159744    .011542    -1.38   0.180    -.0399111    .0079622
            9 1971  |    .159728   .0740499     2.16   0.042      .006158     .313298
            9 1972  |  -1.269045   .5342411    -2.38   0.027    -2.376993   -.1610969
            9 1973  |  -.4061872   .1986475    -2.04   0.053     -.818157    .0057825
            9 1974  |   .0174593   .0229022     0.76   0.454    -.0300368    .0649555
            9 1975  |   .0247653   .0164128     1.51   0.146    -.0092728    .0588034
            9 1976  |   .0125092   .0123407     1.01   0.322    -.0130839    .0381024
           10 1971  |   .1392149   .0645813     2.16   0.042     .0052814    .2731484
           10 1972  |    -1.5139   .6488242    -2.33   0.029    -2.859479   -.1683213
           10 1973  |  -1.246881   .5526108    -2.26   0.034    -2.392926   -.1008366
           10 1974  |  -.1369267   .0549309    -2.49   0.021    -.2508464   -.0230071
           10 1975  |   .0173272   .0133548     1.30   0.208    -.0103691    .0450234
           10 1976  |   .0164422   .0156188     1.05   0.304    -.0159493    .0488337
           11 1971  |   .0898703   .0417881     2.15   0.043      .003207    .1765336
           11 1972  |   -1.58689   .6872721    -2.31   0.031    -3.012205   -.1615751
           11 1973  |   .0140288   .0106464     1.32   0.201    -.0080504    .0361081
           11 1974  |  -.1367393   .0544648    -2.51   0.020    -.2496924   -.0237862
           11 1975  |   .0098614   .0087461     1.13   0.272    -.0082768    .0279997
           11 1976  |   .0085808   .0098788     0.87   0.394    -.0119066    .0290681
           12 1971  |   .0112662   .0195462     0.58   0.570    -.0292701    .0518026
           12 1972  |   -1.73694   .7539066    -2.30   0.031    -3.300446   -.1734332
           12 1973  |          0  (omitted)
           12 1974  |  -.1301778   .0506738    -2.57   0.018    -.2352687   -.0250868
           12 1975  |          0  (omitted)
           12 1976  |          0  (omitted)
                    |
              _cons |  -.3939049   .2204362    -1.79   0.088    -.8510617    .0632519
--------------------+----------------------------------------------------------------
            sigma_u |   .0550921
            sigma_e |  .07400464
                rho |  .35657911   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------

. outreg2 using `table_results'/Table5.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark, Month FE, \checkmark, Year FE, \checkmark, Month $\times$ Year FE, \checkmark) keep(inf_a dint_1 d
> treated_1973_inf_a dint1_inf_a) ///
>                 ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table5.tex
dir : seeout

.                 
. xtabond cv inf_a dtreated_1973 dperiod_1973 dint_1 dtreated_1973_inf_a dperiod_1973_inf_a dint1_inf_a  if tin(1970m1, 1976m12)
note: dtreated_1973 dropped from div() because of collinearity

Arellano-Bond dynamic panel-data estimation     Number of obs     =      1,886
Group variable: code                            Number of groups  =         23
Time variable: date
                                                Obs per group:
                                                              min =         82
                                                              avg =         82
                                                              max =         82

Number of instruments =   1.6e+03               Wald chi2(7)      =   18945.82
                                                Prob > chi2       =     0.0000
One-step results
-------------------------------------------------------------------------------------
                 cv |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
                 cv |
                L1. |   .9105732   .0087044   104.61   0.000     .8935129    .9276334
                    |
              inf_a |   .0133827   .0025619     5.22   0.000     .0083615     .018404
      dtreated_1973 |          0  (omitted)
       dperiod_1973 |  -.0557513   .0082525    -6.76   0.000     -.071926   -.0395766
             dint_1 |   .0445019   .0106399     4.18   0.000     .0236481    .0653556
dtreated_1973_inf_a |  -.0085208   .0034022    -2.50   0.012     -.015189   -.0018527
 dperiod_1973_inf_a |   .0278366   .0055755     4.99   0.000     .0169088    .0387644
        dint1_inf_a |  -.0194601   .0070775    -2.75   0.006    -.0333318   -.0055884
              _cons |   .0059872   .0016344     3.66   0.000     .0027839    .0091906
-------------------------------------------------------------------------------------
Instruments for differenced equation
        GMM-type: L(2/.).cv
        Standard: D.inf_a D.dperiod_1973 D.dint_1 D.dtreated_1973_inf_a
                  D.dperiod_1973_inf_a D.dint1_inf_a
Instruments for level equation
        Standard: _cons

. outreg2 using `table_results'/Table5.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark) keep(inf_a dperiod_1973 dint_1 dtreated_1973_inf_a dperiod_1973_inf_a dint1_inf_a ) ///
>                 ctitle("AB Estimates") nocons nonotes nor2 noni nodepvar                
../Results/Tables/Table5.tex
dir : seeout

. 
. xtabond cv inf_a dtreated_1973 dperiod_1973 dint_1 dtreated_1973_inf_a dperiod_1973_inf_a dint1_inf_a m_* y_* ym_* if tin(1970m1, 1976m12)
note: inf_a dropped from div() because of collinearity
note: dtreated_1973 dropped from div() because of collinearity
note: dperiod_1973 dropped from div() because of collinearity
note: m_9 dropped from div() because of collinearity
note: y_1 dropped from div() because of collinearity
note: y_3 dropped from div() because of collinearity
note: y_8 dropped from div() because of collinearity
note: y_9 dropped from div() because of collinearity
note: y_10 dropped from div() because of collinearity
note: y_11 dropped from div() because of collinearity
note: y_12 dropped from div() because of collinearity
note: y_13 dropped from div() because of collinearity
note: ym_9 dropped from div() because of collinearity
note: ym_12 dropped from div() because of collinearity
note: ym_17 dropped from div() because of collinearity
note: ym_24 dropped from div() because of collinearity
note: ym_26 dropped from div() because of collinearity
note: ym_30 dropped from div() because of collinearity
note: ym_34 dropped from div() because of collinearity
note: ym_40 dropped from div() because of collinearity
note: ym_43 dropped from div() because of collinearity
note: ym_46 dropped from div() because of collinearity
note: ym_47 dropped from div() because of collinearity
note: ym_49 dropped from div() because of collinearity
note: ym_51 dropped from div() because of collinearity
note: ym_59 dropped from div() because of collinearity
note: ym_61 dropped from div() because of collinearity
note: ym_66 dropped from div() because of collinearity
note: ym_68 dropped from div() because of collinearity
note: ym_84 dropped from div() because of collinearity
note: ym_85 dropped from div() because of collinearity
note: ym_86 dropped from div() because of collinearity
note: ym_87 dropped from div() because of collinearity
note: ym_88 dropped from div() because of collinearity
note: ym_89 dropped from div() because of collinearity
note: ym_90 dropped from div() because of collinearity
note: ym_91 dropped from div() because of collinearity
note: ym_92 dropped from div() because of collinearity
note: ym_93 dropped from div() because of collinearity
note: ym_94 dropped from div() because of collinearity
note: ym_95 dropped from div() because of collinearity
note: ym_96 dropped from div() because of collinearity
note: ym_97 dropped from div() because of collinearity
note: ym_98 dropped from div() because of collinearity
note: ym_99 dropped from div() because of collinearity
note: ym_100 dropped from div() because of collinearity
note: ym_101 dropped from div() because of collinearity
note: ym_102 dropped from div() because of collinearity
note: ym_103 dropped from div() because of collinearity
note: ym_104 dropped from div() because of collinearity
note: ym_105 dropped from div() because of collinearity
note: ym_106 dropped from div() because of collinearity
note: ym_107 dropped from div() because of collinearity
note: ym_108 dropped from div() because of collinearity
note: ym_109 dropped from div() because of collinearity
note: ym_110 dropped from div() because of collinearity
note: ym_111 dropped from div() because of collinearity
note: ym_112 dropped from div() because of collinearity
note: ym_113 dropped from div() because of collinearity
note: ym_114 dropped from div() because of collinearity
note: ym_115 dropped from div() because of collinearity
note: ym_116 dropped from div() because of collinearity
note: ym_117 dropped from div() because of collinearity
note: ym_118 dropped from div() because of collinearity
note: ym_119 dropped from div() because of collinearity
note: ym_120 dropped from div() because of collinearity
note: ym_121 dropped from div() because of collinearity
note: ym_122 dropped from div() because of collinearity
note: ym_123 dropped from div() because of collinearity
note: ym_124 dropped from div() because of collinearity
note: ym_125 dropped from div() because of collinearity
note: ym_126 dropped from div() because of collinearity
note: ym_127 dropped from div() because of collinearity
note: ym_128 dropped from div() because of collinearity
note: ym_129 dropped from div() because of collinearity
note: ym_130 dropped from div() because of collinearity
note: ym_131 dropped from div() because of collinearity
note: ym_132 dropped from div() because of collinearity
note: ym_133 dropped from div() because of collinearity
note: ym_134 dropped from div() because of collinearity
note: ym_135 dropped from div() because of collinearity
note: ym_136 dropped from div() because of collinearity
note: ym_137 dropped from div() because of collinearity
note: ym_138 dropped from div() because of collinearity
note: ym_139 dropped from div() because of collinearity
note: ym_140 dropped from div() because of collinearity
note: ym_141 dropped from div() because of collinearity
note: ym_142 dropped from div() because of collinearity
note: ym_143 dropped from div() because of collinearity
note: ym_144 dropped from div() because of collinearity
note: ym_145 dropped from div() because of collinearity
note: ym_146 dropped from div() because of collinearity
note: ym_147 dropped from div() because of collinearity
note: ym_148 dropped from div() because of collinearity
note: ym_149 dropped from div() because of collinearity
note: dperiod_1973 dropped because of collinearity
note: m_10 dropped because of collinearity
note: y_5 dropped because of collinearity
note: y_8 dropped because of collinearity
note: y_9 dropped because of collinearity
note: y_10 dropped because of collinearity
note: y_11 dropped because of collinearity
note: y_12 dropped because of collinearity
note: y_13 dropped because of collinearity
note: ym_1 dropped because of collinearity
note: ym_6 dropped because of collinearity
note: ym_8 dropped because of collinearity
note: ym_19 dropped because of collinearity
note: ym_20 dropped because of collinearity
note: ym_25 dropped because of collinearity
note: ym_26 dropped because of collinearity
note: ym_30 dropped because of collinearity
note: ym_35 dropped because of collinearity
note: ym_39 dropped because of collinearity
note: ym_46 dropped because of collinearity
note: ym_48 dropped because of collinearity
note: ym_50 dropped because of collinearity
note: ym_52 dropped because of collinearity
note: ym_58 dropped because of collinearity
note: ym_60 dropped because of collinearity
note: ym_64 dropped because of collinearity
note: ym_65 dropped because of collinearity
note: ym_69 dropped because of collinearity
note: ym_75 dropped because of collinearity
note: ym_83 dropped because of collinearity
note: ym_85 dropped because of collinearity
note: ym_86 dropped because of collinearity
note: ym_87 dropped because of collinearity
note: ym_88 dropped because of collinearity
note: ym_89 dropped because of collinearity
note: ym_90 dropped because of collinearity
note: ym_91 dropped because of collinearity
note: ym_92 dropped because of collinearity
note: ym_93 dropped because of collinearity
note: ym_94 dropped because of collinearity
note: ym_95 dropped because of collinearity
note: ym_96 dropped because of collinearity
note: ym_97 dropped because of collinearity
note: ym_98 dropped because of collinearity
note: ym_99 dropped because of collinearity
note: ym_100 dropped because of collinearity
note: ym_101 dropped because of collinearity
note: ym_102 dropped because of collinearity
note: ym_103 dropped because of collinearity
note: ym_104 dropped because of collinearity
note: ym_105 dropped because of collinearity
note: ym_106 dropped because of collinearity
note: ym_107 dropped because of collinearity
note: ym_108 dropped because of collinearity
note: ym_109 dropped because of collinearity
note: ym_110 dropped because of collinearity
note: ym_111 dropped because of collinearity
note: ym_112 dropped because of collinearity
note: ym_113 dropped because of collinearity
note: ym_114 dropped because of collinearity
note: ym_115 dropped because of collinearity
note: ym_116 dropped because of collinearity
note: ym_117 dropped because of collinearity
note: ym_118 dropped because of collinearity
note: ym_119 dropped because of collinearity
note: ym_120 dropped because of collinearity
note: ym_121 dropped because of collinearity
note: ym_122 dropped because of collinearity
note: ym_123 dropped because of collinearity
note: ym_124 dropped because of collinearity
note: ym_125 dropped because of collinearity
note: ym_126 dropped because of collinearity
note: ym_127 dropped because of collinearity
note: ym_128 dropped because of collinearity
note: ym_129 dropped because of collinearity
note: ym_130 dropped because of collinearity
note: ym_131 dropped because of collinearity
note: ym_132 dropped because of collinearity
note: ym_133 dropped because of collinearity
note: ym_134 dropped because of collinearity
note: ym_135 dropped because of collinearity
note: ym_136 dropped because of collinearity
note: ym_137 dropped because of collinearity
note: ym_138 dropped because of collinearity
note: ym_139 dropped because of collinearity
note: ym_140 dropped because of collinearity
note: ym_141 dropped because of collinearity
note: ym_142 dropped because of collinearity
note: ym_143 dropped because of collinearity
note: ym_144 dropped because of collinearity
note: ym_145 dropped because of collinearity
note: ym_146 dropped because of collinearity
note: ym_147 dropped because of collinearity
note: ym_148 dropped because of collinearity
note: ym_149 dropped because of collinearity

Arellano-Bond dynamic panel-data estimation     Number of obs     =      1,886
Group variable: code                            Number of groups  =         23
Time variable: date
                                                Obs per group:
                                                              min =         82
                                                              avg =         82
                                                              max =         82

Number of instruments =   1.7e+03               Wald chi2(86)     =   29353.84
                                                Prob > chi2       =     0.0000
One-step results
-------------------------------------------------------------------------------------
                 cv |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
                 cv |
                L1. |   .9487059   .0079201   119.78   0.000     .9331827     .964229
                    |
              inf_a |   .0550729   .0065959     8.35   0.000     .0421451    .0680006
      dtreated_1973 |          0  (omitted)
             dint_1 |   .0311764   .0090706     3.44   0.001     .0133983    .0489546
dtreated_1973_inf_a |  -.0082974   .0028549    -2.91   0.004     -.013893   -.0027019
 dperiod_1973_inf_a |  -.0395242   .0052694    -7.50   0.000    -.0498521   -.0291963
        dint1_inf_a |  -.0109139   .0060278    -1.81   0.070    -.0227283    .0009004
                m_1 |   .0747843   .0093552     7.99   0.000     .0564486    .0931201
                m_2 |   .0713597   .0069341    10.29   0.000     .0577691    .0849503
                m_3 |   .0354005   .0061072     5.80   0.000     .0234306    .0473704
                m_4 |   .0967486   .0079052    12.24   0.000     .0812547    .1122424
                m_5 |   .1128861   .0107546    10.50   0.000     .0918076    .1339647
                m_6 |   .0589526   .0089885     6.56   0.000     .0413354    .0765698
                m_7 |   .0707946    .013442     5.27   0.000     .0444488    .0971404
                m_8 |   .0632567   .0114297     5.53   0.000      .040855    .0856584
                m_9 |   .1064099   .0105832    10.05   0.000     .0856672    .1271526
               m_11 |   .0457014   .0071985     6.35   0.000     .0315926    .0598102
               m_12 |   .0863561   .0072014    11.99   0.000     .0722416    .1004705
                y_1 |   .0294893   .0122033     2.42   0.016     .0055712    .0534074
                y_2 |   .0222368   .0143059     1.55   0.120    -.0058022    .0502758
                y_3 |   .0131383   .0094324     1.39   0.164    -.0053489    .0316256
                y_4 |   .0018685   .0066141     0.28   0.778    -.0110949     .014832
                y_6 |  -.0282935   .0077827    -3.64   0.000    -.0435473   -.0130397
                y_7 |   .0399924   .0073827     5.42   0.000     .0255227    .0544622
               ym_2 |  -.0081848   .0099464    -0.82   0.411    -.0276795    .0113099
               ym_3 |   .0248959   .0111623     2.23   0.026     .0030181    .0467736
               ym_4 |  -.0382183   .0121441    -3.15   0.002    -.0620204   -.0144163
               ym_5 |  -.0500824   .0141621    -3.54   0.000    -.0778396   -.0223252
               ym_7 |  -.0100796   .0100331    -1.00   0.315    -.0297441    .0095849
               ym_9 |  -.0459391   .0140091    -3.28   0.001    -.0733964   -.0184818
              ym_10 |   .0589353   .0113988     5.17   0.000     .0365941    .0812766
              ym_11 |   .0105074   .0103331     1.02   0.309    -.0097452    .0307599
              ym_12 |  -.0278507   .0113964    -2.44   0.015    -.0501873   -.0055142
              ym_13 |  -.0339601   .0124092    -2.74   0.006    -.0582818   -.0096384
              ym_14 |  -.0061401   .0122082    -0.50   0.615    -.0300677    .0177875
              ym_15 |   .0323923   .0132236     2.45   0.014     .0064745    .0583102
              ym_16 |  -.0313469    .014049    -2.23   0.026    -.0588824   -.0038113
              ym_17 |  -.0428188   .0158083    -2.71   0.007    -.0738024   -.0118351
              ym_18 |   .0128118   .0100359     1.28   0.202    -.0068582    .0324818
              ym_21 |  -.0398037   .0157307    -2.53   0.011    -.0706353   -.0089721
              ym_22 |   .0685547   .0134486     5.10   0.000     .0421959    .0949135
              ym_23 |    .026421   .0125243     2.11   0.035     .0018737    .0509682
              ym_24 |  -.0225191   .0134416    -1.68   0.094    -.0488641    .0038259
              ym_27 |   .0377788   .0087312     4.33   0.000      .020666    .0548915
              ym_28 |   -.030775   .0099246    -3.10   0.002     -.050227   -.0113231
              ym_29 |  -.0465634   .0122739    -3.79   0.000    -.0706197    -.022507
              ym_31 |  -.0088518   .0122885    -0.72   0.471    -.0329368    .0152332
              ym_32 |  -.0141048   .0101875    -1.38   0.166    -.0340718    .0058623
              ym_33 |   -.063403   .0119735    -5.30   0.000    -.0868706   -.0399354
              ym_34 |   .0569535   .0089549     6.36   0.000     .0394023    .0745047
              ym_36 |   -.061327   .0105589    -5.81   0.000    -.0820221    -.040632
              ym_37 |  -.0363548   .0102678    -3.54   0.000    -.0564793   -.0162303
              ym_38 |  -.0272378   .0090793    -3.00   0.003     -.045033   -.0094427
              ym_40 |   -.069388   .0104305    -6.65   0.000    -.0898315   -.0489446
              ym_41 |   -.079983   .0126558    -6.32   0.000     -.104788    -.055178
              ym_42 |  -.0364802   .0104519    -3.49   0.000    -.0569656   -.0159947
              ym_43 |  -.0506949    .014559    -3.48   0.000      -.07923   -.0221599
              ym_44 |  -.0393405   .0125997    -3.12   0.002    -.0640354   -.0146455
              ym_45 |   -.057827   .0124203    -4.66   0.000    -.0821703   -.0334837
              ym_47 |   .1442585    .011432    12.62   0.000     .1218522    .1666649
              ym_49 |  -.0101559   .0098749    -1.03   0.304    -.0295103    .0091985
              ym_51 |   .0688771   .0092202     7.47   0.000     .0508059    .0869483
              ym_53 |  -.0341335   .0100834    -3.39   0.001    -.0538966   -.0143704
              ym_54 |   .0023474   .0097012     0.24   0.809    -.0166666    .0213615
              ym_55 |   .0357326   .0138829     2.57   0.010     .0085226    .0629426
              ym_56 |   .0179215   .0119042     1.51   0.132    -.0054102    .0412533
              ym_57 |  -.0429145   .0101002    -4.25   0.000    -.0627105   -.0231185
              ym_59 |   .0313571   .0089048     3.52   0.000     .0139041    .0488101
              ym_61 |   .0252836   .0123017     2.06   0.040     .0011726    .0493946
              ym_62 |   .0313846    .009936     3.16   0.002     .0119104    .0508589
              ym_63 |   .0687138   .0113447     6.06   0.000     .0464786     .090949
              ym_66 |   .0391589   .0121976     3.21   0.001     .0152521    .0630658
              ym_67 |    .047026   .0157521     2.99   0.003     .0161525    .0778995
              ym_68 |   .0417444   .0140481     2.97   0.003     .0142107    .0692782
              ym_70 |   .1067904   .0104301    10.24   0.000     .0863478     .127233
              ym_71 |   .0558221   .0113994     4.90   0.000     .0334798    .0781645
              ym_72 |   .0211831   .0100548     2.11   0.035      .001476    .0408903
              ym_73 |   -.047845   .0102057    -4.69   0.000    -.0678477   -.0278422
              ym_74 |  -.0380338   .0087639    -4.34   0.000    -.0552108   -.0208568
              ym_76 |  -.0527143   .0103725    -5.08   0.000    -.0730441   -.0323845
              ym_77 |  -.0538886   .0127748    -4.22   0.000    -.0789268   -.0288505
              ym_78 |  -.0094762   .0096961    -0.98   0.328    -.0284802    .0095278
              ym_79 |  -.0290071   .0139231    -2.08   0.037    -.0562959   -.0017183
              ym_80 |  -.0110605   .0119966    -0.92   0.357    -.0345733    .0124523
              ym_81 |  -.0693521   .0127817    -5.43   0.000    -.0944037   -.0443005
              ym_82 |   .0376425   .0084922     4.43   0.000     .0209981     .054287
              ym_84 |  -.0482821   .0099905    -4.83   0.000    -.0678632    -.028701
              _cons |  -.0969745   .0103652    -9.36   0.000      -.11729    -.076659
-------------------------------------------------------------------------------------
Instruments for differenced equation
        GMM-type: L(2/.).cv
        Standard: D.dint_1 D.dtreated_1973_inf_a D.dperiod_1973_inf_a D.dint1_inf_a
                  D.m_1 D.m_2 D.m_3 D.m_4 D.m_5 D.m_6 D.m_7 D.m_8 D.m_10 D.m_11
                  D.m_12 D.y_2 D.y_4 D.y_5 D.y_6 D.y_7 D.ym_1 D.ym_2 D.ym_3 D.ym_4
                  D.ym_5 D.ym_6 D.ym_7 D.ym_8 D.ym_10 D.ym_11 D.ym_13 D.ym_14
                  D.ym_15 D.ym_16 D.ym_18 D.ym_19 D.ym_20 D.ym_21 D.ym_22 D.ym_23
                  D.ym_25 D.ym_27 D.ym_28 D.ym_29 D.ym_31 D.ym_32 D.ym_33 D.ym_35
                  D.ym_36 D.ym_37 D.ym_38 D.ym_39 D.ym_41 D.ym_42 D.ym_44 D.ym_45
                  D.ym_48 D.ym_50 D.ym_52 D.ym_53 D.ym_54 D.ym_55 D.ym_56 D.ym_57
                  D.ym_58 D.ym_60 D.ym_62 D.ym_63 D.ym_64 D.ym_65 D.ym_67 D.ym_69
                  D.ym_70 D.ym_71 D.ym_72 D.ym_73 D.ym_74 D.ym_75 D.ym_76 D.ym_77
                  D.ym_78 D.ym_79 D.ym_80 D.ym_81 D.ym_82 D.ym_83
Instruments for level equation
        Standard: _cons

. outreg2 using `table_results'/Table5.tex, append bdec(3) sdec(2) tex(fragment) label ///
> addtext(Product FE, \checkmark, Month FE, \checkmark, Year FE, \checkmark, Month $\times$ Year FE, \checkmark) keep(inf_a dperiod_1973 dint_1 dtre
> ated_1973_inf_a dint1_inf_a) ///
> ctitle("AB Estimates") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table5.tex
dir : seeout

. 
. ******************* TABLE 6. RESULTS USING WITHIN RPV (1973 - 1982)
. 
. xtreg cv inf_a if tin(1973m11, 1982m5), fe vce(r)

Fixed-effects (within) regression               Number of obs     =      2,369
Group variable: code                            Number of groups  =         23

R-sq:                                           Obs per group:
     within  = 0.3652                                         min =        103
     between =      .                                         avg =      103.0
     overall = 0.3010                                         max =        103

                                                F(1,22)           =      97.46
corr(u_i, Xb)  = -0.0000                        Prob > F          =     0.0000

                                  (Std. Err. adjusted for 23 clusters in code)
------------------------------------------------------------------------------
             |               Robust
          cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       inf_a |   .0917693   .0092957     9.87   0.000     .0724913    .1110473
       _cons |   .0499528   .0076885     6.50   0.000     .0340078    .0658978
-------------+----------------------------------------------------------------
     sigma_u |  .04663178
     sigma_e |  .07911185
         rho |  .25785239   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using `table_results'/Table6.tex, replace bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark) keep(inf_a) ///
> ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table6.tex
dir : seeout

.         
. xtreg cv inf_a dtreated_1977 dperiod_1977 dint_2 dtreated_1977_inf_a dperiod_1977_inf_a dint2_inf_a  if tin(1973m11, 1982m5), fe vce(r)
note: dtreated_1977 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      2,369
Group variable: code                            Number of groups  =         23

R-sq:                                           Obs per group:
     within  = 0.4511                                         min =        103
     between = 0.5418                                         avg =      103.0
     overall = 0.0057                                         max =        103

                                                F(6,22)           =      26.67
corr(u_i, Xb)  = -0.9267                        Prob > F          =     0.0000

                                         (Std. Err. adjusted for 23 clusters in code)
-------------------------------------------------------------------------------------
                    |               Robust
                 cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              inf_a |   .0617091   .0612433     1.01   0.325    -.0653017    .1887199
      dtreated_1977 |          0  (omitted)
       dperiod_1977 |  -.0233943    .118053    -0.20   0.845    -.2682212    .2214325
             dint_2 |   .3516753   .1390115     2.53   0.019     .0633831    .6399675
dtreated_1977_inf_a |     .23739   .0811883     2.92   0.008     .0690157    .4057643
 dperiod_1977_inf_a |   .0284697    .109603     0.26   0.797    -.1988331    .2557724
        dint2_inf_a |  -.2560509   .1238658    -2.07   0.051    -.5129329    .0008311
              _cons |  -.0726942   .0657018    -1.11   0.280    -.2089514     .063563
--------------------+----------------------------------------------------------------
            sigma_u |  .21795426
            sigma_e |  .07364359
                rho |  .89753182   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------

. outreg2 using `table_results'/Table6.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark) keep(inf_a dperiod_1977 dint_2 dtreated_1977_inf_a dperiod_1977_inf_a dint2_inf_a ) ///
> ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table6.tex
dir : seeout

. 
. xtreg cv inf_a dtreated_1977 dperiod_1977 dint_2 dtreated_1977_inf_a dperiod_1977_inf_a dint2_inf_a i.month i.year i.month#i.year if tin(1973m11, 
> 1982m5), fe vce(r)
note: dtreated_1977 omitted because of collinearity
note: 1982.year omitted because of collinearity
note: 1b.month#1973b.year identifies no observations in the sample
note: 2.month#1973b.year identifies no observations in the sample
note: 2.month#1982.year omitted because of collinearity
note: 3.month#1973b.year identifies no observations in the sample
note: 3.month#1982.year omitted because of collinearity
note: 4.month#1973b.year identifies no observations in the sample
note: 4.month#1982.year omitted because of collinearity
note: 5.month#1973b.year identifies no observations in the sample
note: 5.month#1982.year omitted because of collinearity
note: 6.month#1973b.year identifies no observations in the sample
note: 6.month#1981.year omitted because of collinearity
note: 6.month#1982.year identifies no observations in the sample
note: 7.month#1973b.year identifies no observations in the sample
note: 7.month#1981.year omitted because of collinearity
note: 7.month#1982.year identifies no observations in the sample
note: 8.month#1973b.year identifies no observations in the sample
note: 8.month#1981.year omitted because of collinearity
note: 8.month#1982.year identifies no observations in the sample
note: 9.month#1973b.year identifies no observations in the sample
note: 9.month#1981.year omitted because of collinearity
note: 9.month#1982.year identifies no observations in the sample
note: 10.month#1973b.year identifies no observations in the sample
note: 10.month#1981.year omitted because of collinearity
note: 10.month#1982.year identifies no observations in the sample
note: 11.month#1982.year identifies no observations in the sample
note: 12.month#1976.year omitted because of collinearity
note: 12.month#1980.year omitted because of collinearity
note: 12.month#1981.year omitted because of collinearity
note: 12.month#1982.year identifies no observations in the sample

Fixed-effects (within) regression               Number of obs     =      2,369
Group variable: code                            Number of groups  =         23

R-sq:                                           Obs per group:
     within  = 0.4977                                         min =        103
     between = 0.5418                                         avg =      103.0
     overall = 0.0028                                         max =        103

                                                F(23,22)          =          .
corr(u_i, Xb)  = -0.9209                        Prob > F          =          .

                                         (Std. Err. adjusted for 23 clusters in code)
-------------------------------------------------------------------------------------
                    |               Robust
                 cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              inf_a |  -.1113909   .1293368    -0.86   0.398     -.379619    .1568372
      dtreated_1977 |          0  (omitted)
       dperiod_1977 |  -.3854099   .2634912    -1.46   0.158    -.9318572    .1610374
             dint_2 |   .3516753   .1420196     2.48   0.021     .0571446     .646206
dtreated_1977_inf_a |     .23739   .0829452     2.86   0.009     .0653721    .4094078
 dperiod_1977_inf_a |    .263799   .1429677     1.85   0.079    -.0326979    .5602959
        dint2_inf_a |  -.2560509   .1265462    -2.02   0.055    -.5184917    .0063899
                    |
              month |
                 2  |   .0041189   .0034237     1.20   0.242    -.0029814    .0112191
                 3  |   .0020337   .0052625     0.39   0.703    -.0088801    .0129475
                 4  |   .0033104   .0062069     0.53   0.599    -.0095619    .0161828
                 5  |   .0060744   .0071695     0.85   0.406    -.0087943    .0209431
                 6  |   .0139161   .0068862     2.02   0.056     -.000365    .0281972
                 7  |   .0163495   .0080874     2.02   0.056    -.0004228    .0331217
                 8  |   .0170524    .008597     1.98   0.060    -.0007767    .0348814
                 9  |    .018541   .0096734     1.92   0.068    -.0015205    .0386024
                10  |   .0210434    .011359     1.85   0.077    -.0025138    .0446007
                11  |   .0178787   .0098225     1.82   0.082    -.0024918    .0382493
                12  |   .0200974   .0118844     1.69   0.105    -.0045493    .0447441
                    |
               year |
              1974  |  -.0005115   .0113278    -0.05   0.964    -.0240038    .0229808
              1975  |  -.1105526   .0627925    -1.76   0.092    -.2407763    .0196711
              1976  |  -.1544772   .0656578    -2.35   0.028     -.290643   -.0183113
              1977  |   -.064772   .0954554    -0.68   0.504    -.2627344    .1331905
              1978  |  -.0439524   .0465336    -0.94   0.355    -.1404573    .0525524
              1979  |  -.0285409   .0224422    -1.27   0.217    -.0750832    .0180014
              1980  |  -.0419324   .0253882    -1.65   0.113    -.0945842    .0107194
              1981  |  -.0223428   .0126772    -1.76   0.092    -.0486337     .003948
              1982  |          0  (omitted)
                    |
         month#year |
            1 1973  |          0  (empty)
            2 1973  |          0  (empty)
            2 1974  |  -.0151439   .0178123    -0.85   0.404    -.0520844    .0217965
            2 1975  |  -.0113304   .0069203    -1.64   0.116    -.0256822    .0030215
            2 1976  |  -.0104386   .0056778    -1.84   0.080    -.0222137    .0013365
            2 1977  |   .0046084   .0048569     0.95   0.353    -.0054642    .0146811
            2 1978  |  -.0014527   .0031212    -0.47   0.646    -.0079257    .0050203
            2 1979  |  -.0021799   .0029063    -0.75   0.461    -.0082072    .0038474
            2 1980  |  -.0046565   .0038279    -1.22   0.237    -.0125951    .0032822
            2 1981  |  -.0010144   .0043543    -0.23   0.818    -.0100447    .0080158
            2 1982  |          0  (omitted)
            3 1973  |          0  (empty)
            3 1974  |   .0089914   .0223328     0.40   0.691    -.0373239    .0553067
            3 1975  |  -.0139351   .0077315    -1.80   0.085    -.0299692     .002099
            3 1976  |  -.0121528   .0083693    -1.45   0.161    -.0295096     .005204
            3 1977  |   .0112886   .0104666     1.08   0.292    -.0104179     .032995
            3 1978  |   .0040546   .0087637     0.46   0.648    -.0141203    .0222295
            3 1979  |  -.0021043     .00428    -0.49   0.628    -.0109805    .0067719
            3 1980  |  -.0028455   .0060438    -0.47   0.642    -.0153795    .0096885
            3 1981  |   .0073385   .0076032     0.97   0.345    -.0084295    .0231066
            3 1982  |          0  (omitted)
            4 1973  |          0  (empty)
            4 1974  |   .0199909   .0179771     1.11   0.278    -.0172913    .0572731
            4 1975  |  -.0259622   .0124732    -2.08   0.049      -.05183   -.0000944
            4 1976  |  -.0094287   .0168157    -0.56   0.581    -.0443024     .025445
            4 1977  |   .0204585   .0146057     1.40   0.175    -.0098318    .0507488
            4 1978  |  -.0004467   .0128986    -0.03   0.973    -.0271968    .0263033
            4 1979  |  -.0035059   .0049249    -0.71   0.484    -.0137194    .0067077
            4 1980  |  -.0012149   .0068615    -0.18   0.861    -.0154448     .013015
            4 1981  |    .005614   .0088065     0.64   0.530    -.0126496    .0238776
            4 1982  |          0  (omitted)
            5 1973  |          0  (empty)
            5 1974  |   .0099173    .011792     0.84   0.409    -.0145378    .0343724
            5 1975  |  -.0227188   .0192603    -1.18   0.251    -.0626622    .0172247
            5 1976  |    .006243   .0137318     0.45   0.654     -.022235    .0347209
            5 1977  |   .0172605   .0203049     0.85   0.404    -.0248493    .0593703
            5 1978  |   .0032724   .0139363     0.23   0.817    -.0256296    .0321745
            5 1979  |   -.009424   .0057271    -1.65   0.114    -.0213013    .0024533
            5 1980  |  -.0032667    .007549    -0.43   0.669    -.0189223    .0123889
            5 1981  |   .0045848   .0091929     0.50   0.623    -.0144802    .0236498
            5 1982  |          0  (omitted)
            6 1973  |          0  (empty)
            6 1974  |  -.0213982   .0141042    -1.52   0.143    -.0506486    .0078522
            6 1975  |  -.0406421   .0194081    -2.09   0.048     -.080892   -.0003922
            6 1976  |   .0062315   .0099851     0.62   0.539    -.0144764    .0269394
            6 1977  |  -.0073871   .0413216    -0.18   0.860    -.0930829    .0783087
            6 1978  |  -.0023819   .0140524    -0.17   0.867    -.0315248    .0267609
            6 1979  |  -.0205324   .0070141    -2.93   0.008    -.0350786   -.0059861
            6 1980  |  -.0082592   .0069602    -1.19   0.248    -.0226938    .0061754
            6 1981  |          0  (omitted)
            6 1982  |          0  (empty)
            7 1973  |          0  (empty)
            7 1974  |  -.0015537   .0115988    -0.13   0.895    -.0256082    .0225008
            7 1975  |  -.0328018   .0189355    -1.73   0.097    -.0720716    .0064681
            7 1976  |    .004515    .010674     0.42   0.676    -.0176215    .0266514
            7 1977  |  -.0077931   .0442743    -0.18   0.862    -.0996125    .0840263
            7 1978  |  -.0049679    .014389    -0.35   0.733    -.0348088    .0248729
            7 1979  |  -.0244988   .0074571    -3.29   0.003    -.0399638   -.0090337
            7 1980  |  -.0076539   .0074187    -1.03   0.313    -.0230394    .0077317
            7 1981  |          0  (omitted)
            7 1982  |          0  (empty)
            8 1973  |          0  (empty)
            8 1974  |  -.0065612   .0117467    -0.56   0.582    -.0309223    .0177999
            8 1975  |  -.0367302   .0169259    -2.17   0.041    -.0718325    -.001628
            8 1976  |   .0140509   .0107343     1.31   0.204    -.0082107    .0363125
            8 1977  |   -.000022   .0448451    -0.00   1.000    -.0930251    .0929812
            8 1978  |  -.0098931   .0161819    -0.61   0.547    -.0434523    .0236662
            8 1979  |   -.029403   .0091335    -3.22   0.004    -.0483447   -.0104613
            8 1980  |   -.004706   .0069813    -0.67   0.507    -.0191842    .0097722
            8 1981  |          0  (omitted)
            8 1982  |          0  (empty)
            9 1973  |          0  (empty)
            9 1974  |   -.030063   .0149131    -2.02   0.056    -.0609908    .0008649
            9 1975  |  -.0399036   .0163619    -2.44   0.023    -.0738361   -.0059712
            9 1976  |    .007067   .0077627     0.91   0.372    -.0090319    .0231659
            9 1977  |  -.0020982   .0457697    -0.05   0.964    -.0970189    .0928224
            9 1978  |  -.0105951   .0150094    -0.71   0.488    -.0417226    .0205324
            9 1979  |  -.0330521   .0112037    -2.95   0.007    -.0562872   -.0098169
            9 1980  |  -.0024802   .0068346    -0.36   0.720    -.0166543     .011694
            9 1981  |          0  (omitted)
            9 1982  |          0  (empty)
           10 1973  |          0  (empty)
           10 1974  |  -.1225397   .0550874    -2.22   0.037    -.2367839   -.0082955
           10 1975  |   -.044646   .0119426    -3.74   0.001    -.0694135   -.0198785
           10 1976  |   .0001317    .009994     0.01   0.990    -.0205947    .0208581
           10 1977  |  -.0073324   .0459757    -0.16   0.875    -.1026801    .0880152
           10 1978  |   -.008124   .0156313    -0.52   0.608    -.0405413    .0242933
           10 1979  |   -.030932    .014091    -2.20   0.039     -.060155   -.0017091
           10 1980  |  -.0045742   .0065716    -0.70   0.494    -.0182029    .0090545
           10 1981  |          0  (omitted)
           10 1982  |          0  (empty)
           11 1974  |  -.1236704   .0603082    -2.05   0.052     -.248742    .0014012
           11 1975  |   -.048172   .0147383    -3.27   0.004    -.0787373   -.0176067
           11 1976  |   .0063716    .009152     0.70   0.494    -.0126085    .0253516
           11 1977  |  -.0066412    .051565    -0.13   0.899    -.1135805    .1002981
           11 1978  |  -.0005726   .0193324    -0.03   0.977    -.0406654    .0395203
           11 1979  |  -.0291285   .0129922    -2.24   0.035    -.0560727   -.0021844
           11 1980  |  -.0017341   .0072332    -0.24   0.813    -.0167348    .0132666
           11 1981  |   .0053083   .0086712     0.61   0.547    -.0126746    .0232912
           11 1982  |          0  (empty)
           12 1974  |  -.1204145   .0513125    -2.35   0.028      -.22683    -.013999
           12 1975  |  -.0510451   .0162042    -3.15   0.005    -.0846506   -.0174397
           12 1976  |          0  (omitted)
           12 1977  |  -.0093168   .0461381    -0.20   0.842    -.1050015    .0863679
           12 1978  |  -.0102591   .0172402    -0.60   0.558    -.0460132    .0254949
           12 1979  |  -.0272268   .0149675    -1.82   0.083    -.0582674    .0038139
           12 1980  |          0  (omitted)
           12 1981  |          0  (omitted)
           12 1982  |          0  (empty)
                    |
              _cons |   .2961763    .211485     1.40   0.175    -.1424167    .7347693
--------------------+----------------------------------------------------------------
            sigma_u |  .21795426
            sigma_e |  .07198962
                rho |  .90163516   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------

. outreg2 using `table_results'/Table6.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark, Month FE, \checkmark, Year FE, \checkmark, Month $\times$ Year FE, \checkmark) keep(inf_a dint_2 d
> treated_1977_inf_a dint2_inf_a ) ///
> ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table6.tex
dir : seeout

. 
. xtabond cv inf_a dtreated_1977 dperiod_1977 dint_2 dtreated_1977_inf_a dperiod_1977_inf_a dint2_inf_a  if tin(1973m11, 1982m5)
note: dtreated_1977 dropped from div() because of collinearity

Arellano-Bond dynamic panel-data estimation     Number of obs     =      2,369
Group variable: code                            Number of groups  =         23
Time variable: date
                                                Obs per group:
                                                              min =        103
                                                              avg =        103
                                                              max =        103

Number of instruments =   2.4e+03               Wald chi2(7)      =   33972.56
                                                Prob > chi2       =     0.0000
One-step results
-------------------------------------------------------------------------------------
                 cv |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
                 cv |
                L1. |   .9046914   .0068642   131.80   0.000     .8912378    .9181449
                    |
              inf_a |    .010575   .0034178     3.09   0.002     .0038762    .0172738
      dtreated_1977 |          0  (omitted)
       dperiod_1977 |   .0067846   .0058394     1.16   0.245    -.0046603    .0182296
             dint_2 |   .0510803   .0091281     5.60   0.000     .0331896    .0689711
dtreated_1977_inf_a |    .033077   .0053829     6.14   0.000     .0225267    .0436273
 dperiod_1977_inf_a |  -.0106023   .0050411    -2.10   0.035    -.0204826    -.000722
        dint2_inf_a |  -.0264517   .0078196    -3.38   0.001    -.0417778   -.0111256
              _cons |  -.0226854   .0042089    -5.39   0.000    -.0309348    -.014436
-------------------------------------------------------------------------------------
Instruments for differenced equation
        GMM-type: L(2/.).cv
        Standard: D.inf_a D.dperiod_1977 D.dint_2 D.dtreated_1977_inf_a
                  D.dperiod_1977_inf_a D.dint2_inf_a
Instruments for level equation
        Standard: _cons

. outreg2 using `table_results'/Table6.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark) keep(  inf_a dperiod_1977 dint_2 dtreated_1977_inf_a dperiod_1977_inf_a dint2_inf_a ) ///
> ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table6.tex
dir : seeout

. 
. xtabond cv inf_a dtreated_1977 dperiod_1977 dint_2 dtreated_1977_inf_a dperiod_1977_inf_a dint2_inf_a m_* y_* ym_* if tin(1973m11, 1982m5)
note: dtreated_1977 dropped from div() because of collinearity
note: dperiod_1977 dropped from div() because of collinearity
note: m_8 dropped from div() because of collinearity
note: y_1 dropped from div() because of collinearity
note: y_2 dropped from div() because of collinearity
note: y_3 dropped from div() because of collinearity
note: y_4 dropped from div() because of collinearity
note: y_8 dropped from div() because of collinearity
note: y_13 dropped from div() because of collinearity
note: ym_1 dropped from div() because of collinearity
note: ym_2 dropped from div() because of collinearity
note: ym_3 dropped from div() because of collinearity
note: ym_4 dropped from div() because of collinearity
note: ym_5 dropped from div() because of collinearity
note: ym_6 dropped from div() because of collinearity
note: ym_7 dropped from div() because of collinearity
note: ym_8 dropped from div() because of collinearity
note: ym_9 dropped from div() because of collinearity
note: ym_10 dropped from div() because of collinearity
note: ym_11 dropped from div() because of collinearity
note: ym_12 dropped from div() because of collinearity
note: ym_13 dropped from div() because of collinearity
note: ym_14 dropped from div() because of collinearity
note: ym_15 dropped from div() because of collinearity
note: ym_16 dropped from div() because of collinearity
note: ym_17 dropped from div() because of collinearity
note: ym_18 dropped from div() because of collinearity
note: ym_19 dropped from div() because of collinearity
note: ym_20 dropped from div() because of collinearity
note: ym_21 dropped from div() because of collinearity
note: ym_22 dropped from div() because of collinearity
note: ym_23 dropped from div() because of collinearity
note: ym_24 dropped from div() because of collinearity
note: ym_25 dropped from div() because of collinearity
note: ym_26 dropped from div() because of collinearity
note: ym_27 dropped from div() because of collinearity
note: ym_28 dropped from div() because of collinearity
note: ym_29 dropped from div() because of collinearity
note: ym_30 dropped from div() because of collinearity
note: ym_31 dropped from div() because of collinearity
note: ym_32 dropped from div() because of collinearity
note: ym_33 dropped from div() because of collinearity
note: ym_34 dropped from div() because of collinearity
note: ym_35 dropped from div() because of collinearity
note: ym_36 dropped from div() because of collinearity
note: ym_37 dropped from div() because of collinearity
note: ym_38 dropped from div() because of collinearity
note: ym_39 dropped from div() because of collinearity
note: ym_40 dropped from div() because of collinearity
note: ym_41 dropped from div() because of collinearity
note: ym_42 dropped from div() because of collinearity
note: ym_43 dropped from div() because of collinearity
note: ym_44 dropped from div() because of collinearity
note: ym_45 dropped from div() because of collinearity
note: ym_46 dropped from div() because of collinearity
note: ym_54 dropped from div() because of collinearity
note: ym_59 dropped from div() because of collinearity
note: ym_62 dropped from div() because of collinearity
note: ym_66 dropped from div() because of collinearity
note: ym_77 dropped from div() because of collinearity
note: ym_84 dropped from div() because of collinearity
note: ym_86 dropped from div() because of collinearity
note: ym_93 dropped from div() because of collinearity
note: ym_104 dropped from div() because of collinearity
note: ym_108 dropped from div() because of collinearity
note: ym_109 dropped from div() because of collinearity
note: ym_112 dropped from div() because of collinearity
note: ym_120 dropped from div() because of collinearity
note: ym_121 dropped from div() because of collinearity
note: ym_127 dropped from div() because of collinearity
note: ym_130 dropped from div() because of collinearity
note: ym_133 dropped from div() because of collinearity
note: ym_143 dropped from div() because of collinearity
note: ym_147 dropped from div() because of collinearity
note: ym_149 dropped from div() because of collinearity
note: dperiod_1977 dropped because of collinearity
note: dperiod_1977_inf_a dropped because of collinearity
note: m_6 dropped because of collinearity
note: y_1 dropped because of collinearity
note: y_2 dropped because of collinearity
note: y_3 dropped because of collinearity
note: y_4 dropped because of collinearity
note: y_13 dropped because of collinearity
note: ym_1 dropped because of collinearity
note: ym_2 dropped because of collinearity
note: ym_3 dropped because of collinearity
note: ym_4 dropped because of collinearity
note: ym_5 dropped because of collinearity
note: ym_6 dropped because of collinearity
note: ym_7 dropped because of collinearity
note: ym_8 dropped because of collinearity
note: ym_9 dropped because of collinearity
note: ym_10 dropped because of collinearity
note: ym_11 dropped because of collinearity
note: ym_12 dropped because of collinearity
note: ym_13 dropped because of collinearity
note: ym_14 dropped because of collinearity
note: ym_15 dropped because of collinearity
note: ym_16 dropped because of collinearity
note: ym_17 dropped because of collinearity
note: ym_18 dropped because of collinearity
note: ym_19 dropped because of collinearity
note: ym_20 dropped because of collinearity
note: ym_21 dropped because of collinearity
note: ym_22 dropped because of collinearity
note: ym_23 dropped because of collinearity
note: ym_24 dropped because of collinearity
note: ym_25 dropped because of collinearity
note: ym_26 dropped because of collinearity
note: ym_27 dropped because of collinearity
note: ym_28 dropped because of collinearity
note: ym_29 dropped because of collinearity
note: ym_30 dropped because of collinearity
note: ym_31 dropped because of collinearity
note: ym_32 dropped because of collinearity
note: ym_33 dropped because of collinearity
note: ym_34 dropped because of collinearity
note: ym_35 dropped because of collinearity
note: ym_36 dropped because of collinearity
note: ym_37 dropped because of collinearity
note: ym_38 dropped because of collinearity
note: ym_39 dropped because of collinearity
note: ym_40 dropped because of collinearity
note: ym_41 dropped because of collinearity
note: ym_42 dropped because of collinearity
note: ym_43 dropped because of collinearity
note: ym_44 dropped because of collinearity
note: ym_45 dropped because of collinearity
note: ym_46 dropped because of collinearity
note: ym_47 dropped because of collinearity
note: ym_48 dropped because of collinearity
note: ym_52 dropped because of collinearity
note: ym_58 dropped because of collinearity
note: ym_62 dropped because of collinearity
note: ym_68 dropped because of collinearity
note: ym_73 dropped because of collinearity
note: ym_91 dropped because of collinearity
note: ym_95 dropped because of collinearity
note: ym_98 dropped because of collinearity
note: ym_103 dropped because of collinearity
note: ym_111 dropped because of collinearity
note: ym_114 dropped because of collinearity
note: ym_116 dropped because of collinearity
note: ym_126 dropped because of collinearity
note: ym_129 dropped because of collinearity
note: ym_133 dropped because of collinearity
note: ym_141 dropped because of collinearity
note: ym_142 dropped because of collinearity
note: ym_148 dropped because of collinearity
note: ym_149 dropped because of collinearity

Arellano-Bond dynamic panel-data estimation     Number of obs     =      2,369
Group variable: code                            Number of groups  =         23
Time variable: date
                                                Obs per group:
                                                              min =        103
                                                              avg =        103
                                                              max =        103

Number of instruments =   2.4e+03               Wald chi2(106)    =   46604.70
                                                Prob > chi2       =     0.0000
One-step results
-------------------------------------------------------------------------------------
                 cv |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
                 cv |
                L1. |   .9299499   .0062981   147.66   0.000     .9176058    .9422939
                    |
              inf_a |   .0384666   .0034431    11.17   0.000     .0317181     .045215
      dtreated_1977 |          0  (omitted)
             dint_2 |   .0426984   .0079153     5.39   0.000     .0271848    .0582121
dtreated_1977_inf_a |   .0274406   .0046736     5.87   0.000     .0182804    .0366008
        dint2_inf_a |  -.0197663   .0067749    -2.92   0.004    -.0330449   -.0064877
                m_1 |  -.0252427   .0082733    -3.05   0.002     -.041458   -.0090274
                m_2 |    .032284   .0076254     4.23   0.000     .0173385    .0472294
                m_3 |   .0081611   .0062741     1.30   0.193     -.004136    .0204582
                m_4 |   .0407422      .0092     4.43   0.000     .0227106    .0587738
                m_5 |   .0427997   .0108645     3.94   0.000     .0215057    .0640936
                m_7 |   .0509733   .0083186     6.13   0.000     .0346692    .0672774
                m_8 |   .0143951   .0059228     2.43   0.015     .0027867    .0260036
                m_9 |  -.0123783   .0059381    -2.08   0.037    -.0240166   -.0007399
               m_10 |  -.0264745    .007693    -3.44   0.001    -.0415526   -.0113964
               m_11 |   .0738814   .0082872     8.92   0.000     .0576389     .090124
               m_12 |  -.0173961   .0092086    -1.89   0.059    -.0354446    .0006524
                y_5 |  -.0581874    .005207   -11.17   0.000    -.0683929   -.0479819
                y_6 |  -.0375277   .0084065    -4.46   0.000    -.0540042   -.0210513
                y_7 |   .0057396   .0085199     0.67   0.501     -.010959    .0224382
                y_8 |  -.0502208   .0073158    -6.86   0.000    -.0645596   -.0358821
                y_9 |  -.0172838   .0090475    -1.91   0.056    -.0350166    .0004491
               y_10 |   .0215242   .0097378     2.21   0.027     .0024386    .0406099
               y_11 |   .0395767   .0087923     4.50   0.000     .0223442    .0568093
               y_12 |   .0574707   .0072336     7.94   0.000     .0432931    .0716483
              ym_49 |   .0412408     .00874     4.72   0.000     .0241108    .0583708
              ym_50 |  -.0170758   .0101093    -1.69   0.091    -.0368896     .002738
              ym_51 |   .0368852   .0109521     3.37   0.001     .0154195    .0583509
              ym_53 |  -.0156377   .0088917    -1.76   0.079    -.0330652    .0017898
              ym_54 |   .0092139   .0096617     0.95   0.340    -.0097227    .0281505
              ym_55 |   .0052139   .0094269     0.55   0.580    -.0132626    .0236903
              ym_56 |   .0185101   .0102772     1.80   0.072    -.0016327    .0386529
              ym_57 |   .0293908   .0084223     3.49   0.000     .0128834    .0458983
              ym_59 |  -.0258981   .0085761    -3.02   0.003     -.042707   -.0090893
              ym_60 |   .0727512   .0087747     8.29   0.000     .0555531    .0899493
              ym_61 |   .0455376   .0105179     4.33   0.000      .024923    .0661522
              ym_63 |   .0169493   .0086995     1.95   0.051    -.0001013    .0339999
              ym_64 |  -.0276718   .0108716    -2.55   0.011    -.0489798   -.0063637
              ym_65 |  -.0168155   .0124633    -1.35   0.177    -.0412431    .0076121
              ym_66 |   .0130738   .0082985     1.58   0.115     -.003191    .0293386
              ym_67 |  -.0177703   .0082702    -2.15   0.032    -.0339795   -.0015611
              ym_69 |   .0358799   .0093226     3.85   0.000     .0176079    .0541519
              ym_70 |   .0543586   .0096326     5.64   0.000     .0354791    .0732381
              ym_71 |  -.0513524   .0092463    -5.55   0.000    -.0694748   -.0332301
              ym_72 |   .0469247   .0105162     4.46   0.000     .0263132    .0675361
              ym_74 |  -.0494843   .0115109    -4.30   0.000    -.0720453   -.0269233
              ym_75 |  -.0226874   .0118425    -1.92   0.055    -.0458982    .0005234
              ym_76 |  -.0426214   .0103055    -4.14   0.000    -.0628199   -.0224229
              ym_77 |  -.0260173   .0116285    -2.24   0.025    -.0488087   -.0032259
              ym_78 |   .0102878   .0105445     0.98   0.329     -.010379    .0309546
              ym_79 |  -.0500806   .0113007    -4.43   0.000    -.0722297   -.0279316
              ym_80 |  -.0011899   .0113937    -0.10   0.917    -.0235211    .0211413
              ym_81 |   .0120372   .0090149     1.34   0.182    -.0056316    .0297061
              ym_82 |   .0267647   .0089822     2.98   0.003       .00916    .0443694
              ym_83 |  -.0627632   .0105872    -5.93   0.000    -.0835138   -.0420126
              ym_84 |   .0206943   .0108902     1.90   0.057      -.00065    .0420387
              ym_85 |   .0786805   .0100922     7.80   0.000     .0589001    .0984609
              ym_86 |   .0270505   .0083449     3.24   0.001     .0106948    .0434063
              ym_87 |   .0484104   .0105525     4.59   0.000     .0277279    .0690929
              ym_88 |   .0266103   .0096571     2.76   0.006     .0076828    .0455378
              ym_89 |   .0143741   .0112029     1.28   0.199    -.0075832    .0363314
              ym_90 |   .0392885   .0095623     4.11   0.000     .0205467    .0580304
              ym_92 |   .0601416   .0092385     6.51   0.000     .0420345    .0782486
              ym_93 |   .0765413    .009226     8.30   0.000     .0584586    .0946239
              ym_94 |   .0897405    .008228    10.91   0.000     .0736138    .1058671
              ym_96 |    .084228   .0087377     9.64   0.000     .0671025    .1013536
              ym_97 |   .0675498   .0105204     6.42   0.000     .0469302    .0881694
              ym_99 |   .0305934   .0099365     3.08   0.002     .0111182    .0500686
             ym_100 |  -.0044731   .0103107    -0.43   0.664    -.0246817    .0157354
             ym_101 |    .005447   .0117019     0.47   0.642    -.0174883    .0283823
             ym_102 |   .0457619   .0092407     4.95   0.000     .0276504    .0638734
             ym_104 |   .0268975   .0082671     3.25   0.001     .0106942    .0431008
             ym_105 |   .0590088   .0095485     6.18   0.000     .0402941    .0777235
             ym_106 |    .073995    .009237     8.01   0.000     .0558908    .0920992
             ym_107 |  -.0233948   .0082802    -2.83   0.005    -.0396236    -.007166
             ym_108 |   .0566691   .0099752     5.68   0.000      .037118    .0762202
             ym_109 |   .0408006   .0099598     4.10   0.000     .0212798    .0603215
             ym_110 |  -.0221073   .0082662    -2.67   0.007    -.0383088   -.0059058
             ym_112 |  -.0320973   .0105818    -3.03   0.002    -.0528372   -.0113574
             ym_113 |  -.0349059   .0120718    -2.89   0.004    -.0585661   -.0112456
             ym_115 |  -.0429436     .00924    -4.65   0.000    -.0610538   -.0248335
             ym_117 |   .0196288   .0083094     2.36   0.018     .0033427     .035915
             ym_118 |   .0409994   .0093498     4.39   0.000     .0226743    .0593246
             ym_119 |  -.0651432    .009522    -6.84   0.000     -.083806   -.0464805
             ym_120 |   .0292721   .0104775     2.79   0.005     .0087366    .0498076
             ym_121 |   .0097777   .0087017     1.12   0.261    -.0072773    .0268328
             ym_122 |  -.0421297   .0092636    -4.55   0.000     -.060286   -.0239734
             ym_123 |  -.0179165   .0087081    -2.06   0.040     -.034984    -.000849
             ym_124 |  -.0475648   .0097594    -4.87   0.000    -.0666929   -.0284366
             ym_125 |  -.0517415   .0113329    -4.57   0.000    -.0739536   -.0295294
             ym_127 |  -.0584683   .0095397    -6.13   0.000    -.0771658   -.0397709
             ym_128 |  -.0214963   .0083017    -2.59   0.010    -.0377673   -.0052253
             ym_130 |   .0209637   .0082943     2.53   0.011     .0047073    .0372202
             ym_131 |  -.0802512   .0092096    -8.71   0.000    -.0983017   -.0622008
             ym_132 |   .0143477   .0098968     1.45   0.147    -.0050498    .0337451
             ym_134 |  -.0548285   .0095669    -5.73   0.000    -.0735794   -.0360777
             ym_135 |  -.0274627   .0099655    -2.76   0.006    -.0469947   -.0079308
             ym_136 |  -.0648217   .0081646    -7.94   0.000     -.080824   -.0488194
             ym_137 |  -.0639968   .0099496    -6.43   0.000    -.0834976    -.044496
             ym_138 |  -.0200903   .0082915    -2.42   0.015    -.0363414   -.0038392
             ym_139 |  -.0706683    .009235    -7.65   0.000    -.0887685    -.052568
             ym_140 |  -.0347762   .0093231    -3.73   0.000    -.0530491   -.0165032
             ym_143 |  -.0924827   .0082403   -11.22   0.000    -.1086334   -.0763319
             ym_144 |  -.0044843   .0086779    -0.52   0.605    -.0214926     .012524
             ym_145 |   .0668839   .0099729     6.71   0.000     .0473373    .0864305
             ym_146 |   .0114971   .0111509     1.03   0.303    -.0103582    .0333525
             ym_147 |   .0308147   .0120323     2.56   0.010     .0072318    .0543976
              _cons |  -.0574164   .0101776    -5.64   0.000    -.0773643   -.0374686
-------------------------------------------------------------------------------------
Instruments for differenced equation
        GMM-type: L(2/.).cv
        Standard: D.inf_a D.dint_2 D.dtreated_1977_inf_a D.dperiod_1977_inf_a
                  D.dint2_inf_a D.m_1 D.m_2 D.m_3 D.m_4 D.m_5 D.m_6 D.m_7 D.m_9
                  D.m_10 D.m_11 D.m_12 D.y_5 D.y_6 D.y_7 D.y_9 D.y_10 D.y_11 D.y_12
                  D.ym_47 D.ym_48 D.ym_49 D.ym_50 D.ym_51 D.ym_52 D.ym_53 D.ym_55
                  D.ym_56 D.ym_57 D.ym_58 D.ym_60 D.ym_61 D.ym_63 D.ym_64 D.ym_65
                  D.ym_67 D.ym_68 D.ym_69 D.ym_70 D.ym_71 D.ym_72 D.ym_73 D.ym_74
                  D.ym_75 D.ym_76 D.ym_78 D.ym_79 D.ym_80 D.ym_81 D.ym_82 D.ym_83
                  D.ym_85 D.ym_87 D.ym_88 D.ym_89 D.ym_90 D.ym_91 D.ym_92 D.ym_94
                  D.ym_95 D.ym_96 D.ym_97 D.ym_98 D.ym_99 D.ym_100 D.ym_101
                  D.ym_102 D.ym_103 D.ym_105 D.ym_106 D.ym_107 D.ym_110 D.ym_111
                  D.ym_113 D.ym_114 D.ym_115 D.ym_116 D.ym_117 D.ym_118 D.ym_119
                  D.ym_122 D.ym_123 D.ym_124 D.ym_125 D.ym_126 D.ym_128 D.ym_129
                  D.ym_131 D.ym_132 D.ym_134 D.ym_135 D.ym_136 D.ym_137 D.ym_138
                  D.ym_139 D.ym_140 D.ym_141 D.ym_142 D.ym_144 D.ym_145 D.ym_146
                  D.ym_148
Instruments for level equation
        Standard: _cons

. outreg2 using `table_results'/Table6.tex, append bdec(3) sdec(2) tex(fragment) label ///
> addtext(Product FE, \checkmark, Month FE, \checkmark, Year FE, \checkmark, Month $\times$ Year FE, \checkmark) keep(inf_a dint_2 dtreated_1977_inf
> _a dint2_inf_a ) ///
> ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table6.tex
dir : seeout

. 
. * Redefining labels
. 
. label var inf_a "Annual Inflation"

. label var dtreated_1973_inf_a  "$\vspace{0pt}D_i^{73} \vspace{0pt}\times \pi_t^a $"

. label var dtreated_1977_inf_a  "$\vspace{0pt}D_i^{77} \vspace{0pt}\times \pi_t^a $"

. label var dperiod_1973_inf_a "$\vspace{0pt}D\vspace{0pt}_t^{73}\vspace{0pt}\times \pi_t^a $"

. label var dperiod_1977_inf_a "$\vspace{0pt}D\vspace{0pt}_t^{77}\vspace{0pt}\times \pi_t^a $"

. 
. 
. label var dperiod_1973 "Liberalization Period ($\vspace{0pt}D\vspace{0pt}_t^{73}\vspace{0pt}$)"

. label var dperiod_1977 "Liberalization Period ($\vspace{0pt}D\vspace{0pt}_t^{77}\vspace{0pt})$"

. label var dtreated_1973 "Liberalized Prices $\vspace{0pt}(D_i)$"

. label var dtreated_1977 "Liberalized Prices $\vspace{0pt}(D_i)$"

. label var dint_1 "$\vspace{0pt} D_i^{73}\times \vspace{0pt}D\vspace{0pt}_t^{73}\vspace{0pt}$"

. label var dint_2 "$\vspace{0pt} D_i^{77}\times \vspace{0pt}D\vspace{0pt}_t^{77}\vspace{0pt}$"

. label var dint1_inf_a "$\vspace{0pt}D\vspace{0pt}_{it}^{73}\times \pi_t^a $"

. label var dint2_inf_a "$\vspace{0pt}D\vspace{0pt}_{it}^{77}\times \pi_t^a $"

. 
. ********************************************************************************
. 
. ************* TABLE 7. NESTED MODEL 1970 m1 - 1982m5
. 
. 
. xtreg cv inf_a if tin(1970m1, 1982m5), fe vce(r)

Fixed-effects (within) regression               Number of obs     =      3,427
Group variable: code                            Number of groups  =         23

R-sq:                                           Obs per group:
     within  = 0.3036                                         min =        149
     between = 0.0000                                         avg =      149.0
     overall = 0.2385                                         max =        149

                                                F(1,22)           =      84.31
corr(u_i, Xb)  = 0.0000                         Prob > F          =     0.0000

                                  (Std. Err. adjusted for 23 clusters in code)
------------------------------------------------------------------------------
             |               Robust
          cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       inf_a |    .078256   .0085226     9.18   0.000     .0605811    .0959308
       _cons |   .0612757   .0065734     9.32   0.000     .0476432    .0749082
-------------+----------------------------------------------------------------
     sigma_u |  .04781043
     sigma_e |  .07492899
         rho |  .28933945   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using `table_results'/Table7.tex, replace bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark) keep(inf_a) ///
> ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table7.tex
dir : seeout

.         
. xtreg cv inf_a dtreated_1973 dperiod_1973 dint_1 dtreated_1973_inf_a dperiod_1973_inf_a dint1_inf_a dtreated_1977 dperiod_1977 dint_2  dperiod_197
> 7_inf_a dint2_inf_a   if tin(1970m1, 1982m5), fe vce(r)
note: dtreated_1973 omitted because of collinearity
note: dtreated_1977 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      3,427
Group variable: code                            Number of groups  =         23

R-sq:                                           Obs per group:
     within  = 0.4047                                         min =        149
     between = 0.4914                                         avg =      149.0
     overall = 0.2743                                         max =        149

                                                F(10,22)          =      21.04
corr(u_i, Xb)  = -0.0855                        Prob > F          =     0.0000

                                         (Std. Err. adjusted for 23 clusters in code)
-------------------------------------------------------------------------------------
                    |               Robust
                 cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              inf_a |   .0523004   .0114638     4.56   0.000     .0285259    .0760749
      dtreated_1973 |          0  (omitted)
       dperiod_1973 |  -.3561968   .0671898    -5.30   0.000    -.4955399   -.2168537
             dint_1 |   .3463684   .1268114     2.73   0.012     .0833776    .6093592
dtreated_1973_inf_a |  -.0255983   .0165699    -1.54   0.137    -.0599621    .0087656
 dperiod_1973_inf_a |   .2467987   .0477742     5.17   0.000     .1477209    .3458764
        dint1_inf_a |  -.2117917   .0813612    -2.60   0.016    -.3805245   -.0430588
      dtreated_1977 |          0  (omitted)
       dperiod_1977 |  -.0233943   .1180758    -0.20   0.845    -.2682685    .2214798
             dint_2 |   .3516753   .1390383     2.53   0.019     .0633274    .6400231
 dperiod_1977_inf_a |   .0284697   .1096242     0.26   0.798     -.198877    .2558163
        dint2_inf_a |  -.2560509   .1238897    -2.07   0.051    -.5129825    .0008807
              _cons |   .0877291   .0092562     9.48   0.000     .0685329    .1069253
--------------------+----------------------------------------------------------------
            sigma_u |  .05263033
            sigma_e |   .0693706
                rho |   .3653214   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------

. outreg2 using `table_results'/Table7.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark) keep(inf_a dtreated_1973 dperiod_1973 dint_1 dtreated_1973_inf_a dperiod_1973_inf_a dint1_inf_a dp
> eriod_1977 dint_2 dperiod_1977_inf_a dint2_inf_a) ///
> ctitle(" ") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table7.tex
dir : seeout

. 
. xtabond cv inf_a dtreated_1973 dperiod_1973 dint_1 dtreated_1973_inf_a dperiod_1973_inf_a dint1_inf_a dtreated_1977 dperiod_1977 dint_2  dperiod_1
> 977_inf_a dint2_inf_a   if tin(1970m1, 1982m5)
note: dtreated_1973 dropped from div() because of collinearity
note: dtreated_1977 dropped from div() because of collinearity
note: dtreated_1973 dropped because of collinearity

Arellano-Bond dynamic panel-data estimation     Number of obs     =      3,381
Group variable: code                            Number of groups  =         23
Time variable: date
                                                Obs per group:
                                                              min =        147
                                                              avg =        147
                                                              max =        147

Number of instruments =   3.1e+03               Wald chi2(11)     =   41623.93
                                                Prob > chi2       =     0.0000
One-step results
-------------------------------------------------------------------------------------
                 cv |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
                 cv |
                L1. |   .9075918    .006002   151.21   0.000      .895828    .9193556
                    |
              inf_a |   .0142123   .0021793     6.52   0.000      .009941    .0184836
       dperiod_1973 |  -.0557313   .0068719    -8.11   0.000       -.0692   -.0422626
             dint_1 |   .0442838   .0089572     4.94   0.000     .0267279    .0618396
dtreated_1973_inf_a |  -.0094208   .0028981    -3.25   0.001    -.0151009   -.0037406
 dperiod_1973_inf_a |   .0278513   .0046235     6.02   0.000     .0187894    .0369132
        dint1_inf_a |  -.0192458    .005964    -3.23   0.001    -.0309351   -.0075566
      dtreated_1977 |          0  (omitted)
       dperiod_1977 |   .0109641   .0056742     1.93   0.053    -.0001571    .0220852
             dint_2 |    .044982   .0088343     5.09   0.000      .027667     .062297
 dperiod_1977_inf_a |  -.0137136   .0048763    -2.81   0.005     -.023271   -.0041561
        dint2_inf_a |  -.0219602   .0075438    -2.91   0.004    -.0367458   -.0071747
              _cons |   .0061069   .0013411     4.55   0.000     .0034784    .0087355
-------------------------------------------------------------------------------------
Instruments for differenced equation
        GMM-type: L(2/.).cv
        Standard: D.inf_a D.dperiod_1973 D.dint_1 D.dtreated_1973_inf_a
                  D.dperiod_1973_inf_a D.dint1_inf_a D.dperiod_1977 D.dint_2
                  D.dperiod_1977_inf_a D.dint2_inf_a
Instruments for level equation
        Standard: _cons

. outreg2 using `table_results'/Table7.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark) keep(inf_a dtreated_1973 dperiod_1973 dint_1 dtreated_1973_inf_a dperiod_1973_inf_a dint1_inf_a dp
> eriod_1977 dint_2 dperiod_1977_inf_a dint2_inf_a) ///
> ctitle("AB Estimates") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table7.tex
dir : seeout

. 
. 
. ****************************************************************************
. 
. **************** TABLE 8. COMPARISON ACROSS SPECIFICATIONS
. 
. xtreg cv inf_a dtreated_1973 dperiod_1973 dint_1 dtreated_1973_inf_a dperiod_1973_inf_a dint1_inf_a i.year i.month i.month#i.year if tin(1970m1, 1
> 976m12), fe vce(r)
note: dtreated_1973 omitted because of collinearity
note: 12.month#1973.year omitted because of collinearity
note: 12.month#1975.year omitted because of collinearity
note: 12.month#1976.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      1,932
Group variable: code                            Number of groups  =         23

R-sq:                                           Obs per group:
     within  = 0.4642                                         min =         84
     between = 0.3506                                         avg =       84.0
     overall = 0.3171                                         max =         84

                                                F(26,22)          =          .
corr(u_i, Xb)  = -0.1290                        Prob > F          =          .

                                         (Std. Err. adjusted for 23 clusters in code)
-------------------------------------------------------------------------------------
                    |               Robust
                 cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              inf_a |   1.877675   .7839969     2.40   0.026     .2517646    3.503585
      dtreated_1973 |          0  (omitted)
       dperiod_1973 |   2.812501   1.125221     2.50   0.020     .4789354    5.146067
             dint_1 |   .3463684   .1295438     2.67   0.014      .077711    .6150257
dtreated_1973_inf_a |  -.0255983   .0169269    -1.51   0.145    -.0607026     .009506
 dperiod_1973_inf_a |  -1.911197   .8218217    -2.33   0.030    -3.615551   -.2068432
        dint1_inf_a |  -.2117917   .0831143    -2.55   0.018    -.3841601   -.0394232
                    |
               year |
              1971  |   .0383942   .0358938     1.07   0.296     -.036045    .1128333
              1972  |  -.0629474   .0217224    -2.90   0.008    -.1079968   -.0178979
              1973  |  -1.946596   .8221377    -2.37   0.027    -3.651605   -.2415867
              1974  |  -2.002546   .8322764    -2.41   0.025    -3.728582   -.2765107
              1975  |  -2.182444   .8399988    -2.60   0.016    -3.924495   -.4403931
              1976  |  -2.237979   .8535449    -2.62   0.016    -4.008122   -.4678349
                    |
              month |
                 2  |   .0092429   .0024952     3.70   0.001     .0040682    .0144176
                 3  |   .0020827   .0017011     1.22   0.234    -.0014451    .0056106
                 4  |   .0127072   .0062807     2.02   0.055    -.0003182    .0257325
                 5  |   .0245773   .0102604     2.40   0.026     .0032985    .0458561
                 6  |   .0295286   .0144113     2.05   0.053    -.0003586    .0594159
                 7  |   .0162381   .0094369     1.72   0.099    -.0033328    .0358089
                 8  |   .0016958   .0077897     0.22   0.830     -.014459    .0178506
                 9  |  -.0371476   .0176323    -2.11   0.047    -.0737148   -.0005804
                10  |   -.046019   .0213838    -2.15   0.043    -.0903662   -.0016718
                11  |  -.0450354   .0193013    -2.33   0.029    -.0850639   -.0050069
                12  |  -.0397011    .014792    -2.68   0.014    -.0703778   -.0090244
                    |
         month#year |
            2 1971  |   .0636749   .0306425     2.08   0.050     .0001262    .1272236
            2 1972  |  -.1431276   .0586642    -2.44   0.023    -.2647897   -.0214655
            2 1973  |   .0555302   .0217886     2.55   0.018     .0103435     .100717
            2 1974  |   .0046181   .0165049     0.28   0.782    -.0296109    .0388472
            2 1975  |  -.0248477   .0088985    -2.79   0.011    -.0433021   -.0063933
            2 1976  |  -.0221818   .0055683    -3.98   0.001    -.0337298   -.0106337
            3 1971  |    .106266   .0496746     2.14   0.044     .0032471    .2092848
            3 1972  |  -.1799793   .0758462    -2.37   0.027    -.3372746    -.022684
            3 1973  |   .0119027   .0050676     2.35   0.028     .0013931    .0224123
            3 1974  |   .0437719   .0233409     1.88   0.074    -.0046341    .0921779
            3 1975  |  -.0177478   .0063491    -2.80   0.011     -.030915   -.0045806
            3 1976  |  -.0213043   .0059468    -3.58   0.002    -.0336372   -.0089713
            4 1971  |   .0829038   .0425354     1.95   0.064    -.0053093    .1711169
            4 1972  |  -.2840972   .1198196    -2.37   0.027    -.5325878   -.0356066
            4 1973  |  -.1267768    .054811    -2.31   0.030    -.2404479   -.0131058
            4 1974  |   .0376119   .0182319     2.06   0.051    -.0001988    .0754226
            4 1975  |  -.0231321    .011374    -2.03   0.054    -.0467202    .0004561
            4 1976  |  -.0421754   .0184033    -2.29   0.032    -.0803415   -.0040093
            5 1971  |   .0501532   .0285338     1.76   0.093    -.0090223    .1093288
            5 1972  |  -.3436796   .1452249    -2.37   0.027    -.6448577   -.0425015
            5 1973  |  -.3956715   .1718036    -2.30   0.031    -.7519704   -.0393727
            5 1974  |   .0018174   .0112418     0.16   0.873    -.0214967    .0251315
            5 1975  |  -.0185006   .0181921    -1.02   0.320    -.0562286    .0192274
            5 1976  |  -.0482073   .0163697    -2.94   0.007    -.0821561   -.0142586
            6 1971  |    .037418   .0211021     1.77   0.090    -.0063451    .0811811
            6 1972  |  -.3706683    .154535    -2.40   0.025    -.6911542   -.0501824
            6 1973  |  -.6984699    .303832    -2.30   0.031    -1.328579   -.0683609
            6 1974  |  -.0253013   .0141233    -1.79   0.087    -.0545912    .0039885
            6 1975  |  -.0396819    .019657    -2.02   0.056     -.080448    .0010842
            6 1976  |  -.0546422   .0216189    -2.53   0.019    -.0994771   -.0098074
            7 1971  |   .0777542   .0355689     2.19   0.040     .0039889    .1515195
            7 1972  |  -.4626707   .1930188    -2.40   0.025    -.8629672   -.0623742
            7 1973  |  -.8534283   .3718137    -2.30   0.032    -1.624523   -.0823338
            7 1974  |   .0026319   .0105257     0.25   0.805     -.019197    .0244608
            7 1975  |  -.0182232    .015706    -1.16   0.258    -.0507955     .014349
            7 1976  |  -.0341362   .0160932    -2.12   0.045    -.0675114    -.000761
            8 1971  |   .1041437   .0498311     2.09   0.048     .0008003    .2074871
            8 1972  |  -.8857504   .3703682    -2.39   0.026    -1.653847   -.1176538
            8 1973  |  -.6367963   .2845826    -2.24   0.036    -1.226984   -.0466081
            8 1974  |   .0071396   .0123598     0.58   0.569    -.0184931    .0327723
            8 1975  |  -.0100712    .012302    -0.82   0.422     -.035584    .0154416
            8 1976  |  -.0159744    .011542    -1.38   0.180    -.0399111    .0079622
            9 1971  |    .159728   .0740499     2.16   0.042      .006158     .313298
            9 1972  |  -1.269045   .5342411    -2.38   0.027    -2.376993   -.1610969
            9 1973  |  -.4061872   .1986475    -2.04   0.053     -.818157    .0057825
            9 1974  |   .0174593   .0229022     0.76   0.454    -.0300368    .0649555
            9 1975  |   .0247653   .0164128     1.51   0.146    -.0092728    .0588034
            9 1976  |   .0125092   .0123407     1.01   0.322    -.0130839    .0381024
           10 1971  |   .1392149   .0645813     2.16   0.042     .0052814    .2731484
           10 1972  |    -1.5139   .6488242    -2.33   0.029    -2.859479   -.1683213
           10 1973  |  -1.246881   .5526108    -2.26   0.034    -2.392926   -.1008366
           10 1974  |  -.1369267   .0549309    -2.49   0.021    -.2508464   -.0230071
           10 1975  |   .0173272   .0133548     1.30   0.208    -.0103691    .0450234
           10 1976  |   .0164422   .0156188     1.05   0.304    -.0159493    .0488337
           11 1971  |   .0898703   .0417881     2.15   0.043      .003207    .1765336
           11 1972  |   -1.58689   .6872721    -2.31   0.031    -3.012205   -.1615751
           11 1973  |   .0140288   .0106464     1.32   0.201    -.0080504    .0361081
           11 1974  |  -.1367393   .0544648    -2.51   0.020    -.2496924   -.0237862
           11 1975  |   .0098614   .0087461     1.13   0.272    -.0082768    .0279997
           11 1976  |   .0085808   .0098788     0.87   0.394    -.0119066    .0290681
           12 1971  |   .0112662   .0195462     0.58   0.570    -.0292701    .0518026
           12 1972  |   -1.73694   .7539066    -2.30   0.031    -3.300447   -.1734332
           12 1973  |          0  (omitted)
           12 1974  |  -.1301778   .0506738    -2.57   0.018    -.2352687   -.0250868
           12 1975  |          0  (omitted)
           12 1976  |          0  (omitted)
                    |
              _cons |  -.3939049   .2204362    -1.79   0.088    -.8510617    .0632519
--------------------+----------------------------------------------------------------
            sigma_u |   .0550921
            sigma_e |  .07400464
                rho |  .35657911   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------

. outreg2 using `table_results'/Table8.tex, replace bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark, Month FE, \checkmark, Year FE, \checkmark, Month $\times$ Year FE, \checkmark) keep(dint1_inf_a) /
> //
> ctitle("1970 -- 1976") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table8.tex
dir : seeout

. 
. xtreg cv inf_a dtreated_1977 dperiod_1977 dint_2 dtreated_1977_inf_a dperiod_1977_inf_a dint2_inf_a i.year i.month i.month#i.year if tin(1973m1, 1
> 982m5), fe vce(r)
note: dtreated_1977 omitted because of collinearity
note: 1982.year omitted because of collinearity
note: 6.month#1982.year identifies no observations in the sample
note: 7.month#1982.year identifies no observations in the sample
note: 8.month#1982.year identifies no observations in the sample
note: 9.month#1982.year identifies no observations in the sample
note: 10.month#1982.year identifies no observations in the sample
note: 11.month#1982.year identifies no observations in the sample
note: 12.month#1980.year omitted because of collinearity
note: 12.month#1981.year omitted because of collinearity
note: 12.month#1982.year identifies no observations in the sample

Fixed-effects (within) regression               Number of obs     =      2,599
Group variable: code                            Number of groups  =         23

R-sq:                                           Obs per group:
     within  = 0.4946                                         min =        113
     between = 0.5109                                         avg =      113.0
     overall = 0.0024                                         max =        113

                                                F(23,22)          =          .
corr(u_i, Xb)  = -0.9175                        Prob > F          =          .

                                         (Std. Err. adjusted for 23 clusters in code)
-------------------------------------------------------------------------------------
                    |               Robust
                 cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              inf_a |   .1380214   .0544462     2.54   0.019     .0251069    .2509359
      dtreated_1977 |          0  (omitted)
       dperiod_1977 |   .1013302   .0859908     1.18   0.251    -.0770039    .2796643
             dint_2 |   .3325872   .1310298     2.54   0.019      .060848    .6043264
dtreated_1977_inf_a |   .2267325   .0764819     2.96   0.007     .0681188    .3853462
 dperiod_1977_inf_a |   .0143868   .1150763     0.13   0.902    -.2242669    .2530404
        dint2_inf_a |  -.2453934   .1196808    -2.05   0.052    -.4935962    .0028094
                    |
               year |
              1974  |  -.0072012   .0136505    -0.53   0.603    -.0355106    .0211083
              1975  |  -.0100506   .0174397    -0.58   0.570    -.0462183    .0261171
              1976  |  -.0361602    .010825    -3.34   0.003    -.0586099   -.0137105
              1977  |   -.064772   .0954516    -0.68   0.504    -.2627265    .1331826
              1978  |  -.0439524   .0465318    -0.94   0.355    -.1404534    .0525486
              1979  |  -.0285409   .0224413    -1.27   0.217    -.0750813    .0179995
              1980  |  -.0419324   .0253871    -1.65   0.113    -.0945821    .0107173
              1981  |  -.0223428   .0126767    -1.76   0.092    -.0486326    .0039469
              1982  |          0  (omitted)
                    |
              month |
                 2  |   .0148298   .0029753     4.98   0.000     .0086595    .0210001
                 3  |   .0082272   .0029394     2.80   0.010     .0021313    .0143231
                 4  |  -.0122905   .0046176    -2.66   0.014    -.0218668   -.0027142
                 5  |  -.0378698   .0111466    -3.40   0.003    -.0609865   -.0147532
                 6  |  -.0709415   .0191132    -3.71   0.001    -.1105798   -.0313032
                 7  |  -.0857213   .0242537    -3.53   0.002    -.1360204   -.0354221
                 8  |  -.0551162   .0182178    -3.03   0.006    -.0928977   -.0173348
                 9  |  -.0084655   .0152787    -0.55   0.585    -.0401516    .0232206
                10  |  -.1175839   .0223726    -5.26   0.000    -.1639819   -.0711859
                11  |   .0011329   .0141221     0.08   0.937    -.0281545    .0304203
                12  |   .0200974   .0118839     1.69   0.105    -.0045484    .0447431
                    |
         month#year |
            2 1974  |  -.0640414   .0129583    -4.94   0.000    -.0909154   -.0371674
            2 1975  |  -.0091622   .0051196    -1.79   0.087    -.0197795    .0014551
            2 1976  |  -.0109928   .0036268    -3.03   0.006    -.0185143   -.0034712
            2 1977  |  -.0061025   .0061032    -1.00   0.328    -.0187598    .0065549
            2 1978  |  -.0121636    .003522    -3.45   0.002    -.0194678   -.0048594
            2 1979  |  -.0128908   .0050106    -2.57   0.017    -.0232821   -.0024996
            2 1980  |  -.0153674   .0035219    -4.36   0.000    -.0226713   -.0080635
            2 1981  |  -.0117254   .0028086    -4.17   0.000    -.0175501   -.0059006
            2 1982  |  -.0107109   .0051261    -2.09   0.048    -.0213417   -.0000801
            3 1974  |  -.0506465   .0135043    -3.75   0.001    -.0786526   -.0226403
            3 1975  |  -.0143534   .0066625    -2.15   0.042    -.0281705   -.0005363
            3 1976  |  -.0043789   .0053657    -0.82   0.423    -.0155068    .0067489
            3 1977  |   .0050951    .010621     0.48   0.636    -.0169315    .0271217
            3 1978  |  -.0021389   .0082132    -0.26   0.797    -.0191719    .0148942
            3 1979  |  -.0082978   .0048914    -1.70   0.104     -.018442    .0018464
            3 1980  |   -.009039   .0037642    -2.40   0.025    -.0168456   -.0012325
            3 1981  |   .0011451   .0045513     0.25   0.804    -.0082937    .0105839
            3 1982  |  -.0061935    .006073    -1.02   0.319    -.0187882    .0064013
            4 1974  |  -.0058656   .0093482    -0.63   0.537    -.0252525    .0135213
            4 1975  |  -.0291229    .008761    -3.32   0.003    -.0472921   -.0109537
            4 1976  |   .0420017   .0130062     3.23   0.004     .0150284     .068975
            4 1977  |   .0360595     .01435     2.51   0.020     .0062994    .0658195
            4 1978  |   .0151542   .0134462     1.13   0.272    -.0127315    .0430399
            4 1979  |   .0120951   .0063901     1.89   0.072    -.0011571    .0253473
            4 1980  |   .0143861   .0046101     3.12   0.005     .0048254    .0239468
            4 1981  |   .0212149   .0060195     3.52   0.002     .0087313    .0336986
            4 1982  |   .0156009   .0077374     2.02   0.056    -.0004455    .0316473
            5 1974  |   .0378987    .012953     2.93   0.008     .0110358    .0647615
            5 1975  |  -.0136389   .0100509    -1.36   0.189    -.0344833    .0072055
            5 1976  |   .1053467   .0289642     3.64   0.001     .0452786    .1654149
            5 1977  |   .0612048    .022669     2.70   0.013     .0141921    .1082174
            5 1978  |   .0472167   .0158947     2.97   0.007     .0142531    .0801802
            5 1979  |   .0345203   .0117095     2.95   0.007     .0102364    .0588042
            5 1980  |   .0406776   .0107363     3.79   0.001     .0184118    .0629433
            5 1981  |   .0485291   .0102519     4.73   0.000      .027268    .0697901
            5 1982  |   .0439443   .0129316     3.40   0.003     .0171257    .0707628
            6 1974  |   .0454918   .0159876     2.85   0.009     .0123356    .0786481
            6 1975  |   .0187854   .0160876     1.17   0.255    -.0145782     .052149
            6 1976  |   .1605403   .0434554     3.69   0.001     .0704193    .2506613
            6 1977  |   .0774705   .0474393     1.63   0.117    -.0209126    .1758536
            6 1978  |   .0824756   .0206813     3.99   0.001     .0395853     .125366
            6 1979  |   .0643252   .0197373     3.26   0.004     .0233926    .1052579
            6 1980  |   .0765984   .0183213     4.18   0.000     .0386024    .1145944
            6 1981  |   .0848576   .0167616     5.06   0.000     .0500962     .119619
            6 1982  |          0  (empty)
            7 1974  |   .0942654   .0238629     3.95   0.001     .0447768    .1437539
            7 1975  |   .0470699   .0209214     2.25   0.035     .0036816    .0904582
            7 1976  |   .1660651   .0459326     3.62   0.002     .0708066    .2613235
            7 1977  |   .0942777   .0508997     1.85   0.077    -.0112819    .1998372
            7 1978  |   .0971028   .0238161     4.08   0.000     .0477112    .1464944
            7 1979  |    .077572   .0244471     3.17   0.004     .0268717    .1282722
            7 1980  |   .0944169   .0230597     4.09   0.000      .046594    .1422397
            7 1981  |   .1020707   .0209279     4.88   0.000     .0586689    .1454726
            7 1982  |          0  (empty)
            8 1974  |   .0681481   .0211272     3.23   0.004     .0243329    .1119633
            8 1975  |   .0180953   .0165535     1.09   0.286    -.0162345    .0524251
            8 1976  |    .155856   .0448044     3.48   0.002     .0629374    .2487745
            8 1977  |   .0721466   .0492386     1.47   0.157     -.029968    .1742612
            8 1978  |   .0622756   .0221599     2.81   0.010     .0163187    .1082324
            8 1979  |   .0427656   .0191784     2.23   0.036      .002992    .0825392
            8 1980  |   .0674626   .0163275     4.13   0.000     .0336015    .1013237
            8 1981  |   .0721686   .0160696     4.49   0.000     .0388423    .1054949
            8 1982  |          0  (empty)
            9 1974  |   .0094743   .0241979     0.39   0.699     -.040709    .0596575
            9 1975  |  -.0266771   .0165543    -1.61   0.121    -.0610086    .0076544
            9 1976  |   .1111742   .0429201     2.59   0.017     .0221634     .200185
            9 1977  |   .0249082   .0510716     0.49   0.631    -.0810078    .1308242
            9 1978  |   .0164114   .0204447     0.80   0.431    -.0259883     .058811
            9 1979  |  -.0060456   .0164216    -0.37   0.716     -.040102    .0280108
            9 1980  |   .0245263   .0135665     1.81   0.084    -.0036089    .0526614
            9 1981  |   .0270065   .0153787     1.76   0.093    -.0048871       .0589
            9 1982  |          0  (empty)
           10 1974  |   .1410683   .0363134     3.88   0.001     .0657589    .2163776
           10 1975  |   .1017906   .0248029     4.10   0.000     .0503525    .1532287
           10 1976  |   .2166356   .0522471     4.15   0.000     .1082817    .3249895
           10 1977  |   .1312949   .0492526     2.67   0.014     .0291514    .2334385
           10 1978  |   .1305034   .0224984     5.80   0.000     .0838446    .1771622
           10 1979  |   .1076953   .0248994     4.33   0.000     .0560571    .1593335
           10 1980  |   .1340532    .017226     7.78   0.000     .0983286    .1697778
           10 1981  |   .1386274   .0169758     8.17   0.000     .1034217     .173833
           10 1982  |          0  (empty)
           11 1974  |   .0096679   .0249044     0.39   0.702    -.0419807    .0613165
           11 1975  |  -.0239371    .019707    -1.21   0.237    -.0648069    .0169327
           11 1976  |   .1162663   .0492639     2.36   0.028     .0140991    .2184334
           11 1977  |   .0101046   .0447953     0.23   0.824    -.0827951    .1030043
           11 1978  |   .0161732   .0174625     0.93   0.364    -.0200419    .0523884
           11 1979  |  -.0123827   .0177697    -0.70   0.493    -.0492347    .0244693
           11 1980  |   .0150117   .0068852     2.18   0.040     .0007326    .0292908
           11 1981  |   .0220541   .0052503     4.20   0.000     .0111656    .0329427
           11 1982  |          0  (empty)
           12 1974  |  -.0136752   .0229378    -0.60   0.557    -.0612453    .0338949
           12 1975  |  -.0376135   .0195467    -1.92   0.067    -.0781509     .002924
           12 1976  |    .091758   .0469031     1.96   0.063    -.0055131    .1890292
           12 1977  |  -.0093168   .0461363    -0.20   0.842    -.1049976     .086364
           12 1978  |  -.0102591   .0172395    -0.60   0.558    -.0460117    .0254935
           12 1979  |  -.0272268   .0149669    -1.82   0.083    -.0582662    .0038126
           12 1980  |          0  (omitted)
           12 1981  |          0  (omitted)
           12 1982  |          0  (empty)
                    |
              _cons |  -.1822646   .0725467    -2.51   0.020    -.3327172    -.031812
--------------------+----------------------------------------------------------------
            sigma_u |  .20853099
            sigma_e |  .07002588
                rho |  .89866201   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------

. outreg2 using `table_results'/Table8.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark, Month FE, \checkmark, Year FE, \checkmark, Month $\times$ Year FE, \checkmark) keep(dint2_inf_a) /
> //
> ctitle("1973 -- 1982") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table8.tex
dir : seeout

. 
. 
. xtreg cv inf_a dtreated_1977 dperiod_1977 dint_2 dtreated_1977_inf_a dperiod_1977_inf_a dint2_inf_a  dtreated_1973 dperiod_1973 dint_1 dtreated_19
> 73_inf_a dperiod_1973_inf_a dint1_inf_a i.year i.month i.month#i.year if tin(1970m1, 1982m5), fe vce(r)
note: dtreated_1977 omitted because of collinearity
note: dtreated_1973 omitted because of collinearity
note: dtreated_1973_inf_a omitted because of collinearity
note: 1982.year omitted because of collinearity
note: 6.month#1982.year identifies no observations in the sample
note: 7.month#1982.year identifies no observations in the sample
note: 8.month#1982.year identifies no observations in the sample
note: 9.month#1982.year identifies no observations in the sample
note: 10.month#1982.year identifies no observations in the sample
note: 11.month#1982.year identifies no observations in the sample
note: 12.month#1973.year omitted because of collinearity
note: 12.month#1976.year omitted because of collinearity
note: 12.month#1980.year omitted because of collinearity
note: 12.month#1981.year omitted because of collinearity
note: 12.month#1982.year identifies no observations in the sample

Fixed-effects (within) regression               Number of obs     =      3,427
Group variable: code                            Number of groups  =         23

R-sq:                                           Obs per group:
     within  = 0.4580                                         min =        149
     between = 0.4914                                         avg =      149.0
     overall = 0.3160                                         max =        149

                                                F(27,22)          =          .
corr(u_i, Xb)  = -0.0805                        Prob > F          =          .

                                         (Std. Err. adjusted for 23 clusters in code)
-------------------------------------------------------------------------------------
                    |               Robust
                 cv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              inf_a |  -.5917337   .4965067    -1.19   0.246    -1.621426    .4379581
      dtreated_1977 |          0  (omitted)
       dperiod_1977 |   .2381424   .6317518     0.38   0.710    -1.072031    1.548315
             dint_2 |   .3516753   .1420432     2.48   0.021     .0570957    .6462549
dtreated_1977_inf_a |   .0255983    .016928     1.51   0.145    -.0095082    .0607048
 dperiod_1977_inf_a |    .263799   .1429915     1.84   0.079    -.0327471    .5603452
        dint2_inf_a |  -.2560509   .1265672    -2.02   0.055    -.5185353    .0064335
      dtreated_1973 |          0  (omitted)
       dperiod_1973 |  -.8016281   .7046077    -1.14   0.267    -2.262895    .6596388
             dint_1 |   .3463684    .129552     2.67   0.014     .0776939    .6150429
dtreated_1973_inf_a |          0  (omitted)
 dperiod_1973_inf_a |   .6921345   .5093718     1.36   0.188     -.364238    1.748507
        dint1_inf_a |  -.2117917   .0831196    -2.55   0.018    -.3841711   -.0394122
                    |
               year |
              1971  |  -.0410711   .0267407    -1.54   0.139    -.0965279    .0143857
              1972  |  -.0304833   .0191946    -1.59   0.127    -.0702905     .009324
              1973  |   .6235523   .5071416     1.23   0.232     -.428195      1.6753
              1974  |   .6230408   .5119664     1.22   0.237    -.4387126    1.684794
              1975  |   .5129997   .5272106     0.97   0.341    -.5803682    1.606368
              1976  |   .4690751   .5287441     0.89   0.385     -.627473    1.565623
              1977  |   -.064772   .0954713    -0.68   0.505    -.2627673    .1332234
              1978  |  -.0439524   .0465414    -0.94   0.355    -.1404733    .0525684
              1979  |  -.0285409   .0224459    -1.27   0.217    -.0750909    .0180091
              1980  |  -.0419324   .0253924    -1.65   0.113    -.0945929    .0107282
              1981  |  -.0223428   .0126793    -1.76   0.092     -.048638    .0039524
              1982  |          0  (omitted)
                    |
              month |
                 2  |   .0014494   .0015968     0.91   0.374    -.0018622     .004761
                 3  |   .0042828   .0016465     2.60   0.016     .0008681    .0076975
                 4  |  -.0012088   .0055073    -0.22   0.828    -.0126302    .0102126
                 5  |   -.001706   .0073561    -0.23   0.819    -.0169617    .0135497
                 6  |  -.0054991   .0095861    -0.57   0.572    -.0253795    .0143813
                 7  |  -.0006914   .0070444    -0.10   0.923    -.0153006    .0139178
                 8  |   .0084464   .0079925     1.06   0.302    -.0081291    .0250218
                 9  |   .0227022   .0112983     2.01   0.057    -.0007291    .0461335
                10  |   .0258182   .0122407     2.11   0.047     .0004325    .0512038
                11  |   .0221429   .0114978     1.93   0.067    -.0017019    .0459878
                12  |   .0200974   .0118864     1.69   0.105    -.0045534    .0447482
                    |
         month#year |
            2 1971  |  -.0298578   .0202922    -1.47   0.155    -.0719412    .0122256
            2 1972  |   .0423532   .0363421     1.17   0.256    -.0330157     .117722
            2 1973  |  -.0117111   .0139382    -0.84   0.410    -.0406171     .017195
            2 1974  |  -.0124744   .0165286    -0.75   0.458    -.0467526    .0218037
            2 1975  |  -.0086609   .0076523    -1.13   0.270    -.0245308    .0072091
            2 1976  |  -.0077691    .005155    -1.51   0.146    -.0184599    .0029217
            2 1977  |   .0072779   .0054145     1.34   0.193    -.0039511     .018507
            2 1978  |   .0012168   .0031145     0.39   0.700    -.0052422    .0076758
            2 1979  |   .0004896   .0034345     0.14   0.888    -.0066331    .0076123
            2 1980  |   -.001987   .0024593    -0.81   0.428    -.0070873    .0031134
            2 1981  |   .0016551   .0024945     0.66   0.514    -.0035182    .0068283
            2 1982  |   .0026695   .0040539     0.66   0.517    -.0057378    .0110768
            3 1971  |  -.0470991   .0320152    -1.47   0.155    -.1134945    .0192963
            3 1972  |   .0593219   .0466969     1.27   0.217    -.0375215    .1561653
            3 1973  |   .0010514   .0044928     0.23   0.817     -.008266    .0103688
            3 1974  |   .0067422   .0228731     0.29   0.771    -.0406937    .0541781
            3 1975  |  -.0161842   .0062537    -2.59   0.017    -.0291537   -.0032148
            3 1976  |  -.0144019   .0059772    -2.41   0.025    -.0267979   -.0020059
            3 1977  |   .0090394   .0088671     1.02   0.319    -.0093499    .0274287
            3 1978  |   .0018055   .0069069     0.26   0.796    -.0125185    .0161295
            3 1979  |  -.0043534   .0029831    -1.46   0.159    -.0105399     .001833
            3 1980  |  -.0050947   .0028361    -1.80   0.086    -.0109764     .000787
            3 1981  |   .0050894   .0040665     1.25   0.224    -.0033439    .0135228
            3 1982  |  -.0022491   .0050058    -0.45   0.658    -.0126305    .0081322
            4 1971  |  -.0436803   .0279225    -1.56   0.132    -.1015881    .0142274
            4 1972  |   .0935775   .0748949     1.25   0.225     -.061745       .2489
            4 1973  |   .0400521   .0344719     1.16   0.258    -.0314383    .1115425
            4 1974  |   .0245102    .017705     1.38   0.180    -.0122077    .0612281
            4 1975  |   -.021443   .0111359    -1.93   0.067    -.0445375    .0016516
            4 1976  |  -.0049094   .0175737    -0.28   0.783    -.0413551    .0315363
            4 1977  |   .0249778   .0137538     1.82   0.083    -.0035458    .0535014
            4 1978  |   .0040725    .014046     0.29   0.775     -.025057    .0332021
            4 1979  |   .0010134    .005869     0.17   0.864    -.0111582     .013185
            4 1980  |   .0033044   .0074209     0.45   0.660    -.0120857    .0186945
            4 1981  |   .0101333   .0060884     1.66   0.110    -.0024933    .0227598
            4 1982  |   .0045193   .0083396     0.54   0.593    -.0127761    .0218146
            5 1971  |  -.0355173   .0196616    -1.81   0.085    -.0762929    .0052584
            5 1972  |   .1107918   .0909043     1.22   0.236    -.0777322    .2993158
            5 1973  |   .1312477   .1062153     1.24   0.230    -.0890292    .3515247
            5 1974  |   .0176977   .0113838     1.55   0.134    -.0059108    .0413062
            5 1975  |  -.0149383   .0177467    -0.84   0.409    -.0517427    .0218661
            5 1976  |   .0140234   .0114184     1.23   0.232    -.0096569    .0377036
            5 1977  |   .0250409   .0238365     1.05   0.305    -.0243929    .0744748
            5 1978  |   .0110528   .0173052     0.64   0.530     -.024836    .0469417
            5 1979  |  -.0016436   .0079509    -0.21   0.838    -.0181328    .0148457
            5 1980  |   .0045137   .0093528     0.48   0.634    -.0148829    .0239103
            5 1981  |   .0123652   .0081915     1.51   0.145     -.004623    .0293534
            5 1982  |   .0077804   .0113251     0.69   0.499    -.0157065    .0312673
            6 1971  |  -.0255967    .018051    -1.42   0.170    -.0630321    .0118387
            6 1972  |   .1141231   .0949648     1.20   0.242    -.0828219    .3110681
            6 1973  |    .234992   .1877792     1.25   0.224    -.1544383    .6244223
            6 1974  |   -.001983   .0130427    -0.15   0.881     -.029032     .025066
            6 1975  |  -.0212269   .0166248    -1.28   0.215    -.0557046    .0132508
            6 1976  |   .0256467   .0131056     1.96   0.063    -.0015328    .0528261
            6 1977  |   .0120281   .0486456     0.25   0.807    -.0888568     .112913
            6 1978  |   .0170332   .0198361     0.86   0.400    -.0241043    .0581708
            6 1979  |  -.0011172   .0103187    -0.11   0.915    -.0225168    .0202824
            6 1980  |    .011156   .0115685     0.96   0.345    -.0128357    .0351476
            6 1981  |   .0194152   .0109386     1.77   0.090    -.0032701    .0421004
            6 1982  |          0  (empty)
            7 1971  |   -.037516   .0264653    -1.42   0.170    -.0924018    .0173697
            7 1972  |   .1428492   .1184253     1.21   0.241      -.10275    .3884483
            7 1973  |   .2925073   .2306493     1.27   0.218      -.18583    .7708446
            7 1974  |   .0154872   .0103721     1.49   0.150    -.0060232    .0369976
            7 1975  |  -.0157609    .015311    -1.03   0.314     -.047514    .0159922
            7 1976  |   .0215558   .0109492     1.97   0.062    -.0011514     .044263
            7 1977  |   .0092478   .0500185     0.18   0.855    -.0944842    .1129798
            7 1978  |   .0120729   .0180697     0.67   0.511    -.0254013    .0495471
            7 1979  |  -.0074579   .0072728    -1.03   0.316    -.0225408    .0076249
            7 1980  |    .009387   .0091106     1.03   0.314    -.0095073    .0282813
            7 1981  |   .0170409   .0088128     1.93   0.066    -.0012358    .0353175
            7 1982  |          0  (empty)
            8 1971  |  -.0596555   .0327196    -1.82   0.082    -.1275117    .0082007
            8 1972  |    .269496   .2302649     1.17   0.254    -.2080443    .7470362
            8 1973  |   .2278209   .1791348     1.27   0.217    -.1436819    .5993237
            8 1974  |   .0020448     .01196     0.17   0.866    -.0227588    .0268484
            8 1975  |  -.0281242   .0145915    -1.93   0.067    -.0583852    .0021367
            8 1976  |   .0226569   .0103971     2.18   0.040     .0010946    .0442192
            8 1977  |    .008584   .0481525     0.18   0.860    -.0912781    .1084462
            8 1978  |   -.001287   .0178548    -0.07   0.943    -.0383156    .0357415
            8 1979  |   -.020797   .0088066    -2.36   0.027    -.0390608   -.0025331
            8 1980  |      .0039    .008402     0.46   0.647    -.0135246    .0213246
            8 1981  |    .008606   .0062662     1.37   0.183    -.0043893    .0216014
            8 1982  |          0  (empty)
            9 1971  |  -.0843009   .0455396    -1.85   0.078    -.1787442    .0101425
            9 1972  |   .3933185   .3338218     1.18   0.251    -.2989855    1.085623
            9 1973  |   .1873102   .1290719     1.45   0.161    -.0803685    .4549889
            9 1974  |  -.0342242   .0164919    -2.08   0.050    -.0684262   -.0000221
            9 1975  |  -.0440649   .0168607    -2.61   0.016    -.0790318   -.0090979
            9 1976  |   .0029058   .0112269     0.26   0.798    -.0203774    .0261891
            9 1977  |  -.0062595   .0451563    -0.14   0.891     -.099908     .087389
            9 1978  |  -.0147563   .0131753    -1.12   0.275    -.0420803    .0125677
            9 1979  |  -.0372133   .0123536    -3.01   0.006    -.0628331   -.0115935
            9 1980  |  -.0066414   .0058501    -1.14   0.268    -.0187737    .0054909
            9 1981  |  -.0041612   .0069094    -0.60   0.553    -.0184904     .010168
            9 1982  |          0  (empty)
           10 1971  |  -.0796062   .0408258    -1.95   0.064    -.1642737    .0050612
           10 1972  |   .5036886   .4060589     1.24   0.228    -.3384261    1.345803
           10 1973  |   .4470756   .3488308     1.28   0.213    -.2763552    1.170506
           10 1974  |  -.1273144   .0555708    -2.29   0.032    -.2425613   -.0120675
           10 1975  |  -.0494207   .0122304    -4.04   0.001     -.074785   -.0240565
           10 1976  |   -.004643   .0126555    -0.37   0.717    -.0308888    .0216028
           10 1977  |  -.0121072   .0460065    -0.26   0.795    -.1075188    .0833044
           10 1978  |  -.0128987   .0143493    -0.90   0.378    -.0426574    .0168599
           10 1979  |  -.0357068   .0138219    -2.58   0.017    -.0643716   -.0070419
           10 1980  |  -.0093489   .0069847    -1.34   0.194    -.0238343    .0051366
           10 1981  |  -.0047747   .0078366    -0.61   0.549    -.0210268    .0114774
           10 1982  |          0  (empty)
           11 1971  |   -.055601   .0280983    -1.98   0.060    -.1138733    .0026713
           11 1972  |   .5508212   .4287528     1.28   0.212    -.3383578        1.44
           11 1973  |  -.0042642   .0083623    -0.51   0.615    -.0216066    .0130782
           11 1974  |  -.1279346   .0551725    -2.32   0.030    -.2423554   -.0135138
           11 1975  |  -.0524363   .0140887    -3.72   0.001    -.0816544   -.0232181
           11 1976  |   .0021073   .0088152     0.24   0.813    -.0161744     .020389
           11 1977  |  -.0109054   .0450237    -0.24   0.811    -.1042788     .082468
           11 1978  |  -.0048368   .0165297    -0.29   0.773    -.0391173    .0294437
           11 1979  |  -.0333928   .0146571    -2.28   0.033    -.0637897   -.0029958
           11 1980  |  -.0059983   .0064477    -0.93   0.362      -.01937    .0073734
           11 1981  |   .0010441   .0066799     0.16   0.877    -.0128092    .0148974
           11 1982  |          0  (empty)
           12 1971  |   -.034093   .0226219    -1.51   0.146    -.0810081     .012822
           12 1972  |   .5958649   .4695889     1.27   0.218    -.3780029    1.569733
           12 1973  |          0  (omitted)
           12 1974  |  -.1204145    .051321    -2.35   0.028    -.2268477   -.0139813
           12 1975  |  -.0510451   .0162069    -3.15   0.005    -.0846561   -.0174341
           12 1976  |          0  (omitted)
           12 1977  |  -.0093168   .0461458    -0.20   0.842    -.1050174    .0863838
           12 1978  |  -.0102591   .0172431    -0.59   0.558    -.0460191    .0255009
           12 1979  |  -.0272268     .01497    -1.82   0.083    -.0582726     .003819
           12 1980  |          0  (omitted)
           12 1981  |          0  (omitted)
           12 1982  |          0  (empty)
                    |
              _cons |   .2784787   .1421421     1.96   0.063     -.016306    .5732634
--------------------+----------------------------------------------------------------
            sigma_u |  .05263033
            sigma_e |  .06762958
                rho |  .37718685   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------

. outreg2 using `table_results'/Table8.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark, Month FE, \checkmark, Year FE, \checkmark, Month $\times$ Year FE, \checkmark) keep(dint1_inf_a di
> nt2_inf_a) ///
> ctitle("1970 -- 1982") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table8.tex
dir : seeout

. 
. xtabond cv inf_a dtreated_1973 dperiod_1973 dint_1 dtreated_1973_inf_a dperiod_1973_inf_a dint1_inf_a m_* y_* ym_* if tin(1970m1, 1976m12)
note: inf_a dropped from div() because of collinearity
note: dtreated_1973 dropped from div() because of collinearity
note: dperiod_1973 dropped from div() because of collinearity
note: m_9 dropped from div() because of collinearity
note: y_1 dropped from div() because of collinearity
note: y_3 dropped from div() because of collinearity
note: y_8 dropped from div() because of collinearity
note: y_9 dropped from div() because of collinearity
note: y_10 dropped from div() because of collinearity
note: y_11 dropped from div() because of collinearity
note: y_12 dropped from div() because of collinearity
note: y_13 dropped from div() because of collinearity
note: ym_9 dropped from div() because of collinearity
note: ym_12 dropped from div() because of collinearity
note: ym_17 dropped from div() because of collinearity
note: ym_24 dropped from div() because of collinearity
note: ym_26 dropped from div() because of collinearity
note: ym_30 dropped from div() because of collinearity
note: ym_34 dropped from div() because of collinearity
note: ym_40 dropped from div() because of collinearity
note: ym_43 dropped from div() because of collinearity
note: ym_46 dropped from div() because of collinearity
note: ym_47 dropped from div() because of collinearity
note: ym_49 dropped from div() because of collinearity
note: ym_51 dropped from div() because of collinearity
note: ym_59 dropped from div() because of collinearity
note: ym_61 dropped from div() because of collinearity
note: ym_66 dropped from div() because of collinearity
note: ym_68 dropped from div() because of collinearity
note: ym_84 dropped from div() because of collinearity
note: ym_85 dropped from div() because of collinearity
note: ym_86 dropped from div() because of collinearity
note: ym_87 dropped from div() because of collinearity
note: ym_88 dropped from div() because of collinearity
note: ym_89 dropped from div() because of collinearity
note: ym_90 dropped from div() because of collinearity
note: ym_91 dropped from div() because of collinearity
note: ym_92 dropped from div() because of collinearity
note: ym_93 dropped from div() because of collinearity
note: ym_94 dropped from div() because of collinearity
note: ym_95 dropped from div() because of collinearity
note: ym_96 dropped from div() because of collinearity
note: ym_97 dropped from div() because of collinearity
note: ym_98 dropped from div() because of collinearity
note: ym_99 dropped from div() because of collinearity
note: ym_100 dropped from div() because of collinearity
note: ym_101 dropped from div() because of collinearity
note: ym_102 dropped from div() because of collinearity
note: ym_103 dropped from div() because of collinearity
note: ym_104 dropped from div() because of collinearity
note: ym_105 dropped from div() because of collinearity
note: ym_106 dropped from div() because of collinearity
note: ym_107 dropped from div() because of collinearity
note: ym_108 dropped from div() because of collinearity
note: ym_109 dropped from div() because of collinearity
note: ym_110 dropped from div() because of collinearity
note: ym_111 dropped from div() because of collinearity
note: ym_112 dropped from div() because of collinearity
note: ym_113 dropped from div() because of collinearity
note: ym_114 dropped from div() because of collinearity
note: ym_115 dropped from div() because of collinearity
note: ym_116 dropped from div() because of collinearity
note: ym_117 dropped from div() because of collinearity
note: ym_118 dropped from div() because of collinearity
note: ym_119 dropped from div() because of collinearity
note: ym_120 dropped from div() because of collinearity
note: ym_121 dropped from div() because of collinearity
note: ym_122 dropped from div() because of collinearity
note: ym_123 dropped from div() because of collinearity
note: ym_124 dropped from div() because of collinearity
note: ym_125 dropped from div() because of collinearity
note: ym_126 dropped from div() because of collinearity
note: ym_127 dropped from div() because of collinearity
note: ym_128 dropped from div() because of collinearity
note: ym_129 dropped from div() because of collinearity
note: ym_130 dropped from div() because of collinearity
note: ym_131 dropped from div() because of collinearity
note: ym_132 dropped from div() because of collinearity
note: ym_133 dropped from div() because of collinearity
note: ym_134 dropped from div() because of collinearity
note: ym_135 dropped from div() because of collinearity
note: ym_136 dropped from div() because of collinearity
note: ym_137 dropped from div() because of collinearity
note: ym_138 dropped from div() because of collinearity
note: ym_139 dropped from div() because of collinearity
note: ym_140 dropped from div() because of collinearity
note: ym_141 dropped from div() because of collinearity
note: ym_142 dropped from div() because of collinearity
note: ym_143 dropped from div() because of collinearity
note: ym_144 dropped from div() because of collinearity
note: ym_145 dropped from div() because of collinearity
note: ym_146 dropped from div() because of collinearity
note: ym_147 dropped from div() because of collinearity
note: ym_148 dropped from div() because of collinearity
note: ym_149 dropped from div() because of collinearity
note: dperiod_1973 dropped because of collinearity
note: m_10 dropped because of collinearity
note: y_5 dropped because of collinearity
note: y_8 dropped because of collinearity
note: y_9 dropped because of collinearity
note: y_10 dropped because of collinearity
note: y_11 dropped because of collinearity
note: y_12 dropped because of collinearity
note: y_13 dropped because of collinearity
note: ym_1 dropped because of collinearity
note: ym_6 dropped because of collinearity
note: ym_8 dropped because of collinearity
note: ym_19 dropped because of collinearity
note: ym_20 dropped because of collinearity
note: ym_25 dropped because of collinearity
note: ym_26 dropped because of collinearity
note: ym_30 dropped because of collinearity
note: ym_35 dropped because of collinearity
note: ym_39 dropped because of collinearity
note: ym_46 dropped because of collinearity
note: ym_48 dropped because of collinearity
note: ym_50 dropped because of collinearity
note: ym_52 dropped because of collinearity
note: ym_58 dropped because of collinearity
note: ym_60 dropped because of collinearity
note: ym_64 dropped because of collinearity
note: ym_65 dropped because of collinearity
note: ym_69 dropped because of collinearity
note: ym_75 dropped because of collinearity
note: ym_83 dropped because of collinearity
note: ym_85 dropped because of collinearity
note: ym_86 dropped because of collinearity
note: ym_87 dropped because of collinearity
note: ym_88 dropped because of collinearity
note: ym_89 dropped because of collinearity
note: ym_90 dropped because of collinearity
note: ym_91 dropped because of collinearity
note: ym_92 dropped because of collinearity
note: ym_93 dropped because of collinearity
note: ym_94 dropped because of collinearity
note: ym_95 dropped because of collinearity
note: ym_96 dropped because of collinearity
note: ym_97 dropped because of collinearity
note: ym_98 dropped because of collinearity
note: ym_99 dropped because of collinearity
note: ym_100 dropped because of collinearity
note: ym_101 dropped because of collinearity
note: ym_102 dropped because of collinearity
note: ym_103 dropped because of collinearity
note: ym_104 dropped because of collinearity
note: ym_105 dropped because of collinearity
note: ym_106 dropped because of collinearity
note: ym_107 dropped because of collinearity
note: ym_108 dropped because of collinearity
note: ym_109 dropped because of collinearity
note: ym_110 dropped because of collinearity
note: ym_111 dropped because of collinearity
note: ym_112 dropped because of collinearity
note: ym_113 dropped because of collinearity
note: ym_114 dropped because of collinearity
note: ym_115 dropped because of collinearity
note: ym_116 dropped because of collinearity
note: ym_117 dropped because of collinearity
note: ym_118 dropped because of collinearity
note: ym_119 dropped because of collinearity
note: ym_120 dropped because of collinearity
note: ym_121 dropped because of collinearity
note: ym_122 dropped because of collinearity
note: ym_123 dropped because of collinearity
note: ym_124 dropped because of collinearity
note: ym_125 dropped because of collinearity
note: ym_126 dropped because of collinearity
note: ym_127 dropped because of collinearity
note: ym_128 dropped because of collinearity
note: ym_129 dropped because of collinearity
note: ym_130 dropped because of collinearity
note: ym_131 dropped because of collinearity
note: ym_132 dropped because of collinearity
note: ym_133 dropped because of collinearity
note: ym_134 dropped because of collinearity
note: ym_135 dropped because of collinearity
note: ym_136 dropped because of collinearity
note: ym_137 dropped because of collinearity
note: ym_138 dropped because of collinearity
note: ym_139 dropped because of collinearity
note: ym_140 dropped because of collinearity
note: ym_141 dropped because of collinearity
note: ym_142 dropped because of collinearity
note: ym_143 dropped because of collinearity
note: ym_144 dropped because of collinearity
note: ym_145 dropped because of collinearity
note: ym_146 dropped because of collinearity
note: ym_147 dropped because of collinearity
note: ym_148 dropped because of collinearity
note: ym_149 dropped because of collinearity

Arellano-Bond dynamic panel-data estimation     Number of obs     =      1,886
Group variable: code                            Number of groups  =         23
Time variable: date
                                                Obs per group:
                                                              min =         82
                                                              avg =         82
                                                              max =         82

Number of instruments =   1.7e+03               Wald chi2(86)     =   29353.84
                                                Prob > chi2       =     0.0000
One-step results
-------------------------------------------------------------------------------------
                 cv |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
                 cv |
                L1. |   .9487059   .0079201   119.78   0.000     .9331827     .964229
                    |
              inf_a |   .0550729   .0065959     8.35   0.000     .0421451    .0680006
      dtreated_1973 |          0  (omitted)
             dint_1 |   .0311764   .0090706     3.44   0.001     .0133983    .0489546
dtreated_1973_inf_a |  -.0082974   .0028549    -2.91   0.004     -.013893   -.0027019
 dperiod_1973_inf_a |  -.0395242   .0052694    -7.50   0.000    -.0498521   -.0291963
        dint1_inf_a |  -.0109139   .0060278    -1.81   0.070    -.0227283    .0009004
                m_1 |   .0747843   .0093552     7.99   0.000     .0564486    .0931201
                m_2 |   .0713597   .0069341    10.29   0.000     .0577691    .0849503
                m_3 |   .0354005   .0061072     5.80   0.000     .0234306    .0473704
                m_4 |   .0967486   .0079052    12.24   0.000     .0812547    .1122424
                m_5 |   .1128861   .0107546    10.50   0.000     .0918076    .1339647
                m_6 |   .0589526   .0089885     6.56   0.000     .0413354    .0765698
                m_7 |   .0707946    .013442     5.27   0.000     .0444488    .0971404
                m_8 |   .0632567   .0114297     5.53   0.000      .040855    .0856584
                m_9 |   .1064099   .0105832    10.05   0.000     .0856672    .1271526
               m_11 |   .0457014   .0071985     6.35   0.000     .0315926    .0598102
               m_12 |   .0863561   .0072014    11.99   0.000     .0722416    .1004705
                y_1 |   .0294893   .0122033     2.42   0.016     .0055712    .0534074
                y_2 |   .0222368   .0143059     1.55   0.120    -.0058022    .0502758
                y_3 |   .0131383   .0094324     1.39   0.164    -.0053489    .0316256
                y_4 |   .0018685   .0066141     0.28   0.778    -.0110949     .014832
                y_6 |  -.0282935   .0077827    -3.64   0.000    -.0435473   -.0130397
                y_7 |   .0399924   .0073827     5.42   0.000     .0255227    .0544622
               ym_2 |  -.0081848   .0099464    -0.82   0.411    -.0276795    .0113099
               ym_3 |   .0248959   .0111623     2.23   0.026     .0030181    .0467736
               ym_4 |  -.0382183   .0121441    -3.15   0.002    -.0620204   -.0144163
               ym_5 |  -.0500824   .0141621    -3.54   0.000    -.0778396   -.0223252
               ym_7 |  -.0100796   .0100331    -1.00   0.315    -.0297441    .0095849
               ym_9 |  -.0459391   .0140091    -3.28   0.001    -.0733964   -.0184818
              ym_10 |   .0589353   .0113988     5.17   0.000     .0365941    .0812766
              ym_11 |   .0105074   .0103331     1.02   0.309    -.0097452    .0307599
              ym_12 |  -.0278507   .0113964    -2.44   0.015    -.0501873   -.0055142
              ym_13 |  -.0339601   .0124092    -2.74   0.006    -.0582818   -.0096384
              ym_14 |  -.0061401   .0122082    -0.50   0.615    -.0300677    .0177875
              ym_15 |   .0323923   .0132236     2.45   0.014     .0064745    .0583102
              ym_16 |  -.0313469    .014049    -2.23   0.026    -.0588824   -.0038113
              ym_17 |  -.0428188   .0158083    -2.71   0.007    -.0738024   -.0118351
              ym_18 |   .0128118   .0100359     1.28   0.202    -.0068582    .0324818
              ym_21 |  -.0398037   .0157307    -2.53   0.011    -.0706353   -.0089721
              ym_22 |   .0685547   .0134486     5.10   0.000     .0421959    .0949135
              ym_23 |    .026421   .0125243     2.11   0.035     .0018737    .0509682
              ym_24 |  -.0225191   .0134416    -1.68   0.094    -.0488641    .0038259
              ym_27 |   .0377788   .0087312     4.33   0.000      .020666    .0548915
              ym_28 |   -.030775   .0099246    -3.10   0.002     -.050227   -.0113231
              ym_29 |  -.0465634   .0122739    -3.79   0.000    -.0706197    -.022507
              ym_31 |  -.0088518   .0122885    -0.72   0.471    -.0329368    .0152332
              ym_32 |  -.0141048   .0101875    -1.38   0.166    -.0340718    .0058623
              ym_33 |   -.063403   .0119735    -5.30   0.000    -.0868706   -.0399354
              ym_34 |   .0569535   .0089549     6.36   0.000     .0394023    .0745047
              ym_36 |   -.061327   .0105589    -5.81   0.000    -.0820221    -.040632
              ym_37 |  -.0363548   .0102678    -3.54   0.000    -.0564793   -.0162303
              ym_38 |  -.0272378   .0090793    -3.00   0.003     -.045033   -.0094427
              ym_40 |   -.069388   .0104305    -6.65   0.000    -.0898315   -.0489446
              ym_41 |   -.079983   .0126558    -6.32   0.000     -.104788    -.055178
              ym_42 |  -.0364802   .0104519    -3.49   0.000    -.0569656   -.0159947
              ym_43 |  -.0506949    .014559    -3.48   0.000      -.07923   -.0221599
              ym_44 |  -.0393405   .0125997    -3.12   0.002    -.0640354   -.0146455
              ym_45 |   -.057827   .0124203    -4.66   0.000    -.0821703   -.0334837
              ym_47 |   .1442585    .011432    12.62   0.000     .1218522    .1666649
              ym_49 |  -.0101559   .0098749    -1.03   0.304    -.0295103    .0091985
              ym_51 |   .0688771   .0092202     7.47   0.000     .0508059    .0869483
              ym_53 |  -.0341335   .0100834    -3.39   0.001    -.0538966   -.0143704
              ym_54 |   .0023474   .0097012     0.24   0.809    -.0166666    .0213615
              ym_55 |   .0357326   .0138829     2.57   0.010     .0085226    .0629426
              ym_56 |   .0179215   .0119042     1.51   0.132    -.0054102    .0412533
              ym_57 |  -.0429145   .0101002    -4.25   0.000    -.0627105   -.0231185
              ym_59 |   .0313571   .0089048     3.52   0.000     .0139041    .0488101
              ym_61 |   .0252836   .0123017     2.06   0.040     .0011726    .0493946
              ym_62 |   .0313846    .009936     3.16   0.002     .0119104    .0508589
              ym_63 |   .0687138   .0113447     6.06   0.000     .0464786     .090949
              ym_66 |   .0391589   .0121976     3.21   0.001     .0152521    .0630658
              ym_67 |    .047026   .0157521     2.99   0.003     .0161525    .0778995
              ym_68 |   .0417444   .0140481     2.97   0.003     .0142107    .0692782
              ym_70 |   .1067904   .0104301    10.24   0.000     .0863478     .127233
              ym_71 |   .0558221   .0113994     4.90   0.000     .0334798    .0781645
              ym_72 |   .0211831   .0100548     2.11   0.035      .001476    .0408903
              ym_73 |   -.047845   .0102057    -4.69   0.000    -.0678477   -.0278422
              ym_74 |  -.0380338   .0087639    -4.34   0.000    -.0552108   -.0208568
              ym_76 |  -.0527143   .0103725    -5.08   0.000    -.0730441   -.0323845
              ym_77 |  -.0538886   .0127748    -4.22   0.000    -.0789268   -.0288505
              ym_78 |  -.0094762   .0096961    -0.98   0.328    -.0284802    .0095278
              ym_79 |  -.0290071   .0139231    -2.08   0.037    -.0562959   -.0017183
              ym_80 |  -.0110605   .0119966    -0.92   0.357    -.0345733    .0124523
              ym_81 |  -.0693521   .0127817    -5.43   0.000    -.0944037   -.0443005
              ym_82 |   .0376425   .0084922     4.43   0.000     .0209981     .054287
              ym_84 |  -.0482821   .0099905    -4.83   0.000    -.0678632    -.028701
              _cons |  -.0969745   .0103652    -9.36   0.000      -.11729    -.076659
-------------------------------------------------------------------------------------
Instruments for differenced equation
        GMM-type: L(2/.).cv
        Standard: D.dint_1 D.dtreated_1973_inf_a D.dperiod_1973_inf_a D.dint1_inf_a
                  D.m_1 D.m_2 D.m_3 D.m_4 D.m_5 D.m_6 D.m_7 D.m_8 D.m_10 D.m_11
                  D.m_12 D.y_2 D.y_4 D.y_5 D.y_6 D.y_7 D.ym_1 D.ym_2 D.ym_3 D.ym_4
                  D.ym_5 D.ym_6 D.ym_7 D.ym_8 D.ym_10 D.ym_11 D.ym_13 D.ym_14
                  D.ym_15 D.ym_16 D.ym_18 D.ym_19 D.ym_20 D.ym_21 D.ym_22 D.ym_23
                  D.ym_25 D.ym_27 D.ym_28 D.ym_29 D.ym_31 D.ym_32 D.ym_33 D.ym_35
                  D.ym_36 D.ym_37 D.ym_38 D.ym_39 D.ym_41 D.ym_42 D.ym_44 D.ym_45
                  D.ym_48 D.ym_50 D.ym_52 D.ym_53 D.ym_54 D.ym_55 D.ym_56 D.ym_57
                  D.ym_58 D.ym_60 D.ym_62 D.ym_63 D.ym_64 D.ym_65 D.ym_67 D.ym_69
                  D.ym_70 D.ym_71 D.ym_72 D.ym_73 D.ym_74 D.ym_75 D.ym_76 D.ym_77
                  D.ym_78 D.ym_79 D.ym_80 D.ym_81 D.ym_82 D.ym_83
Instruments for level equation
        Standard: _cons

. outreg2 using `table_results'/Table8.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark, Month FE, \checkmark, Year FE, \checkmark, Month $\times$ Year FE, \checkmark) keep(dint1_inf_a) /
> //
> ctitle("1970 -- 1976 (AB)") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table8.tex
dir : seeout

. 
. xtabond cv inf_a dtreated_1977 dperiod_1977 dint_2 dtreated_1977_inf_a dperiod_1977_inf_a dint2_inf_a m_* y_* ym_* if tin(1973m11, 1982m5)
note: dtreated_1977 dropped from div() because of collinearity
note: dperiod_1977 dropped from div() because of collinearity
note: m_8 dropped from div() because of collinearity
note: y_1 dropped from div() because of collinearity
note: y_2 dropped from div() because of collinearity
note: y_3 dropped from div() because of collinearity
note: y_4 dropped from div() because of collinearity
note: y_8 dropped from div() because of collinearity
note: y_13 dropped from div() because of collinearity
note: ym_1 dropped from div() because of collinearity
note: ym_2 dropped from div() because of collinearity
note: ym_3 dropped from div() because of collinearity
note: ym_4 dropped from div() because of collinearity
note: ym_5 dropped from div() because of collinearity
note: ym_6 dropped from div() because of collinearity
note: ym_7 dropped from div() because of collinearity
note: ym_8 dropped from div() because of collinearity
note: ym_9 dropped from div() because of collinearity
note: ym_10 dropped from div() because of collinearity
note: ym_11 dropped from div() because of collinearity
note: ym_12 dropped from div() because of collinearity
note: ym_13 dropped from div() because of collinearity
note: ym_14 dropped from div() because of collinearity
note: ym_15 dropped from div() because of collinearity
note: ym_16 dropped from div() because of collinearity
note: ym_17 dropped from div() because of collinearity
note: ym_18 dropped from div() because of collinearity
note: ym_19 dropped from div() because of collinearity
note: ym_20 dropped from div() because of collinearity
note: ym_21 dropped from div() because of collinearity
note: ym_22 dropped from div() because of collinearity
note: ym_23 dropped from div() because of collinearity
note: ym_24 dropped from div() because of collinearity
note: ym_25 dropped from div() because of collinearity
note: ym_26 dropped from div() because of collinearity
note: ym_27 dropped from div() because of collinearity
note: ym_28 dropped from div() because of collinearity
note: ym_29 dropped from div() because of collinearity
note: ym_30 dropped from div() because of collinearity
note: ym_31 dropped from div() because of collinearity
note: ym_32 dropped from div() because of collinearity
note: ym_33 dropped from div() because of collinearity
note: ym_34 dropped from div() because of collinearity
note: ym_35 dropped from div() because of collinearity
note: ym_36 dropped from div() because of collinearity
note: ym_37 dropped from div() because of collinearity
note: ym_38 dropped from div() because of collinearity
note: ym_39 dropped from div() because of collinearity
note: ym_40 dropped from div() because of collinearity
note: ym_41 dropped from div() because of collinearity
note: ym_42 dropped from div() because of collinearity
note: ym_43 dropped from div() because of collinearity
note: ym_44 dropped from div() because of collinearity
note: ym_45 dropped from div() because of collinearity
note: ym_46 dropped from div() because of collinearity
note: ym_54 dropped from div() because of collinearity
note: ym_59 dropped from div() because of collinearity
note: ym_62 dropped from div() because of collinearity
note: ym_66 dropped from div() because of collinearity
note: ym_77 dropped from div() because of collinearity
note: ym_84 dropped from div() because of collinearity
note: ym_86 dropped from div() because of collinearity
note: ym_93 dropped from div() because of collinearity
note: ym_104 dropped from div() because of collinearity
note: ym_108 dropped from div() because of collinearity
note: ym_109 dropped from div() because of collinearity
note: ym_112 dropped from div() because of collinearity
note: ym_120 dropped from div() because of collinearity
note: ym_121 dropped from div() because of collinearity
note: ym_127 dropped from div() because of collinearity
note: ym_130 dropped from div() because of collinearity
note: ym_133 dropped from div() because of collinearity
note: ym_143 dropped from div() because of collinearity
note: ym_147 dropped from div() because of collinearity
note: ym_149 dropped from div() because of collinearity
note: dperiod_1977 dropped because of collinearity
note: dperiod_1977_inf_a dropped because of collinearity
note: m_6 dropped because of collinearity
note: y_1 dropped because of collinearity
note: y_2 dropped because of collinearity
note: y_3 dropped because of collinearity
note: y_4 dropped because of collinearity
note: y_13 dropped because of collinearity
note: ym_1 dropped because of collinearity
note: ym_2 dropped because of collinearity
note: ym_3 dropped because of collinearity
note: ym_4 dropped because of collinearity
note: ym_5 dropped because of collinearity
note: ym_6 dropped because of collinearity
note: ym_7 dropped because of collinearity
note: ym_8 dropped because of collinearity
note: ym_9 dropped because of collinearity
note: ym_10 dropped because of collinearity
note: ym_11 dropped because of collinearity
note: ym_12 dropped because of collinearity
note: ym_13 dropped because of collinearity
note: ym_14 dropped because of collinearity
note: ym_15 dropped because of collinearity
note: ym_16 dropped because of collinearity
note: ym_17 dropped because of collinearity
note: ym_18 dropped because of collinearity
note: ym_19 dropped because of collinearity
note: ym_20 dropped because of collinearity
note: ym_21 dropped because of collinearity
note: ym_22 dropped because of collinearity
note: ym_23 dropped because of collinearity
note: ym_24 dropped because of collinearity
note: ym_25 dropped because of collinearity
note: ym_26 dropped because of collinearity
note: ym_27 dropped because of collinearity
note: ym_28 dropped because of collinearity
note: ym_29 dropped because of collinearity
note: ym_30 dropped because of collinearity
note: ym_31 dropped because of collinearity
note: ym_32 dropped because of collinearity
note: ym_33 dropped because of collinearity
note: ym_34 dropped because of collinearity
note: ym_35 dropped because of collinearity
note: ym_36 dropped because of collinearity
note: ym_37 dropped because of collinearity
note: ym_38 dropped because of collinearity
note: ym_39 dropped because of collinearity
note: ym_40 dropped because of collinearity
note: ym_41 dropped because of collinearity
note: ym_42 dropped because of collinearity
note: ym_43 dropped because of collinearity
note: ym_44 dropped because of collinearity
note: ym_45 dropped because of collinearity
note: ym_46 dropped because of collinearity
note: ym_47 dropped because of collinearity
note: ym_48 dropped because of collinearity
note: ym_52 dropped because of collinearity
note: ym_58 dropped because of collinearity
note: ym_62 dropped because of collinearity
note: ym_68 dropped because of collinearity
note: ym_73 dropped because of collinearity
note: ym_91 dropped because of collinearity
note: ym_95 dropped because of collinearity
note: ym_98 dropped because of collinearity
note: ym_103 dropped because of collinearity
note: ym_111 dropped because of collinearity
note: ym_114 dropped because of collinearity
note: ym_116 dropped because of collinearity
note: ym_126 dropped because of collinearity
note: ym_129 dropped because of collinearity
note: ym_133 dropped because of collinearity
note: ym_141 dropped because of collinearity
note: ym_142 dropped because of collinearity
note: ym_148 dropped because of collinearity
note: ym_149 dropped because of collinearity

Arellano-Bond dynamic panel-data estimation     Number of obs     =      2,369
Group variable: code                            Number of groups  =         23
Time variable: date
                                                Obs per group:
                                                              min =        103
                                                              avg =        103
                                                              max =        103

Number of instruments =   2.4e+03               Wald chi2(106)    =   46604.70
                                                Prob > chi2       =     0.0000
One-step results
-------------------------------------------------------------------------------------
                 cv |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
                 cv |
                L1. |   .9299499   .0062981   147.66   0.000     .9176058    .9422939
                    |
              inf_a |   .0384666   .0034431    11.17   0.000     .0317181     .045215
      dtreated_1977 |          0  (omitted)
             dint_2 |   .0426984   .0079153     5.39   0.000     .0271848    .0582121
dtreated_1977_inf_a |   .0274406   .0046736     5.87   0.000     .0182804    .0366008
        dint2_inf_a |  -.0197663   .0067749    -2.92   0.004    -.0330449   -.0064877
                m_1 |  -.0252427   .0082733    -3.05   0.002     -.041458   -.0090274
                m_2 |    .032284   .0076254     4.23   0.000     .0173385    .0472294
                m_3 |   .0081611   .0062741     1.30   0.193     -.004136    .0204582
                m_4 |   .0407422      .0092     4.43   0.000     .0227106    .0587738
                m_5 |   .0427997   .0108645     3.94   0.000     .0215057    .0640936
                m_7 |   .0509733   .0083186     6.13   0.000     .0346692    .0672774
                m_8 |   .0143951   .0059228     2.43   0.015     .0027867    .0260036
                m_9 |  -.0123783   .0059381    -2.08   0.037    -.0240166   -.0007399
               m_10 |  -.0264745    .007693    -3.44   0.001    -.0415526   -.0113964
               m_11 |   .0738814   .0082872     8.92   0.000     .0576389     .090124
               m_12 |  -.0173961   .0092086    -1.89   0.059    -.0354446    .0006524
                y_5 |  -.0581874    .005207   -11.17   0.000    -.0683929   -.0479819
                y_6 |  -.0375277   .0084065    -4.46   0.000    -.0540042   -.0210513
                y_7 |   .0057396   .0085199     0.67   0.501     -.010959    .0224382
                y_8 |  -.0502208   .0073158    -6.86   0.000    -.0645596   -.0358821
                y_9 |  -.0172838   .0090475    -1.91   0.056    -.0350166    .0004491
               y_10 |   .0215242   .0097378     2.21   0.027     .0024386    .0406099
               y_11 |   .0395767   .0087923     4.50   0.000     .0223442    .0568093
               y_12 |   .0574707   .0072336     7.94   0.000     .0432931    .0716483
              ym_49 |   .0412408     .00874     4.72   0.000     .0241108    .0583708
              ym_50 |  -.0170758   .0101093    -1.69   0.091    -.0368896     .002738
              ym_51 |   .0368852   .0109521     3.37   0.001     .0154195    .0583509
              ym_53 |  -.0156377   .0088917    -1.76   0.079    -.0330652    .0017898
              ym_54 |   .0092139   .0096617     0.95   0.340    -.0097227    .0281505
              ym_55 |   .0052139   .0094269     0.55   0.580    -.0132626    .0236903
              ym_56 |   .0185101   .0102772     1.80   0.072    -.0016327    .0386529
              ym_57 |   .0293908   .0084223     3.49   0.000     .0128834    .0458983
              ym_59 |  -.0258981   .0085761    -3.02   0.003     -.042707   -.0090893
              ym_60 |   .0727512   .0087747     8.29   0.000     .0555531    .0899493
              ym_61 |   .0455376   .0105179     4.33   0.000      .024923    .0661522
              ym_63 |   .0169493   .0086995     1.95   0.051    -.0001013    .0339999
              ym_64 |  -.0276718   .0108716    -2.55   0.011    -.0489798   -.0063637
              ym_65 |  -.0168155   .0124633    -1.35   0.177    -.0412431    .0076121
              ym_66 |   .0130738   .0082985     1.58   0.115     -.003191    .0293386
              ym_67 |  -.0177703   .0082702    -2.15   0.032    -.0339795   -.0015611
              ym_69 |   .0358799   .0093226     3.85   0.000     .0176079    .0541519
              ym_70 |   .0543586   .0096326     5.64   0.000     .0354791    .0732381
              ym_71 |  -.0513524   .0092463    -5.55   0.000    -.0694748   -.0332301
              ym_72 |   .0469247   .0105162     4.46   0.000     .0263132    .0675361
              ym_74 |  -.0494843   .0115109    -4.30   0.000    -.0720453   -.0269233
              ym_75 |  -.0226874   .0118425    -1.92   0.055    -.0458982    .0005234
              ym_76 |  -.0426214   .0103055    -4.14   0.000    -.0628199   -.0224229
              ym_77 |  -.0260173   .0116285    -2.24   0.025    -.0488087   -.0032259
              ym_78 |   .0102878   .0105445     0.98   0.329     -.010379    .0309546
              ym_79 |  -.0500806   .0113007    -4.43   0.000    -.0722297   -.0279316
              ym_80 |  -.0011899   .0113937    -0.10   0.917    -.0235211    .0211413
              ym_81 |   .0120372   .0090149     1.34   0.182    -.0056316    .0297061
              ym_82 |   .0267647   .0089822     2.98   0.003       .00916    .0443694
              ym_83 |  -.0627632   .0105872    -5.93   0.000    -.0835138   -.0420126
              ym_84 |   .0206943   .0108902     1.90   0.057      -.00065    .0420387
              ym_85 |   .0786805   .0100922     7.80   0.000     .0589001    .0984609
              ym_86 |   .0270505   .0083449     3.24   0.001     .0106948    .0434063
              ym_87 |   .0484104   .0105525     4.59   0.000     .0277279    .0690929
              ym_88 |   .0266103   .0096571     2.76   0.006     .0076828    .0455378
              ym_89 |   .0143741   .0112029     1.28   0.199    -.0075832    .0363314
              ym_90 |   .0392885   .0095623     4.11   0.000     .0205467    .0580304
              ym_92 |   .0601416   .0092385     6.51   0.000     .0420345    .0782486
              ym_93 |   .0765413    .009226     8.30   0.000     .0584586    .0946239
              ym_94 |   .0897405    .008228    10.91   0.000     .0736138    .1058671
              ym_96 |    .084228   .0087377     9.64   0.000     .0671025    .1013536
              ym_97 |   .0675498   .0105204     6.42   0.000     .0469302    .0881694
              ym_99 |   .0305934   .0099365     3.08   0.002     .0111182    .0500686
             ym_100 |  -.0044731   .0103107    -0.43   0.664    -.0246817    .0157354
             ym_101 |    .005447   .0117019     0.47   0.642    -.0174883    .0283823
             ym_102 |   .0457619   .0092407     4.95   0.000     .0276504    .0638734
             ym_104 |   .0268975   .0082671     3.25   0.001     .0106942    .0431008
             ym_105 |   .0590088   .0095485     6.18   0.000     .0402941    .0777235
             ym_106 |    .073995    .009237     8.01   0.000     .0558908    .0920992
             ym_107 |  -.0233948   .0082802    -2.83   0.005    -.0396236    -.007166
             ym_108 |   .0566691   .0099752     5.68   0.000      .037118    .0762202
             ym_109 |   .0408006   .0099598     4.10   0.000     .0212798    .0603215
             ym_110 |  -.0221073   .0082662    -2.67   0.007    -.0383088   -.0059058
             ym_112 |  -.0320973   .0105818    -3.03   0.002    -.0528372   -.0113574
             ym_113 |  -.0349059   .0120718    -2.89   0.004    -.0585661   -.0112456
             ym_115 |  -.0429436     .00924    -4.65   0.000    -.0610538   -.0248335
             ym_117 |   .0196288   .0083094     2.36   0.018     .0033427     .035915
             ym_118 |   .0409994   .0093498     4.39   0.000     .0226743    .0593246
             ym_119 |  -.0651432    .009522    -6.84   0.000     -.083806   -.0464805
             ym_120 |   .0292721   .0104775     2.79   0.005     .0087366    .0498076
             ym_121 |   .0097777   .0087017     1.12   0.261    -.0072773    .0268328
             ym_122 |  -.0421297   .0092636    -4.55   0.000     -.060286   -.0239734
             ym_123 |  -.0179165   .0087081    -2.06   0.040     -.034984    -.000849
             ym_124 |  -.0475648   .0097594    -4.87   0.000    -.0666929   -.0284366
             ym_125 |  -.0517415   .0113329    -4.57   0.000    -.0739536   -.0295294
             ym_127 |  -.0584683   .0095397    -6.13   0.000    -.0771658   -.0397709
             ym_128 |  -.0214963   .0083017    -2.59   0.010    -.0377673   -.0052253
             ym_130 |   .0209637   .0082943     2.53   0.011     .0047073    .0372202
             ym_131 |  -.0802512   .0092096    -8.71   0.000    -.0983017   -.0622008
             ym_132 |   .0143477   .0098968     1.45   0.147    -.0050498    .0337451
             ym_134 |  -.0548285   .0095669    -5.73   0.000    -.0735794   -.0360777
             ym_135 |  -.0274627   .0099655    -2.76   0.006    -.0469947   -.0079308
             ym_136 |  -.0648217   .0081646    -7.94   0.000     -.080824   -.0488194
             ym_137 |  -.0639968   .0099496    -6.43   0.000    -.0834976    -.044496
             ym_138 |  -.0200903   .0082915    -2.42   0.015    -.0363414   -.0038392
             ym_139 |  -.0706683    .009235    -7.65   0.000    -.0887685    -.052568
             ym_140 |  -.0347762   .0093231    -3.73   0.000    -.0530491   -.0165032
             ym_143 |  -.0924827   .0082403   -11.22   0.000    -.1086334   -.0763319
             ym_144 |  -.0044843   .0086779    -0.52   0.605    -.0214926     .012524
             ym_145 |   .0668839   .0099729     6.71   0.000     .0473373    .0864305
             ym_146 |   .0114971   .0111509     1.03   0.303    -.0103582    .0333525
             ym_147 |   .0308147   .0120323     2.56   0.010     .0072318    .0543976
              _cons |  -.0574164   .0101776    -5.64   0.000    -.0773643   -.0374686
-------------------------------------------------------------------------------------
Instruments for differenced equation
        GMM-type: L(2/.).cv
        Standard: D.inf_a D.dint_2 D.dtreated_1977_inf_a D.dperiod_1977_inf_a
                  D.dint2_inf_a D.m_1 D.m_2 D.m_3 D.m_4 D.m_5 D.m_6 D.m_7 D.m_9
                  D.m_10 D.m_11 D.m_12 D.y_5 D.y_6 D.y_7 D.y_9 D.y_10 D.y_11 D.y_12
                  D.ym_47 D.ym_48 D.ym_49 D.ym_50 D.ym_51 D.ym_52 D.ym_53 D.ym_55
                  D.ym_56 D.ym_57 D.ym_58 D.ym_60 D.ym_61 D.ym_63 D.ym_64 D.ym_65
                  D.ym_67 D.ym_68 D.ym_69 D.ym_70 D.ym_71 D.ym_72 D.ym_73 D.ym_74
                  D.ym_75 D.ym_76 D.ym_78 D.ym_79 D.ym_80 D.ym_81 D.ym_82 D.ym_83
                  D.ym_85 D.ym_87 D.ym_88 D.ym_89 D.ym_90 D.ym_91 D.ym_92 D.ym_94
                  D.ym_95 D.ym_96 D.ym_97 D.ym_98 D.ym_99 D.ym_100 D.ym_101
                  D.ym_102 D.ym_103 D.ym_105 D.ym_106 D.ym_107 D.ym_110 D.ym_111
                  D.ym_113 D.ym_114 D.ym_115 D.ym_116 D.ym_117 D.ym_118 D.ym_119
                  D.ym_122 D.ym_123 D.ym_124 D.ym_125 D.ym_126 D.ym_128 D.ym_129
                  D.ym_131 D.ym_132 D.ym_134 D.ym_135 D.ym_136 D.ym_137 D.ym_138
                  D.ym_139 D.ym_140 D.ym_141 D.ym_142 D.ym_144 D.ym_145 D.ym_146
                  D.ym_148
Instruments for level equation
        Standard: _cons

. outreg2 using `table_results'/Table8.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark, Month FE, \checkmark, Year FE, \checkmark, Month $\times$ Year FE, \checkmark) keep(dint2_inf_a) /
> //
> ctitle("1973 -- 1982 (AB)") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table8.tex
dir : seeout

. 
. 
. xtabond cv inf_a dtreated_1977 dperiod_1977 dint_2 dtreated_1977_inf_a dperiod_1977_inf_a dint2_inf_a  dtreated_1973 dperiod_1973 dint_1 dtreated_
> 1973_inf_a dperiod_1973_inf_a dint1_inf_a m_* y_* ym_* if tin(1970m1, 1982m5)
note: inf_a dropped from div() because of collinearity
note: dtreated_1977 dropped from div() because of collinearity
note: dperiod_1977 dropped from div() because of collinearity
note: dperiod_1977_inf_a dropped from div() because of collinearity
note: dtreated_1973 dropped from div() because of collinearity
note: dperiod_1973 dropped from div() because of collinearity
note: m_9 dropped from div() because of collinearity
note: y_1 dropped from div() because of collinearity
note: y_5 dropped from div() because of collinearity
note: y_7 dropped from div() because of collinearity
note: y_10 dropped from div() because of collinearity
note: y_13 dropped from div() because of collinearity
note: ym_8 dropped from div() because of collinearity
note: ym_12 dropped from div() because of collinearity
note: ym_13 dropped from div() because of collinearity
note: ym_25 dropped from div() because of collinearity
note: ym_36 dropped from div() because of collinearity
note: ym_40 dropped from div() because of collinearity
note: ym_46 dropped from div() because of collinearity
note: ym_47 dropped from div() because of collinearity
note: ym_49 dropped from div() because of collinearity
note: ym_57 dropped from div() because of collinearity
note: ym_66 dropped from div() because of collinearity
note: ym_71 dropped from div() because of collinearity
note: ym_82 dropped from div() because of collinearity
note: ym_85 dropped from div() because of collinearity
note: ym_103 dropped from div() because of collinearity
note: ym_106 dropped from div() because of collinearity
note: ym_110 dropped from div() because of collinearity
note: ym_114 dropped from div() because of collinearity
note: ym_123 dropped from div() because of collinearity
note: ym_125 dropped from div() because of collinearity
note: ym_133 dropped from div() because of collinearity
note: ym_149 dropped from div() because of collinearity
note: dtreated_1977_inf_a dropped because of collinearity
note: dperiod_1977_inf_a dropped because of collinearity
note: dtreated_1973 dropped because of collinearity
note: dperiod_1973 dropped because of collinearity
note: m_1 dropped because of collinearity
note: y_2 dropped because of collinearity
note: y_8 dropped because of collinearity
note: ym_1 dropped because of collinearity
note: ym_4 dropped because of collinearity
note: ym_10 dropped because of collinearity
note: ym_13 dropped because of collinearity
note: ym_18 dropped because of collinearity
note: ym_20 dropped because of collinearity
note: ym_26 dropped because of collinearity
note: ym_36 dropped because of collinearity
note: ym_39 dropped because of collinearity
note: ym_46 dropped because of collinearity
note: ym_47 dropped because of collinearity
note: ym_48 dropped because of collinearity
note: ym_51 dropped because of collinearity
note: ym_59 dropped because of collinearity
note: ym_65 dropped because of collinearity
note: ym_81 dropped because of collinearity
note: ym_83 dropped because of collinearity
note: ym_86 dropped because of collinearity
note: ym_94 dropped because of collinearity
note: ym_98 dropped because of collinearity
note: ym_113 dropped because of collinearity
note: ym_116 dropped because of collinearity
note: ym_124 dropped because of collinearity
note: ym_126 dropped because of collinearity
note: ym_139 dropped because of collinearity
note: ym_141 dropped because of collinearity
note: ym_145 dropped because of collinearity

Arellano-Bond dynamic panel-data estimation     Number of obs     =      3,381
Group variable: code                            Number of groups  =         23
Time variable: date
                                                Obs per group:
                                                              min =        147
                                                              avg =        147
                                                              max =        147

Number of instruments =   3.2e+03               Wald chi2(153)    =   55366.14
                                                Prob > chi2       =     0.0000
One-step results
-------------------------------------------------------------------------------------
                 cv |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
                 cv |
                L1. |   .9313231   .0055944   166.47   0.000     .9203582     .942288
                    |
              inf_a |   .0496851   .0058274     8.53   0.000     .0382635    .0611067
      dtreated_1977 |          0  (omitted)
       dperiod_1977 |  -.0757947   .0124976    -6.06   0.000    -.1002897   -.0512998
             dint_2 |   .0369627   .0078787     4.69   0.000     .0215208    .0524047
        dint2_inf_a |  -.0158393   .0067243    -2.36   0.018    -.0290187     -.00266
             dint_1 |   .0362758   .0079305     4.57   0.000     .0207322    .0518193
dtreated_1973_inf_a |  -.0090755   .0025261    -3.59   0.000    -.0140265   -.0041245
 dperiod_1973_inf_a |   .0319497   .0035083     9.11   0.000     .0250736    .0388259
        dint1_inf_a |  -.0141335   .0052765    -2.68   0.007    -.0244753   -.0037916
                m_2 |   .0197436   .0125459     1.57   0.116     -.004846    .0443333
                m_3 |   .0611902   .0124405     4.92   0.000     .0368073    .0855731
                m_4 |     .03015   .0089107     3.38   0.001     .0126854    .0476146
                m_5 |   .0222995   .0089164     2.50   0.012     .0048237    .0397754
                m_6 |   .0300337   .0063046     4.76   0.000      .017677    .0423904
                m_7 |   .0635168   .0156903     4.05   0.000     .0327644    .0942693
                m_8 |   .0214516   .0063101     3.40   0.001     .0090841    .0338192
                m_9 |   .0641705   .0143669     4.47   0.000      .036012    .0923291
               m_10 |   .0308419   .0109092     2.83   0.005     .0094602    .0522236
               m_11 |   .0768309   .0129117     5.95   0.000     .0515244    .1021373
               m_12 |  -.0204514    .012785    -1.60   0.110    -.0455096    .0046068
                y_1 |  -.0050723   .0089149    -0.57   0.569    -.0225451    .0124006
                y_3 |   .0016177     .01264     0.13   0.898    -.0231562    .0263916
                y_4 |  -.0804306   .0138337    -5.81   0.000     -.107544   -.0533171
                y_5 |   -.162227   .0148386   -10.93   0.000      -.19131   -.1331439
                y_6 |  -.1122673   .0121204    -9.26   0.000    -.1360229   -.0885117
                y_7 |  -.1276076   .0137981    -9.25   0.000    -.1546513   -.1005639
                y_9 |   .0223623   .0066465     3.36   0.001     .0093354    .0353892
               y_10 |   .0317392   .0128017     2.48   0.013     .0066484      .05683
               y_11 |   .0265882   .0092105     2.89   0.004      .008536    .0446405
               y_12 |   .0012753   .0111174     0.11   0.909    -.0205144    .0230649
               y_13 |   .0705423   .0132548     5.32   0.000     .0445635    .0965212
               ym_2 |   .0150004    .008794     1.71   0.088    -.0022355    .0322362
               ym_3 |  -.0292435   .0086514    -3.38   0.001    -.0461999   -.0122871
               ym_5 |   .0120657   .0125967     0.96   0.338    -.0126233    .0367547
               ym_6 |    .000502   .0089059     0.06   0.955    -.0169531    .0179572
               ym_7 |  -.0312055   .0128739    -2.42   0.015    -.0564379    -.005973
               ym_8 |   .0134668   .0109095     1.23   0.217    -.0079154     .034849
               ym_9 |  -.0318504   .0112538    -2.83   0.005    -.0539073   -.0097934
              ym_11 |  -.0487221   .0093284    -5.22   0.000    -.0670054   -.0304387
              ym_12 |   .0507945   .0091657     5.54   0.000       .03283     .068759
              ym_14 |    .003922   .0125133     0.31   0.754    -.0206036    .0284475
              ym_15 |  -.0351456   .0123998    -2.83   0.005    -.0594487   -.0108424
              ym_16 |  -.0065157   .0089068    -0.73   0.464    -.0239727    .0109413
              ym_17 |   .0059885   .0089075     0.67   0.501      -.01147    .0234469
              ym_19 |  -.0344855   .0156488    -2.20   0.028    -.0651566   -.0038143
              ym_21 |  -.0395574   .0143046    -2.77   0.006     -.067594   -.0115209
              ym_22 |  -.0042602   .0109126    -0.39   0.696    -.0256486    .0171282
              ym_23 |  -.0465355   .0128714    -3.62   0.000    -.0717629    -.021308
              ym_24 |   .0427522   .0127892     3.34   0.001     .0176859    .0678185
              ym_25 |   .0227199    .014038     1.62   0.106    -.0047941    .0502338
              ym_27 |  -.0394472   .0083546    -4.72   0.000     -.055822   -.0230724
              ym_28 |  -.0152405   .0105041    -1.45   0.147    -.0358282    .0053471
              ym_29 |  -.0068921   .0150921    -0.46   0.648     -.036472    .0226878
              ym_30 |  -.0219204   .0122014    -1.80   0.072    -.0458347    .0019938
              ym_31 |  -.0521795   .0118974    -4.39   0.000    -.0754981    -.028861
              ym_32 |  -.0215282   .0134814    -1.60   0.110    -.0479512    .0048948
              ym_33 |   -.069064   .0102823    -6.72   0.000    -.0892168   -.0489111
              ym_34 |  -.0208265   .0078929    -2.64   0.008    -.0362964   -.0053567
              ym_35 |  -.0773361   .0086028    -8.99   0.000    -.0941973   -.0604748
              ym_37 |   .0640457   .0127416     5.03   0.000     .0390727    .0890187
              ym_38 |   .0498781   .0078861     6.32   0.000     .0344217    .0653345
              ym_40 |   .0233825   .0089735     2.61   0.009     .0057947    .0409702
              ym_41 |   .0375199   .0140202     2.68   0.007     .0100409     .064999
              ym_42 |   .0204443   .0107903     1.89   0.058    -.0007043    .0415929
              ym_43 |  -.0147673   .0116991    -1.26   0.207    -.0376971    .0081625
              ym_44 |   .0306313   .0124923     2.45   0.014     .0061468    .0551157
              ym_45 |   .0121575   .0096671     1.26   0.209    -.0067897    .0311047
              ym_49 |   .0360528   .0135752     2.66   0.008     .0094458    .0626597
              ym_50 |    .012721   .0084313     1.51   0.131     -.003804     .029246
              ym_52 |   .0270112   .0103056     2.62   0.009     .0068126    .0472099
              ym_53 |   .0237339    .014963     1.59   0.113     -.005593    .0530608
              ym_54 |  -.0020878     .01203    -0.17   0.862    -.0256662    .0214906
              ym_55 |   .0123019   .0107471     1.14   0.252    -.0087621    .0333659
              ym_56 |   .0317048   .0135386     2.34   0.019     .0051697      .05824
              ym_57 |  -.0261616   .0087135    -3.00   0.003    -.0432398   -.0090835
              ym_58 |  -.0273837   .0083398    -3.28   0.001    -.0437293    -.011038
              ym_60 |    .103931   .0086492    12.02   0.000     .0869789    .1208831
              ym_61 |   .0191457   .0109635     1.75   0.081    -.0023423    .0406338
              ym_62 |    .005268   .0154215     0.34   0.733    -.0249577    .0354936
              ym_63 |  -.0367788    .015297    -2.40   0.016    -.0667605   -.0067972
              ym_64 |  -.0195881   .0126083    -1.55   0.120    -.0442998    .0051237
              ym_66 |  -.0199536   .0109145    -1.83   0.068    -.0413456    .0014384
              ym_67 |   -.033055   .0180177    -1.83   0.067     -.068369     .002259
              ym_68 |  -.0023626   .0089173    -0.26   0.791    -.0198401    .0151149
              ym_69 |  -.0427969   .0168851    -2.53   0.011    -.0758911   -.0097027
              ym_70 |  -.0034855   .0141402    -0.25   0.805    -.0311998    .0242288
              ym_71 |  -.0548512    .015676    -3.50   0.000    -.0855756   -.0241268
              ym_72 |   .0498798   .0158079     3.16   0.002     .0188968    .0808628
              ym_73 |   .0335897   .0144992     2.32   0.021     .0051719    .0620076
              ym_74 |    .022658   .0094198     2.41   0.016     .0041956    .0411204
              ym_75 |  -.0158243   .0082871    -1.91   0.056    -.0320668    .0004182
              ym_76 |   .0294864      .0113     2.61   0.009     .0073389    .0516339
              ym_77 |   .0574228   .0156744     3.66   0.000     .0267014    .0881441
              ym_78 |   .0442258   .0128817     3.43   0.001     .0189781    .0694735
              ym_79 |    .000598     .00891     0.07   0.946    -.0168652    .0180612
              ym_80 |   .0557271   .0143217     3.89   0.000      .027657    .0837971
              ym_82 |   .0340244   .0093339     3.65   0.000     .0157304    .0523185
              ym_84 |   .0893545   .0088157    10.14   0.000      .072076     .106633
              ym_85 |    .012835   .0127136     1.01   0.313    -.0120832    .0377532
              ym_87 |  -.0430379   .0079131    -5.44   0.000    -.0585473   -.0275286
              ym_88 |   -.000566   .0089185    -0.06   0.949    -.0180459     .016914
              ym_89 |  -.0020516   .0140735    -0.15   0.884    -.0296352    .0255319
              ym_90 |  -.0262615   .0108729    -2.42   0.016    -.0475719    -.004951
              ym_91 |  -.0393157   .0121273    -3.24   0.001    -.0630848   -.0155466
              ym_92 |   .0194414   .0125452     1.55   0.121    -.0051468    .0440296
              ym_93 |  -.0330237   .0103743    -3.18   0.001    -.0533569   -.0126904
              ym_95 |   -.042357   .0082292    -5.15   0.000    -.0584859   -.0262282
              ym_96 |   .0554455   .0080695     6.87   0.000     .0396296    .0712613
              ym_97 |   .0220687     .01405     1.57   0.116    -.0054689    .0496062
              ym_99 |  -.0409604   .0092954    -4.41   0.000    -.0591791   -.0227417
             ym_100 |  -.0117136   .0107788    -1.09   0.277    -.0328396    .0094124
             ym_101 |   .0085406    .015314     0.56   0.577    -.0214744    .0385556
             ym_102 |  -.0014023   .0124788    -0.11   0.911    -.0258603    .0230557
             ym_103 |  -.0364563   .0128726    -2.83   0.005     -.061686   -.0112265
             ym_104 |   .0031364   .0139542     0.22   0.822    -.0242133    .0304861
             ym_105 |  -.0342079   .0112209    -3.05   0.002    -.0562004   -.0122154
             ym_106 |   .0006972   .0087985     0.08   0.937    -.0165476     .017942
             ym_107 |  -.0420456   .0092772    -4.53   0.000    -.0602285   -.0238627
             ym_108 |   .0443217   .0088328     5.02   0.000     .0270098    .0616336
             ym_109 |   .0294967    .008913     3.31   0.001     .0120276    .0469659
             ym_110 |    .004642   .0139936     0.33   0.740    -.0227849    .0320689
             ym_111 |  -.0388025   .0139068    -2.79   0.005    -.0660594   -.0115456
             ym_112 |  -.0070089   .0109107    -0.64   0.521    -.0283935    .0143758
             ym_114 |  -.0085657   .0089079    -0.96   0.336    -.0260248    .0088933
             ym_115 |  -.0410364   .0168675    -2.43   0.015     -.074096   -.0079768
             ym_117 |  -.0428244   .0156361    -2.74   0.006    -.0734706   -.0121782
             ym_118 |  -.0024135   .0125987    -0.19   0.848    -.0271065    .0222795
             ym_119 |  -.0544276   .0143025    -3.81   0.000    -.0824601   -.0263951
             ym_120 |   .0461257   .0142388     3.24   0.001     .0182182    .0740333
             ym_121 |   .0215517     .00891     2.42   0.016     .0040884     .039015
             ym_122 |   .0073967   .0108132     0.68   0.494    -.0137969    .0285903
             ym_123 |  -.0339846   .0106956    -3.18   0.001    -.0549476   -.0130215
             ym_125 |   .0057666   .0109098     0.53   0.597    -.0156161    .0271493
             ym_127 |  -.0335848   .0143402    -2.34   0.019    -.0616911   -.0054785
             ym_128 |   .0093571   .0089082     1.05   0.294    -.0081026    .0268169
             ym_129 |  -.0312042   .0128918    -2.42   0.016    -.0564717   -.0059368
             ym_130 |   .0018056   .0089202     0.20   0.840    -.0156777    .0192889
             ym_131 |   -.045138   .0112294    -4.02   0.000    -.0671471   -.0231288
             ym_132 |   .0555225   .0111985     4.96   0.000     .0335739    .0774712
             ym_133 |   .0561765   .0157197     3.57   0.000     .0253665    .0869865
             ym_134 |   .0394305   .0112176     3.52   0.000     .0174444    .0614165
             ym_135 |   .0016421   .0102619     0.16   0.873    -.0184709     .021755
             ym_136 |   .0281555     .01289     2.18   0.029     .0028916    .0534195
             ym_137 |   .0390846   .0168784     2.32   0.021     .0060035    .0721657
             ym_138 |   .0328134   .0143396     2.29   0.022     .0047084    .0609184
             ym_140 |   .0415697     .01564     2.66   0.008     .0109159    .0722236
             ym_142 |   .0339209   .0112548     3.01   0.003     .0118618      .05598
             ym_143 |  -.0108046   .0089071    -1.21   0.225    -.0282622     .006653
             ym_144 |   .0834777   .0108404     7.70   0.000     .0622309    .1047246
             ym_146 |  -.0173867   .0140418    -1.24   0.216    -.0449081    .0101347
             ym_147 |   -.063571   .0139448    -4.56   0.000    -.0909023   -.0362397
             ym_148 |  -.0299174   .0109113    -2.74   0.006    -.0513031   -.0085317
             ym_149 |  -.0202302   .0109121    -1.85   0.064    -.0416176    .0011571
              _cons |  -.0303334   .0046986    -6.46   0.000    -.0395425   -.0211242
-------------------------------------------------------------------------------------
Instruments for differenced equation
        GMM-type: L(2/.).cv
        Standard: D.dint_2 D.dtreated_1977_inf_a D.dint2_inf_a D.dint_1
                  D.dtreated_1973_inf_a D.dperiod_1973_inf_a D.dint1_inf_a D.m_1
                  D.m_2 D.m_3 D.m_4 D.m_5 D.m_6 D.m_7 D.m_8 D.m_10 D.m_11 D.m_12
                  D.y_2 D.y_3 D.y_4 D.y_6 D.y_8 D.y_9 D.y_11 D.y_12 D.ym_1 D.ym_2
                  D.ym_3 D.ym_4 D.ym_5 D.ym_6 D.ym_7 D.ym_9 D.ym_10 D.ym_11 D.ym_14
                  D.ym_15 D.ym_16 D.ym_17 D.ym_18 D.ym_19 D.ym_20 D.ym_21 D.ym_22
                  D.ym_23 D.ym_24 D.ym_26 D.ym_27 D.ym_28 D.ym_29 D.ym_30 D.ym_31
                  D.ym_32 D.ym_33 D.ym_34 D.ym_35 D.ym_37 D.ym_38 D.ym_39 D.ym_41
                  D.ym_42 D.ym_43 D.ym_44 D.ym_45 D.ym_48 D.ym_50 D.ym_51 D.ym_52
                  D.ym_53 D.ym_54 D.ym_55 D.ym_56 D.ym_58 D.ym_59 D.ym_60 D.ym_61
                  D.ym_62 D.ym_63 D.ym_64 D.ym_65 D.ym_67 D.ym_68 D.ym_69 D.ym_70
                  D.ym_72 D.ym_73 D.ym_74 D.ym_75 D.ym_76 D.ym_77 D.ym_78 D.ym_79
                  D.ym_80 D.ym_81 D.ym_83 D.ym_84 D.ym_86 D.ym_87 D.ym_88 D.ym_89
                  D.ym_90 D.ym_91 D.ym_92 D.ym_93 D.ym_94 D.ym_95 D.ym_96 D.ym_97
                  D.ym_98 D.ym_99 D.ym_100 D.ym_101 D.ym_102 D.ym_104 D.ym_105
                  D.ym_107 D.ym_108 D.ym_109 D.ym_111 D.ym_112 D.ym_113 D.ym_115
                  D.ym_116 D.ym_117 D.ym_118 D.ym_119 D.ym_120 D.ym_121 D.ym_122
                  D.ym_124 D.ym_126 D.ym_127 D.ym_128 D.ym_129 D.ym_130 D.ym_131
                  D.ym_132 D.ym_134 D.ym_135 D.ym_136 D.ym_137 D.ym_138 D.ym_139
                  D.ym_140 D.ym_141 D.ym_142 D.ym_143 D.ym_144 D.ym_145 D.ym_146
                  D.ym_147 D.ym_148
Instruments for level equation
        Standard: _cons

. outreg2 using `table_results'/Table8.tex, append bdec(3) sdec(2) tex(fragment) label ///
>                 addtext(Product FE, \checkmark, Month FE, \checkmark, Year FE, \checkmark, Month $\times$ Year FE, \checkmark) keep(dint1_inf_a di
> nt2_inf_a) ///
> ctitle("1970 -- 1982 (AB)") nocons nonotes nor2 noni nodepvar
../Results/Tables/Table8.tex
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  C:\Users\asilv\Documents\GitHub\Paper-Precios-CLS\Final_Codes\do\../Results/output/output.log
  log type:  text
 closed on:  24 Sep 2020, 13:27:10
----------------------------------------------------------------------------------------------------------------------------------------------------
